{"id":116913,"date":"2022-09-15T07:00:04","date_gmt":"2022-09-15T11:00:04","guid":{"rendered":"https:\/\/www.newswire.com\/news\/final-preparations-for-xii-fip-world-polo-championship-begin-21823431"},"modified":"2022-09-15T07:00:04","modified_gmt":"2022-09-15T11:00:04","slug":"final-preparations-for-xii-fip-world-polo-championship-begin","status":"publish","type":"post","link":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/","title":{"rendered":"Final Preparations for XII FIP World Polo Championship Begin"},"content":{"rendered":"\n\n                \n                                 <div style=\"float: right; margin: 5px 5px 5px 20px; width: 512px; max-width: 40%\"> <a href=\"https:\/\/cdn.newswire.com\/files\/x\/72\/5a\/8ef9bf7018d8c12d92df433c3a6c.jpg\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\"> <img src=\"https:\/\/cdn.newswire.com\/files\/x\/75\/3f\/5c24b3ce19af1203686159bc27c5.jpg\" alt=\"U.S. Polo Assn.\" style=\"display:none\" \/> <br \/> <small style=\"font-size: 0.8rem; margin: 5px 0 0 0\"><b>U.S. Polo Assn.<\/b><\/small> <\/a> <br \/> <small style=\"font-size: 0.7rem; margin: 5px 0 0 0\">U.S. Polo Assn.<\/small> <br \/><br \/> <\/div> \n                WELLINGTON, Fla.                -                September 15, 2022                                - (<a href=\"https:\/\/www.newswire.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">Newswire.com<\/a>)\n                                <br \/>\n                \n<p><a href=\"http:\/\/www.uspolo.org\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">The United States Polo Association<\/a>; <a href=\"http:\/\/www.uspoloassnglobal.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">U.S. Polo Assn.<\/a>, the official brand of the USPA; the National Polo Center - Wellington (NPC) and Valiente Polo Farm are making final preparations to host the XII Federation of International Polo (FIP) World Polo Championship in Florida this October. Welcoming the international contest to the United States for the second time in the competition's history, the tournament will take place from Oct. 29 - Nov. 6. Held every three to four years, the international tournament was originally scheduled for 2021 but was postponed due to the COVID-19 pandemic. Representing the top 10- to 14-goal teams from around the world, eight countries will grapple for international polo glory, including Argentina, Australia, Italy, Mexico, Pakistan, Spain, the United States and Uruguay. <\/p>\n<p>To qualify as one of the eight teams to advance to the FIP World Polo Championship, the road begins with five zone playoffs and includes more than 25 countries vying for the opportunity of a lifetime to represent their nation on an international stage. The defending champions (Argentina in 2017) and host country (United States) automatically qualify, and the remaining six teams have been decided from zone competition. Teams advancing from zone playoffs to the FIP World Polo Championship include Mexico (Zone A - North America and Central America), Uruguay (Zone B - South America), Spain and Italy (Zone C - Europe), Australia (Zone D - Asia and Oceania) and Pakistan (Zone E - Africa, Pakistan and India). <\/p>\n<p>The strengths of the United States lie in both high-quality horses and a prime location featuring world-class fields and facilities. Home to the GAUNTLET OF POLO<sup>®<\/sup>, NPC is the ideal venue for the event, attracting South Florida's passionate polo and equestrian community. Featuring top-rated polo fields, VIP experiences for both fans and players, and unrivaled corporate hospitality, the XII FIP World Polo Championship promises to be an exceptional and unforgettable global event for players, sponsors and spectators. Preliminary games will be held at Valiente Polo Farm and the opening ceremony, semifinals and final will take place at NPC. Ticketed NPC events will include the Opening Ceremony on Saturday, Oct. 29, and the XII FIP World Polo Championship Final on Sunday, Nov. 6. Tickets will become available mid-September at <a href=\"http:\/\/nationalpolocenter.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">nationalpolocenter.com<\/a>. The 2022 tournament will draw the eyes of the global polo community to the winter equestrian capital of the world with the FIP World Polo Championship semifinals and final broadcast on ESPN for the first time. All games will also be available for free on <a href=\"http:\/\/globalpolo.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\"><strong>GlobalPolo.com<\/strong><\/a>. <\/p>\n<p><strong>XII FIP World Polo Championship Tournament Schedule: <\/strong><\/p>\n<p><i>*Denotes a ticketed event<\/i>. <\/p>\n<p><strong>Saturday, Oct. 29<\/strong><\/p>\n<p>Game 1 <i>Valiente Polo Farm<\/i><br>Game 2 <i>Valiente Polo Farm<\/i><br>Game 3 <i>NPC<\/i><br>Game 4 & Opening Ceremony: USA Team vs. TBD <i>NPC, U.S. Polo Assn. Field One*<\/i><\/p>\n<p><strong>Monday, Oct. 31<\/strong><\/p>\n<p>Game 5 <i>Valiente Polo Farm<\/i><br>Game 6 <i>Valiente Polo Farm<\/i><br>Game 7 <i>Valiente Polo Farm<\/i><br>Game 8 <i>Valiente Polo Farm<\/i><\/p>\n<p><strong>Wednesday, Nov. 2<\/strong><\/p>\n<p>Game 9 <i>Valiente Polo Farm<\/i><br>Game 10 <i>Valiente Polo Farm<\/i><br>Game 11 <i>Valiente Polo Farm<\/i><br>Game 12 <i>Valiente Polo Farm<\/i><\/p>\n<p><strong>Friday, Nov. 4<\/strong><\/p>\n<p>1:00 p.m. ET - Semifinal 1 <i>NPC<\/i><br>3:00 p.m. ET - Semifinal 2 <i>NPC<\/i><\/p>\n<p><strong>Sunday, Nov. 6<\/strong><\/p>\n<p>1:00 p.m. ET - Third Place Match <i>NPC<\/i><br>3:00 p.m. ET - XII FIP World Polo Championship Final<i> NPC, U.S. Polo Assn. Field One*<\/i><\/p>\n<p>\"We are putting in a lot of resources to make this a world-class event,\" shared FIP United States Ambassador and USPA President Tony Coppola. \"No stone has been left unturned. The string of horses we are going to provide will be great, and the facilities will be fantastic and at their prime. The USPA's goal is to make this a world-class tournament and showcase what we have now that we own NPC.\"<\/p>\n<p>A defining feature of the XII FIP World Polo Championship is the 176 exceptional horses representing some of the best bloodlines in the world from sole horse provider J5 Equestrian. USPA Executive Director of Services Carlucho Arellano noted the importance of having such high-quality horses for a competition of this caliber, sharing, \"Providing good horses is one of the three key ingredients to quality polo, along with great fields and solid management.\"<\/p>\n<p>Further detailing how the horses will be preparing for intense competition, he continued, \"The horses are currently in several different locations and have been played during the summer in California and Colorado. They will get some rest time and then come to Wellington a month in advance of the Championship for the legging-up process. The final two weeks of that process will consist of practices that increase in intensity. The teams all arrive by Oct. 26, and they will get to ride their string once and play them in one practice before their first game on Oct. 29.\"<\/p>\n<p>Leading up to the tournament, the horses will also be evaluated and ranked in October by FIP horse master Adam Snow. Snow is a former 10-goaler and Hall of Famer. His experience both in the saddle and in the barn will make him an invaluable asset throughout the event. Snow will rank horses based on their ability and then place them into evenly-matched strings. Each team will be assigned a group of 22 horses, and teams will draw to select their pooled polo ponies in person on Wednesday, Oct. 26. <\/p>\n<p>In 1982, to broaden the scope of international polo and restore the sport's Olympic status, Marcos Uranga created the Federation of International Polo, officially recognized by the International Olympic Committee (IOC). Five years later, Uranga and American polo player Glen Holden organized the inaugural FIP World Polo Championship in Argentina. Aware of the challenges of fielding high-goal teams worldwide, FIP organizers decided to limit the competition to teams rated 10 to 14 goals. <\/p>\n<p>Capturing the title in Germany in 1989, the United States Polo Association has selected the most talented players to represent the USA team. Selected as the coach for the USA team, former 9-goal professional Julio Arellano was on the winning team in 1989 and is humbled at the opportunity to lead the United States for a FIP title on home soil. <\/p>\n<p>Ranging in age from 17 to 25, the eight American players vying for a spot on the starting roster include Nico Diaz Alberdi, Agustin Arellano, Hope Arellano, Joaquin Avendaño, Lucas Escobar, Nico Escobar, Jake Klentner and Kristos \"Keko\" Magrini. Of this extremely accomplished roster, Hope Arellano stands out, as she is the first woman to ever be considered for the American team. Players will train together in weekly practice games and stick-and-ball sessions for a month in Argentina beginning in September to determine the team's final lineup. Once the U.S. team returns home, they will begin practicing in Wellington, Florida, and exercising and preparing J5 Equestrian horses for competition leading up to the championship.<\/p>\n<p>Outfitting the teams with official performance jerseys and equipment as the Official Apparel Partner and Presenting Sponsor, U.S. Polo Assn. is proud to join forces once again with the FIP World Polo Championship to promote the brand during the pinnacle of international polo competition. \"This is truly a global event that will resonate with our consumers and sports fans around the world, across 190 countries. We are also excited our partners at ESPN will broadcast the opening ceremony featuring the USA team,\" said J. Michael Prince, President and CEO of USPA Global Licensing.<\/p>\n<p>For more information and updates, please visit the <a href=\"https:\/\/www.uspolo.org\/fip-world-championship\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\"><strong>FIP World Polo Championship landing page<\/strong><\/a><strong>.<\/strong>  <\/p>\n<p>###<\/p>\n<p><strong>About the United States Polo Association®  <\/strong><\/p>\n<p>The United States Polo Association was organized and exists for the purposes of promoting the game of polo, coordinating the activities of its Member Clubs and Registered Players, arranging and supervising polo tournaments, competitions and games, and providing rules, handicaps, and conditions for those tournaments, competitions, and games including the safety and welfare of participants and mounts. Founded in 1890, the USPA is the national governing body for the sport of polo. The USPA is currently comprised of almost 300 member clubs with thousands of individual members, and oversees 40 national tournaments. For more information, please visit <a href=\"https:\/\/www.uspolo.org\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">uspolo.org<\/a>.<\/p>\n<p><strong>About U.S. Polo Assn. and USPA Global Licensing Inc. (USPAGL)<\/strong><\/p>\n<p><strong>U.S. Polo Assn.<\/strong> is the official brand of the <strong>United States Polo Association (USPA),<\/strong> the nonprofit governing body for the sport of polo in the United States and one of the oldest sports governing bodies, having been founded in 1890. With a multi-billion-dollar global footprint and worldwide distribution through some 1,200 U.S. Polo Assn. retail stores and thousands of department stores as well as sporting goods channels, independent retailers and e-commerce, U.S. Polo Assn. offers apparel for men, women, and children, as well as accessories and footwear in 190 countries worldwide. Today, U.S. Polo Assn. is ranked the 28<sup>th<\/sup> largest licensor in the world and within the top five sports licensors, according to <i>License Global's<\/i> 2022 list of \"Top Global Licensors.\" Visit <a href=\"https:\/\/www.uspoloassnglobal.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">uspoloassnglobal.com<\/a>.<\/p>\n<p><strong>USPA Global Licensing Inc. (USPAGL)<\/strong> is the for-profit subsidiary of the USPA and its exclusive worldwide licensor. USPAGL manages the global, multi-billion-dollar U.S. Polo Assn. brand and is the steward of the USPA's intellectual properties, providing the sport with a long-term source of revenue. Through its subsidiary, Global Polo Entertainment (GPE), USPAGL also manages Global Polo TV, the world's leading digital platform with polo and lifestyle content. In addition, USPAGL partners with ESPN and beIN Sports globally to share the sport of polo broadcasts on television and on-demand to millions of viewers around the world. For more polo content visit <a href=\"https:\/\/www.globalpolo.com\/browse\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">globalpolo.com<\/a>.<\/p>\n<p><strong>About Federation of International Polo (FIP)<\/strong> <\/p>\n<p>The Federation of International Polo (FIP) is the international federation representing the sport of polo, officially recognized by the International Olympic Committee. It was created in 1982 by representatives of eleven national polo associations. FIP's principal aim is to enhance the image and status of the great game of polo internationally. <\/p>\n<p>FIP's mission is to promote the practice of the sport of polo worldwide in order to defend and ensure the spirit of fair play and moral fortitude, with the objective of forming the sporting attitude of gentlemanly behavior during and after the game, on the playing fields and wherever polo players should meet, so as to form one great world polo family. FIP currently has 76 registered member associations representing over 23,000 players. For more information, please visit <a href=\"http:\/\/www.fippolo.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">www.fippolo.com<\/a>. <\/p>\n<p><strong>About The National Polo Center - Wellington (NPC)<\/strong><\/p>\n<p>The National Polo Center - Wellington is located in the heart of South Florida's legendary horse country. The perpetual home for polo in America, NPC is owned and managed by the United States Polo Association to showcase the finest the sport has to offer. The Association's premiere event, the GAUNTLET OF POLO, takes place from February to April each winter season showcasing the world's preeminent teams, professional athletes and finest horses which come together for three months to battle head-to-head for the coveted C.V. Whitney Cup, USPA Gold Cup and U.S. Open Polo Championship trophies. Throughout the year, the facilities are also used to showcase USPA Member Clubs and prestigious national tournament competition.  <br> <br>The entrance to the club is via a palm tree-lined drive, that leads past tennis courts to the steps of the magnificent pool and Mallet Grille. The natural Florida terrain is augmented by a large lake, lush tropical landscaping and some of the most carefully manicured polo fields in the world. Spectating from the stadium, private boxes, fieldside tailgates and special hospitality tents, all overlooking the U.S. Polo Assn. Field One is an unparalleled experience. NPC invites you to experience the best polo in the country, taking place at one of the most beautiful venues in the world, the National Polo Center - Wellington<\/p>\n<p><strong>MEDIA CONTACTS<\/strong> <\/p>\n<p><strong>United States Polo Association:<\/strong> <br><br>Matt Baran, Director of Communications <br>(561) 373-4954 <br><a href=\"mailto:mbaran@uspolo.org\">mbaran@uspolo.org<\/a> <\/p>\n<p><strong>USPA Global Licensing:<\/strong> <\/p>\n<p>Shannon Stilson, Assistant Vice President of Marketing  <br>(561) 227-6994 <br><a href=\"mailto:sstilson@uspagl.com\">sstilson@uspagl.com<\/a> <\/p>\n<p><strong>Federation of International Polo:<\/strong><\/p>\n<p>Silvana Rando, Administrative Assistant <br><a href=\"mailto:srando@fippolo.com\">srando@fippolo.com<\/a> <\/p>\n<p>Veronica Igoa, FIP Social Media <br><a href=\"mailto:Igoa.veronica@gmail.com\">Igoa.veronica@gmail.com<\/a>  <\/p>\n<p><strong>J5 Equestrian:<\/strong><\/p>\n<p>Rob Jornayvaz, Owner <br><a href=\"mailto:Rob@runningironcreative.com\">Rob@runningironcreative.com<\/a> <br>Cell: 303-803-3607 <br>Alt: 847-840-8408 <\/p>\n<p>Visit our website at <a href=\"http:\/\/www.uspolo.org\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">www.uspolo.org<\/a><br>Follow us on Instagram<br><a href=\"https:\/\/www.instagram.com\/uspoloassociation\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">@uspoloassociation<\/a> <br><a href=\"https:\/\/www.instagram.com\/uspoloassn\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">@uspoloassn<\/a> <br><a href=\"https:\/\/www.instagram.com\/nationalpolocenter\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">@nationalpolocenter<\/a><br><a href=\"https:\/\/www.instagram.com\/fip_polo\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">@fip_polo<\/a> <\/p>\n<br \/>\n\n                \n                \n                \n                                        <strong>Related Images<\/strong><br \/>\n            <div style=\"margin: 5px 10px 0 0; width: 160px; max-width: 30%; float: left\">\n        <a href=\"https:\/\/cdn.newswire.com\/files\/x\/72\/5a\/8ef9bf7018d8c12d92df433c3a6c.jpg\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">\n            <img src=\"https:\/\/cdn.newswire.com\/files\/x\/57\/1e\/9660c6833772eee2c9c129042414.jpg\"\n                  alt=\"U.S. Polo Assn.\"\n                  width=\"160\" height=\"110\" \/>\n                        <br \/>\n            <small style=\"font-size: 0.8rem; margin: 5px 0 0 0\"><b>U.S. Polo Assn.<\/b><\/small>\n                    <\/a>\n                        <br \/>\n            <small style=\"font-size: 0.6rem; margin: 5px 0 0 0\">U.S. Polo Assn.<\/small>\n                    <br \/><br \/>\n    <\/div>\n            <div style=\"margin: 5px 10px 0 0; width: 160px; max-width: 30%; float: left\">\n        <a href=\"https:\/\/cdn.newswire.com\/files\/x\/63\/7e\/fc6ff3d2d44c6636f19a490884b9.jpg\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">\n            <img src=\"https:\/\/cdn.newswire.com\/files\/x\/21\/7d\/4b266e9759e7fd2a7942139ecd7a.jpg\"\n                  alt=\"U.S. Polo Assn.\"\n                  width=\"160\" height=\"110\" \/>\n                        <br \/>\n            <small style=\"font-size: 0.8rem; margin: 5px 0 0 0\"><b>U.S. Polo Assn.<\/b><\/small>\n                    <\/a>\n                        <br \/>\n            <small style=\"font-size: 0.6rem; margin: 5px 0 0 0\">U.S. Polo Assn.<\/small>\n                    <br \/><br \/>\n    <\/div>\n            <div style=\"clear: both\"><\/div>\n    \n                \n                <br \/><br \/>\n                Press Release Service\n                by\n                <a href=\"https:\/\/www.newswire.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">Newswire.com<\/a> <br \/><br \/>Original Source:\n                <a href=\"https:\/\/www.newswire.com\/news\/final-preparations-for-xii-fip-world-polo-championship-begin-21823431\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">\n                    Final Preparations for XII FIP World Polo Championship Begin                <\/a>\n\n                                    <img src=\"https:\/\/stats.newswire.com\/x\/im?ref=WyIzbm9oajMiXQ&hit%2Csum=WyJjM3RzZiIsImJ5M3I3IiwiM25vaGozIiwiM25xY21yIl0\" width=\"1\" height=\"1\" \/>\n                \n            ","protected":false},"excerpt":{"rendered":"<p>                                     U.S. Polo Assn.   U.S. Polo Assn.<br \/>\n                WELLINGTON, Fla.                &#8211;                September 15, 2022                                &#8211; (Newswire.com)<br \/>\n                           &#8230;<\/p>\n","protected":false},"author":1,"featured_media":116914,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[548],"tags":[],"class_list":["post-116913","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fashion"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"U.S. Polo Assn. U.S. Polo Assn. WELLINGTON, Fla. - September 15, 2022 - (Newswire.com) ...\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"Final Preparations for XII FIP World Polo Championship Begin - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"U.S. Polo Assn. U.S. Polo Assn. WELLINGTON, Fla. - September 15, 2022 - (Newswire.com) ...\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/cdn.newswire.com\/files\/x\/75\/3f\/5c24b3ce19af1203686159bc27c5.jpg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/cdn.newswire.com\/files\/x\/75\/3f\/5c24b3ce19af1203686159bc27c5.jpg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2022-09-15T11:00:04+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2022-09-15T11:00:04+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"Final Preparations for XII FIP World Polo Championship Begin - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"U.S. Polo Assn. U.S. Polo Assn. WELLINGTON, Fla. - September 15, 2022 - (Newswire.com) ...\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/cdn.newswire.com\/files\/x\/75\/3f\/5c24b3ce19af1203686159bc27c5.jpg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/#blogposting\",\"name\":\"Final Preparations for XII FIP World Polo Championship Begin - Beauty Ring Magazine\",\"headline\":\"Final Preparations for XII FIP World Polo Championship Begin\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/cdn.newswire.com\\\/files\\\/x\\\/75\\\/3f\\\/5c24b3ce19af1203686159bc27c5.jpg\",\"caption\":\"Final Preparations for XII FIP World Polo Championship Begin\"},\"datePublished\":\"2022-09-15T07:00:04-04:00\",\"dateModified\":\"2022-09-15T07:00:04-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/#webpage\"},\"articleSection\":\"Fashion\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\",\"position\":2,\"name\":\"Fashion\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/#listItem\",\"position\":3,\"name\":\"Final Preparations for XII FIP World Polo Championship Begin\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/\",\"name\":\"Final Preparations for XII FIP World Polo Championship Begin - Beauty Ring Magazine\",\"description\":\"U.S. Polo Assn. U.S. Polo Assn. WELLINGTON, Fla. - September 15, 2022 - (Newswire.com) ...\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/cdn.newswire.com\\\/files\\\/x\\\/75\\\/3f\\\/5c24b3ce19af1203686159bc27c5.jpg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/#mainImage\",\"caption\":\"Final Preparations for XII FIP World Polo Championship Begin\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/final-preparations-for-xii-fip-world-polo-championship-begin\\\/#mainImage\"},\"datePublished\":\"2022-09-15T07:00:04-04:00\",\"dateModified\":\"2022-09-15T07:00:04-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>Final Preparations for XII FIP World Polo Championship Begin - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"Final Preparations for XII FIP World Polo Championship Begin - Beauty Ring Magazine","description":"U.S. Polo Assn. U.S. Polo Assn. WELLINGTON, Fla. - September 15, 2022 - (Newswire.com) ...","canonical_url":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"Final Preparations for XII FIP World Polo Championship Begin - Beauty Ring Magazine","og:description":"U.S. Polo Assn. U.S. Polo Assn. WELLINGTON, Fla. - September 15, 2022 - (Newswire.com) ...","og:url":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/","og:image":"https:\/\/cdn.newswire.com\/files\/x\/75\/3f\/5c24b3ce19af1203686159bc27c5.jpg","og:image:secure_url":"https:\/\/cdn.newswire.com\/files\/x\/75\/3f\/5c24b3ce19af1203686159bc27c5.jpg","article:published_time":"2022-09-15T11:00:04+00:00","article:modified_time":"2022-09-15T11:00:04+00:00","twitter:card":"summary_large_image","twitter:title":"Final Preparations for XII FIP World Polo Championship Begin - Beauty Ring Magazine","twitter:description":"U.S. Polo Assn. U.S. Polo Assn. WELLINGTON, Fla. - September 15, 2022 - (Newswire.com) ...","twitter:image":"https:\/\/cdn.newswire.com\/files\/x\/75\/3f\/5c24b3ce19af1203686159bc27c5.jpg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/#blogposting","name":"Final Preparations for XII FIP World Polo Championship Begin - Beauty Ring Magazine","headline":"Final Preparations for XII FIP World Polo Championship Begin","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/cdn.newswire.com\/files\/x\/75\/3f\/5c24b3ce19af1203686159bc27c5.jpg","caption":"Final Preparations for XII FIP World Polo Championship Begin"},"datePublished":"2022-09-15T07:00:04-04:00","dateModified":"2022-09-15T07:00:04-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/#webpage"},"articleSection":"Fashion"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/fashion\/#listItem","position":2,"name":"Fashion","item":"https:\/\/beautyring.info\/category\/fashion\/","nextItem":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/#listItem","position":3,"name":"Final Preparations for XII FIP World Polo Championship Begin","previousItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/#webpage","url":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/","name":"Final Preparations for XII FIP World Polo Championship Begin - Beauty Ring Magazine","description":"U.S. Polo Assn. U.S. Polo Assn. WELLINGTON, Fla. - September 15, 2022 - (Newswire.com) ...","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/cdn.newswire.com\/files\/x\/75\/3f\/5c24b3ce19af1203686159bc27c5.jpg","@id":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/#mainImage","caption":"Final Preparations for XII FIP World Polo Championship Begin"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/#mainImage"},"datePublished":"2022-09-15T07:00:04-04:00","dateModified":"2022-09-15T07:00:04-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"116913","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-04-11 20:37:29","updated":"2023-04-11 20:38:10"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/fashion\/\" title=\"Fashion\">Fashion<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tFinal Preparations for XII FIP World Polo Championship Begin\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Fashion","link":"https:\/\/beautyring.info\/category\/fashion\/"},{"label":"Final Preparations for XII FIP World Polo Championship Begin","link":"https:\/\/beautyring.info\/fashion\/final-preparations-for-xii-fip-world-polo-championship-begin\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/116913"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=116913"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/116913\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/116914"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=116913"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=116913"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=116913"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}