{"id":116940,"date":"2022-08-17T09:00:08","date_gmt":"2022-08-17T13:00:08","guid":{"rendered":"https:\/\/www.newswire.com\/news\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-21798380"},"modified":"2022-08-17T09:00:08","modified_gmt":"2022-08-17T13:00:08","slug":"filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week","status":"publish","type":"post","link":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/","title":{"rendered":"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#8217;s  New York Fashion Week"},"content":{"rendered":"\n\n                                <b>Daily Malong&#039;s New Collection Featured at this Year&#039;s SS22 NYFW<\/b>\n                <br \/><br \/>\n                \n                                 <div style=\"float: right; margin: 5px 5px 5px 20px; width: 512px; max-width: 40%\"> <a href=\"https:\/\/cdn.newswire.com\/files\/x\/ed\/07\/1eaa39a242a9e86e3d9dc33e5849.jpg\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\"> <img src=\"https:\/\/cdn.newswire.com\/files\/x\/c8\/b9\/c6b8ddae7834de2f39dc4db0c68c.jpg\" alt=\"Editorial Image by Lareni Terukina and Natalia Roxas\" style=\"display:none\" \/> <br \/> <small style=\"font-size: 0.8rem; margin: 5px 0 0 0\"><b>Editorial Image by Lareni Terukina and Natalia Roxas<\/b><\/small> <\/a> <br \/><br \/> <\/div> \n                NEW YORK                -                August 17, 2022                                - (<a href=\"https:\/\/www.newswire.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">Newswire.com<\/a>)\n                                <br \/>\n                \n<p>Daily Malong brings a royalty inspired collection for its second year at New York Fashion Week. Keeping their momentum from last year's debut in New York Fashion Week, Daily Malong once again champions Filipino Indigenous weaving through intentional pieces that will set the future of Pilipinx fashion in the diaspora. With the overarching theme of \"Royalty is Indigenous,\" the collection and its theme embody the soul of traditional weaving and designs that are rooted in the pre-colonial era of the Philippines. The pre-colonial Philippines is considered the golden age of ingenuity.<\/p>\n<p>The new collection flaunts intricate artisan hand-woven pieces, which were adorned by pre-colonial tribal leaders, master artists, shamans and other important roles in communities called barangay or balangay. The vibrant prints and designs represent strength, solidarity, and tradition that embody the true regal spirit of the culture. Daily Malong is pivoting the conversation around indigeneity into the present and future by showcasing pieces that show the true essence of less tapped Filipino culture that is reminiscent of artistry beyond the more common Manila-centric and post colonial narrative. Expect to see empowered silhouettes and strobes of colors as the handwoven fabrics meld into modern ensembles.<\/p>\n<p>Creative Director (Lydia Querian) started Daily Malong's journey due to a growing interest of the Pilipinx community in indigenous culture and heritage. Lydia saw the opportunity between the diaspora's needs for cultural identity and the indigenous Filipinos' need to keep the living traditions. Daily Malong provides the North American market with a supply of fashionable clothing pieces that use artisan textiles and materials. The pieces can be casual and formal wear, which easily fall under the categories of high fashion, sustainable, and slow fashion. As a social enterprise, Daily Malong takes pride in providing livelihood to indigenous communities in the Philippines through an ethical supply chain, bridging the gap between both spectrums of the diaspora and the homeland. \"Bringing indigenous weaving practices to the future perpetuates time-tested traditions, helping the present and protecting the future,\" said Querian. \"Each indigenous textile worn today helps wearers and weavers navigate societal atrocities, prevent climate change, and restore a more sustainable environment.\" <\/p>\n<p>The show is ready to set another groundbreaking fashion display at the Rooftop of The Edison at Time Square on September 10, 2022, at 5:00 PM EST in partnership with hiTechMODA. hiTechMODA is a brand that promotes fashion brands focused on environmental causes, sustainability, and inclusivity, which is in line with Daily Malong's values.<\/p>\n<p>For more information on Daily Malong, visit their website at <a href=\"https:\/\/www.dailymalong.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">www.dailymalong.com<\/a> and their social media pages @DailyMalong<\/p>\n<p>***<\/p>\n<p><strong>About Daily Malong<\/strong><\/p>\n<p>Daily Malong strives to empower Indigenous Filipino artisans to continue their living traditions by extending appreciation in the diaspora. Daily Malong is an ecommerce store promoting the application of indigenous handwoven textiles on modern wearables offering handwoven products sourced from different indigenous communities in the Philippines through different apparels, accessories and home goods. The store is proud of its sustainable operations by working directly with communities. <\/p>\n<p><strong>About the Designer: <\/strong>Lydia Querian is a multi-faceted artist. A fashion designer, dance and music practitioner who left her corporate career to pursue deeper cultural work and entrepreneurship. Born and raised in the Philippines she lived in San Francisco for 10 years and now based in Hawaii. She's done several performances, having toured nationally and internationally with Dancing Earth, KulArts, Parangal Dance Company and Fusion Dance Project. Querian was a featured artist at the Smithsonian Folklife Festival in 2017 and the Merrie Monarch Festival in 2016. Lydia completed Fashion Design and Fashion business certification from Parsons New School and as her work evolves, she frequently immerses with indigenous communities in both Southern and Northern Philippines.<\/p>\n<p>Alongside her passion for fashion, she co-founded several organizations, chaired several others, and produced several events that act as pillars in the Filipino community. She is also the executive producer of Gongster's Paradise, the only Kulintang Festival in North America, which has been long standing since 2017.<\/p>\n<p>Her work was recently featured at SS21 New York Fashion Week. Daily Malong and all her other work is on a mission to help empower Indigenous Filipino artists to continue their living traditions by extending appreciation in the diaspora. She believes that bringing indigenous practices to the future perpetuates time-tested traditions, helping the present and protecting the future. Each indigenous textile, music and movement executed today helps navigate societal atrocities, prevent climate change, and restore a more sustainable environment.<\/p>\n<p><strong>Press Contact: <\/strong>Frany. Joson<\/p>\n<p><strong>Group:<\/strong> Divine Creative Studio (on behalf of Daily Malong)<br><strong>Email: <\/strong><a href=\"mailto:frany@divinecreativestudio.com\">frany@divinecreativestudio.com<\/a><\/p>\n<br \/>\n\n                \n                \n                                    \n                \n                <br \/><br \/>\n                Press Release Service\n                by\n                <a href=\"https:\/\/www.newswire.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">Newswire.com<\/a> <br \/><br \/>Original Source:\n                <a href=\"https:\/\/www.newswire.com\/news\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-21798380\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">\n                    Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#039;s  New York Fashion Week                <\/a>\n\n                                    <img src=\"https:\/\/stats.newswire.com\/x\/im?ref=WyIzbWg5cHMiXQ&hit%2Csum=WyIxNG42bWMiLCIxNG0wMzYiLCIzbWg5cHMiLCIzbWlocHIiXQ\" width=\"1\" height=\"1\" \/>\n                \n            ","protected":false},"excerpt":{"rendered":"<p><b>Daily Malong&#8217;s New Collection Featured at this Year&#8217;s SS22 NYFW<\/b><\/p>\n<div> <a href=\"https:\/\/cdn.newswire.com\/files\/x\/ed\/07\/1eaa39a242a9e86e3d9dc33e5849.jpg\" target=\"_blank\" rel=\"noopener external noreferrer sponsored nofollow\" data-wpel-link=\"external\"> <img decoding=\"async\" src=\"https:\/\/cdn.newswire.com\/files\/x\/c8\/b9\/c6b8ddae7834de2f39dc4db0c68c.jpg\" alt=\"Editorial Image by Lareni Terukina and Natalia Roxas\"> <br \/> <small><b>Editorial Image by Lareni Terukina and Natalia Roxas<\/b><\/small> <\/a> <\/p><\/div>\n<p>                NEW YORK                &#8211;                August 17, 2022                                &#8211; (<a href=\"https:\/\/www.newswire.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"external noopener noreferrer sponsored nofollow\">Newswire.com<\/a>)<br \/>\n                                <\/p>\n<p>Daily Malong brings a royalty inspired collection for its second year at New York Fashion Week. Keeping their momentum from last year&#8217;s debut in New York Fashion Week, Daily Malong once again champions Filipino Indigenous weaving through intentional pieces that will set the future of Pilipinx fashion in the diaspora. With the overarching theme of &#8220;Royalty is Indigenous,&#8221; the collection and its theme embody the soul of traditional weaving and designs that are rooted in the pre-colonial era of the Philippines. The pre-colonial Philippines is considered the golden age of ingenuity.<\/p>\n<p>The new collection flaunts intricate artisan hand-woven pieces, which were adorned by pre-colonial tribal leaders, master artists, shamans and other important roles in communities called barangay or balangay. The vibrant prints and designs represent strength, solidarity, and tradition that embody the true regal spirit of the culture. Daily Malong is pivoting the conversation around indigeneity into the present and future by showcasing pieces that show the true essence of less tapped Filipino culture that is reminiscent of artistry beyond the more common Manila-centric and post colonial narrative. Expect to see empowered silhouettes and strobes of colors as the handwoven fabrics meld into modern ensembles.<\/p>\n<p>Creative Director (Lydia Querian) started Daily Malong&#8217;s journey due to a growing interest of the Pilipinx community in indigenous culture and heritage. Lydia saw the opportunity between the diaspora&#8217;s needs for cultural identity and the indigenous Filipinos&#8217; need to keep the living traditions. Daily Malong provides the North American market with a supply of fashionable clothing pieces that use artisan textiles and materials. The pieces can be casual and formal wear, which easily fall under the categories of high fashion, sustainable, and slow fashion. As a social enterprise, Daily Malong takes pride in providing livelihood to indigenous communities in the Philippines through an ethical supply chain, bridging the gap between both spectrums of the diaspora and the homeland. &#8220;Bringing indigenous weaving practices to the future perpetuates time-tested traditions, helping the present and protecting the future,&#8221; said Querian. &#8220;Each indigenous textile worn today helps wearers and weavers navigate societal atrocities, prevent climate change, and restore a more sustainable environment.&#8221; <\/p>\n<p>The show is ready to set another groundbreaking fashion display at the Rooftop of The Edison at Time Square on September 10, 2022, at 5:00 PM EST in partnership with hiTechMODA. hiTechMODA is a brand that promotes fashion brands focused on environmental causes, sustainability, and inclusivity, which is in line with Daily Malong&#8217;s values.<\/p>\n<p>For more information on Daily Malong, visit their website at <a href=\"https:\/\/www.dailymalong.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"external noopener noreferrer sponsored nofollow\">www.dailymalong.com<\/a> and their social media pages @DailyMalong<\/p>\n<p>***<\/p>\n<p><strong>About Daily Malong<\/strong><\/p>\n<p>Daily Malong strives to empower Indigenous Filipino artisans to continue their living traditions by extending appreciation in the diaspora. Daily Malong is an ecommerce store promoting the application of indigenous handwoven textiles on modern wearables offering handwoven products sourced from different indigenous communities in the Philippines through different apparels, accessories and home goods. The store is proud of its sustainable operations by working directly with communities. <\/p>\n<p><strong>About the Designer: <\/strong>Lydia Querian is a multi-faceted artist. A fashion designer, dance and music practitioner who left her corporate career to pursue deeper cultural work and entrepreneurship. Born and raised in the Philippines she lived in San Francisco for 10 years and now based in Hawaii. She&#8217;s done several performances, having toured nationally and internationally with Dancing Earth, KulArts, Parangal Dance Company and Fusion Dance Project. Querian was a featured artist at the Smithsonian Folklife Festival in 2017 and the Merrie Monarch Festival in 2016. Lydia completed Fashion Design and Fashion business certification from Parsons New School and as her work evolves, she frequently immerses with indigenous communities in both Southern and Northern Philippines.<\/p>\n<p>Alongside her passion for fashion, she co-founded several organizations, chaired several others, and produced several events that act as pillars in the Filipino community. She is also the executive producer of Gongster&#8217;s Paradise, the only Kulintang Festival in North America, which has been long standing since 2017.<\/p>\n<p>Her work was recently featured at SS21 New York Fashion Week. Daily Malong and all her other work is on a mission to help empower Indigenous Filipino artists to continue their living traditions by extending appreciation in the diaspora. She believes that bringing indigenous practices to the future perpetuates time-tested traditions, helping the present and protecting the future. Each indigenous textile, music and movement executed today helps navigate societal atrocities, prevent climate change, and restore a more sustainable environment.<\/p>\n<p><strong>Press Contact: <\/strong>Frany. Joson<\/p>\n<p><strong>Group:<\/strong> Divine Creative Studio (on behalf of Daily Malong)<br \/><strong>Email: <\/strong><a href=\"mailto:frany@divinecreativestudio.com\">frany@divinecreativestudio.com<\/a><\/p>\n<p>\n                Press Release Service<br \/>\n                by<br \/>\n                <a href=\"https:\/\/www.newswire.com\/\" data-wpel-link=\"external\" target=\"_blank\" rel=\"external noopener noreferrer sponsored nofollow\">Newswire.com<\/a> <\/p>\n<p>Original Source:<br \/>\n                <a href=\"https:\/\/www.newswire.com\/news\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-21798380\" data-wpel-link=\"external\" target=\"_blank\" rel=\"external noopener noreferrer sponsored nofollow\"><br \/>\n                    Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#8217;s  New York Fashion Week                <\/a><\/p>\n<p>                                    <img decoding=\"async\" src=\"https:\/\/stats.newswire.com\/x\/im?ref=WyIzbWg5cHMiXQ&amp;hit%2Csum=WyIxNG42bWMiLCIxNG0wMzYiLCIzbWg5cHMiLCIzbWlocHIiXQ\" width=\"1\" height=\"1\"><\/p>\n","protected":false},"author":1,"featured_media":116941,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[548],"tags":[],"class_list":["post-116940","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fashion"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"Daily Malong&#039;s New Collection Featured at this Year&#039;s SS22 NYFW Editorial Image by Lareni Terukina and Natalia Roxas NEW YORK - August 17, 2022 - (Newswire.com) Daily Malong brings a royalty inspired collection for its second year at New York Fashion Week. Keeping their momentum from last year&#039;s debut in New York Fashion Week, Daily Malong once again champions Filipino Indigenous weaving through intentional pieces that will set the future of Pilipinx fashion in the diaspora. With the overarching theme of &quot;Royalty is Indigenous,&quot; the collection and its theme embody the soul of traditional weaving and designs that are rooted in the pre-colonial era of the Philippines. The pre-colonial Philippines is considered the golden age of ingenuity. The new collection flaunts intricate artisan hand-woven pieces, which were adorned by pre-colonial tribal leaders, master artists, shamans and other important roles in communities called barangay or balangay. The vibrant prints and designs represent strength, solidarity, and tradition that embody the true regal spirit of the culture. Daily Malong is pivoting the conversation around indigeneity into the present and future by showcasing pieces that show the true essence of less tapped Filipino culture that is reminiscent of artistry beyond the more common Manila-centric and post colonial narrative. Expect to see empowered silhouettes and strobes of colors as the handwoven fabrics meld into modern ensembles. Creative Director (Lydia Querian) started Daily Malong&#039;s journey due to a growing interest of the Pilipinx community in indigenous culture and heritage. Lydia saw the opportunity between the diaspora&#039;s needs for cultural identity and the indigenous Filipinos&#039; need to keep the living traditions. Daily Malong provides the North American market with a supply of fashionable clothing pieces that use artisan textiles and materials. The pieces can be casual and formal wear, which easily fall under the categories of high fashion, sustainable, and slow fashion. As a social enterprise, Daily Malong takes pride in providing livelihood to indigenous communities in the Philippines through an ethical supply chain, bridging the gap between both spectrums of the diaspora and the homeland. &quot;Bringing indigenous weaving practices to the future perpetuates time-tested traditions, helping the present and protecting the future,&quot; said Querian. &quot;Each indigenous textile worn today helps wearers and weavers navigate societal atrocities, prevent climate change, and restore a more sustainable environment.&quot; The show is ready to set another groundbreaking fashion display at the Rooftop of The Edison at Time Square on September 10, 2022, at 5:00 PM EST in partnership with hiTechMODA. hiTechMODA is a brand that promotes fashion brands focused on environmental causes, sustainability, and inclusivity, which is in line with Daily Malong&#039;s values. For more information on Daily Malong, visit their website at www.dailymalong.com and their social media pages @DailyMalong *** About Daily Malong Daily Malong strives to empower Indigenous Filipino artisans to continue their living traditions by extending appreciation in the diaspora. Daily Malong is an ecommerce store promoting the application of indigenous handwoven textiles on modern wearables offering handwoven products sourced from different indigenous communities in the Philippines through different apparels, accessories and home goods. The store is proud of its sustainable operations by working directly with communities. About the Designer: Lydia Querian is a multi-faceted artist. A fashion designer, dance and music practitioner who left her corporate career to pursue deeper cultural work and entrepreneurship. Born and raised in the Philippines she lived in San Francisco for 10 years and now based in Hawaii. She&#039;s done several performances, having toured nationally and internationally with Dancing Earth, KulArts, Parangal Dance Company and Fusion Dance Project. Querian was a featured artist at the Smithsonian Folklife Festival in 2017 and the Merrie Monarch Festival in 2016. Lydia completed Fashion Design and Fashion business certification from Parsons New School and as her work evolves, she frequently immerses with indigenous communities in both Southern and Northern Philippines. Alongside her passion for fashion, she co-founded several organizations, chaired several others, and produced several events that act as pillars in the Filipino community. She is also the executive producer of Gongster&#039;s Paradise, the only Kulintang Festival in North America, which has been long standing since 2017. Her work was recently featured at SS21 New York Fashion Week. Daily Malong and all her other work is on a mission to help empower Indigenous Filipino artists to continue their living traditions by extending appreciation in the diaspora. She believes that bringing indigenous practices to the future perpetuates time-tested traditions, helping the present and protecting the future. Each indigenous textile, music and movement executed today helps navigate societal atrocities, prevent climate change, and restore a more sustainable environment. Press Contact: Frany. Joson Group: Divine Creative Studio (on behalf of Daily Malong)Email: frany@divinecreativestudio.com Press Release Service by Newswire.com Original Source: Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#039;s New York Fashion Week\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year’s New York Fashion Week - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"Daily Malong&#039;s New Collection Featured at this Year&#039;s SS22 NYFW Editorial Image by Lareni Terukina and Natalia Roxas NEW YORK - August 17, 2022 - (Newswire.com) Daily Malong brings a royalty inspired collection for its second year at New York Fashion Week. Keeping their momentum from last year&#039;s debut in New York Fashion Week, Daily Malong once again champions Filipino Indigenous weaving through intentional pieces that will set the future of Pilipinx fashion in the diaspora. With the overarching theme of &quot;Royalty is Indigenous,&quot; the collection and its theme embody the soul of traditional weaving and designs that are rooted in the pre-colonial era of the Philippines. The pre-colonial Philippines is considered the golden age of ingenuity. The new collection flaunts intricate artisan hand-woven pieces, which were adorned by pre-colonial tribal leaders, master artists, shamans and other important roles in communities called barangay or balangay. The vibrant prints and designs represent strength, solidarity, and tradition that embody the true regal spirit of the culture. Daily Malong is pivoting the conversation around indigeneity into the present and future by showcasing pieces that show the true essence of less tapped Filipino culture that is reminiscent of artistry beyond the more common Manila-centric and post colonial narrative. Expect to see empowered silhouettes and strobes of colors as the handwoven fabrics meld into modern ensembles. Creative Director (Lydia Querian) started Daily Malong&#039;s journey due to a growing interest of the Pilipinx community in indigenous culture and heritage. Lydia saw the opportunity between the diaspora&#039;s needs for cultural identity and the indigenous Filipinos&#039; need to keep the living traditions. Daily Malong provides the North American market with a supply of fashionable clothing pieces that use artisan textiles and materials. The pieces can be casual and formal wear, which easily fall under the categories of high fashion, sustainable, and slow fashion. As a social enterprise, Daily Malong takes pride in providing livelihood to indigenous communities in the Philippines through an ethical supply chain, bridging the gap between both spectrums of the diaspora and the homeland. &quot;Bringing indigenous weaving practices to the future perpetuates time-tested traditions, helping the present and protecting the future,&quot; said Querian. &quot;Each indigenous textile worn today helps wearers and weavers navigate societal atrocities, prevent climate change, and restore a more sustainable environment.&quot; The show is ready to set another groundbreaking fashion display at the Rooftop of The Edison at Time Square on September 10, 2022, at 5:00 PM EST in partnership with hiTechMODA. hiTechMODA is a brand that promotes fashion brands focused on environmental causes, sustainability, and inclusivity, which is in line with Daily Malong&#039;s values. For more information on Daily Malong, visit their website at www.dailymalong.com and their social media pages @DailyMalong *** About Daily Malong Daily Malong strives to empower Indigenous Filipino artisans to continue their living traditions by extending appreciation in the diaspora. Daily Malong is an ecommerce store promoting the application of indigenous handwoven textiles on modern wearables offering handwoven products sourced from different indigenous communities in the Philippines through different apparels, accessories and home goods. The store is proud of its sustainable operations by working directly with communities. About the Designer: Lydia Querian is a multi-faceted artist. A fashion designer, dance and music practitioner who left her corporate career to pursue deeper cultural work and entrepreneurship. Born and raised in the Philippines she lived in San Francisco for 10 years and now based in Hawaii. She&#039;s done several performances, having toured nationally and internationally with Dancing Earth, KulArts, Parangal Dance Company and Fusion Dance Project. Querian was a featured artist at the Smithsonian Folklife Festival in 2017 and the Merrie Monarch Festival in 2016. Lydia completed Fashion Design and Fashion business certification from Parsons New School and as her work evolves, she frequently immerses with indigenous communities in both Southern and Northern Philippines. Alongside her passion for fashion, she co-founded several organizations, chaired several others, and produced several events that act as pillars in the Filipino community. She is also the executive producer of Gongster&#039;s Paradise, the only Kulintang Festival in North America, which has been long standing since 2017. Her work was recently featured at SS21 New York Fashion Week. Daily Malong and all her other work is on a mission to help empower Indigenous Filipino artists to continue their living traditions by extending appreciation in the diaspora. She believes that bringing indigenous practices to the future perpetuates time-tested traditions, helping the present and protecting the future. Each indigenous textile, music and movement executed today helps navigate societal atrocities, prevent climate change, and restore a more sustainable environment. Press Contact: Frany. Joson Group: Divine Creative Studio (on behalf of Daily Malong)Email: frany@divinecreativestudio.com Press Release Service by Newswire.com Original Source: Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#039;s New York Fashion Week\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/cdn.newswire.com\/files\/x\/c8\/b9\/c6b8ddae7834de2f39dc4db0c68c.jpg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/cdn.newswire.com\/files\/x\/c8\/b9\/c6b8ddae7834de2f39dc4db0c68c.jpg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2022-08-17T13:00:08+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2022-08-17T13:00:08+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year’s New York Fashion Week - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"Daily Malong&#039;s New Collection Featured at this Year&#039;s SS22 NYFW Editorial Image by Lareni Terukina and Natalia Roxas NEW YORK - August 17, 2022 - (Newswire.com) Daily Malong brings a royalty inspired collection for its second year at New York Fashion Week. Keeping their momentum from last year&#039;s debut in New York Fashion Week, Daily Malong once again champions Filipino Indigenous weaving through intentional pieces that will set the future of Pilipinx fashion in the diaspora. With the overarching theme of &quot;Royalty is Indigenous,&quot; the collection and its theme embody the soul of traditional weaving and designs that are rooted in the pre-colonial era of the Philippines. The pre-colonial Philippines is considered the golden age of ingenuity. The new collection flaunts intricate artisan hand-woven pieces, which were adorned by pre-colonial tribal leaders, master artists, shamans and other important roles in communities called barangay or balangay. The vibrant prints and designs represent strength, solidarity, and tradition that embody the true regal spirit of the culture. Daily Malong is pivoting the conversation around indigeneity into the present and future by showcasing pieces that show the true essence of less tapped Filipino culture that is reminiscent of artistry beyond the more common Manila-centric and post colonial narrative. Expect to see empowered silhouettes and strobes of colors as the handwoven fabrics meld into modern ensembles. Creative Director (Lydia Querian) started Daily Malong&#039;s journey due to a growing interest of the Pilipinx community in indigenous culture and heritage. Lydia saw the opportunity between the diaspora&#039;s needs for cultural identity and the indigenous Filipinos&#039; need to keep the living traditions. Daily Malong provides the North American market with a supply of fashionable clothing pieces that use artisan textiles and materials. The pieces can be casual and formal wear, which easily fall under the categories of high fashion, sustainable, and slow fashion. As a social enterprise, Daily Malong takes pride in providing livelihood to indigenous communities in the Philippines through an ethical supply chain, bridging the gap between both spectrums of the diaspora and the homeland. &quot;Bringing indigenous weaving practices to the future perpetuates time-tested traditions, helping the present and protecting the future,&quot; said Querian. &quot;Each indigenous textile worn today helps wearers and weavers navigate societal atrocities, prevent climate change, and restore a more sustainable environment.&quot; The show is ready to set another groundbreaking fashion display at the Rooftop of The Edison at Time Square on September 10, 2022, at 5:00 PM EST in partnership with hiTechMODA. hiTechMODA is a brand that promotes fashion brands focused on environmental causes, sustainability, and inclusivity, which is in line with Daily Malong&#039;s values. For more information on Daily Malong, visit their website at www.dailymalong.com and their social media pages @DailyMalong *** About Daily Malong Daily Malong strives to empower Indigenous Filipino artisans to continue their living traditions by extending appreciation in the diaspora. Daily Malong is an ecommerce store promoting the application of indigenous handwoven textiles on modern wearables offering handwoven products sourced from different indigenous communities in the Philippines through different apparels, accessories and home goods. The store is proud of its sustainable operations by working directly with communities. About the Designer: Lydia Querian is a multi-faceted artist. A fashion designer, dance and music practitioner who left her corporate career to pursue deeper cultural work and entrepreneurship. Born and raised in the Philippines she lived in San Francisco for 10 years and now based in Hawaii. She&#039;s done several performances, having toured nationally and internationally with Dancing Earth, KulArts, Parangal Dance Company and Fusion Dance Project. Querian was a featured artist at the Smithsonian Folklife Festival in 2017 and the Merrie Monarch Festival in 2016. Lydia completed Fashion Design and Fashion business certification from Parsons New School and as her work evolves, she frequently immerses with indigenous communities in both Southern and Northern Philippines. Alongside her passion for fashion, she co-founded several organizations, chaired several others, and produced several events that act as pillars in the Filipino community. She is also the executive producer of Gongster&#039;s Paradise, the only Kulintang Festival in North America, which has been long standing since 2017. Her work was recently featured at SS21 New York Fashion Week. Daily Malong and all her other work is on a mission to help empower Indigenous Filipino artists to continue their living traditions by extending appreciation in the diaspora. She believes that bringing indigenous practices to the future perpetuates time-tested traditions, helping the present and protecting the future. Each indigenous textile, music and movement executed today helps navigate societal atrocities, prevent climate change, and restore a more sustainable environment. Press Contact: Frany. Joson Group: Divine Creative Studio (on behalf of Daily Malong)Email: frany@divinecreativestudio.com Press Release Service by Newswire.com Original Source: Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#039;s New York Fashion Week\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/cdn.newswire.com\/files\/x\/c8\/b9\/c6b8ddae7834de2f39dc4db0c68c.jpg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/#blogposting\",\"name\":\"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year\\u2019s New York Fashion Week - Beauty Ring Magazine\",\"headline\":\"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#8217;s  New York Fashion Week\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/cdn.newswire.com\\\/files\\\/x\\\/c8\\\/b9\\\/c6b8ddae7834de2f39dc4db0c68c.jpg\",\"caption\":\"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#8217;s  New York Fashion Week\"},\"datePublished\":\"2022-08-17T09:00:08-04:00\",\"dateModified\":\"2022-08-17T09:00:08-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/#webpage\"},\"articleSection\":\"Fashion\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\",\"position\":2,\"name\":\"Fashion\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/#listItem\",\"position\":3,\"name\":\"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year's  New York Fashion Week\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/\",\"name\":\"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year\\u2019s New York Fashion Week - Beauty Ring Magazine\",\"description\":\"Daily Malong's New Collection Featured at this Year's SS22 NYFW Editorial Image by Lareni Terukina and Natalia Roxas NEW YORK - August 17, 2022 - (Newswire.com) Daily Malong brings a royalty inspired collection for its second year at New York Fashion Week. Keeping their momentum from last year's debut in New York Fashion Week, Daily Malong once again champions Filipino Indigenous weaving through intentional pieces that will set the future of Pilipinx fashion in the diaspora. With the overarching theme of \\\"Royalty is Indigenous,\\\" the collection and its theme embody the soul of traditional weaving and designs that are rooted in the pre-colonial era of the Philippines. The pre-colonial Philippines is considered the golden age of ingenuity. The new collection flaunts intricate artisan hand-woven pieces, which were adorned by pre-colonial tribal leaders, master artists, shamans and other important roles in communities called barangay or balangay. The vibrant prints and designs represent strength, solidarity, and tradition that embody the true regal spirit of the culture. Daily Malong is pivoting the conversation around indigeneity into the present and future by showcasing pieces that show the true essence of less tapped Filipino culture that is reminiscent of artistry beyond the more common Manila-centric and post colonial narrative. Expect to see empowered silhouettes and strobes of colors as the handwoven fabrics meld into modern ensembles. Creative Director (Lydia Querian) started Daily Malong's journey due to a growing interest of the Pilipinx community in indigenous culture and heritage. Lydia saw the opportunity between the diaspora's needs for cultural identity and the indigenous Filipinos' need to keep the living traditions. Daily Malong provides the North American market with a supply of fashionable clothing pieces that use artisan textiles and materials. The pieces can be casual and formal wear, which easily fall under the categories of high fashion, sustainable, and slow fashion. As a social enterprise, Daily Malong takes pride in providing livelihood to indigenous communities in the Philippines through an ethical supply chain, bridging the gap between both spectrums of the diaspora and the homeland. \\\"Bringing indigenous weaving practices to the future perpetuates time-tested traditions, helping the present and protecting the future,\\\" said Querian. \\\"Each indigenous textile worn today helps wearers and weavers navigate societal atrocities, prevent climate change, and restore a more sustainable environment.\\\" The show is ready to set another groundbreaking fashion display at the Rooftop of The Edison at Time Square on September 10, 2022, at 5:00 PM EST in partnership with hiTechMODA. hiTechMODA is a brand that promotes fashion brands focused on environmental causes, sustainability, and inclusivity, which is in line with Daily Malong's values. For more information on Daily Malong, visit their website at www.dailymalong.com and their social media pages @DailyMalong *** About Daily Malong Daily Malong strives to empower Indigenous Filipino artisans to continue their living traditions by extending appreciation in the diaspora. Daily Malong is an ecommerce store promoting the application of indigenous handwoven textiles on modern wearables offering handwoven products sourced from different indigenous communities in the Philippines through different apparels, accessories and home goods. The store is proud of its sustainable operations by working directly with communities. About the Designer: Lydia Querian is a multi-faceted artist. A fashion designer, dance and music practitioner who left her corporate career to pursue deeper cultural work and entrepreneurship. Born and raised in the Philippines she lived in San Francisco for 10 years and now based in Hawaii. She's done several performances, having toured nationally and internationally with Dancing Earth, KulArts, Parangal Dance Company and Fusion Dance Project. Querian was a featured artist at the Smithsonian Folklife Festival in 2017 and the Merrie Monarch Festival in 2016. Lydia completed Fashion Design and Fashion business certification from Parsons New School and as her work evolves, she frequently immerses with indigenous communities in both Southern and Northern Philippines. Alongside her passion for fashion, she co-founded several organizations, chaired several others, and produced several events that act as pillars in the Filipino community. She is also the executive producer of Gongster's Paradise, the only Kulintang Festival in North America, which has been long standing since 2017. Her work was recently featured at SS21 New York Fashion Week. Daily Malong and all her other work is on a mission to help empower Indigenous Filipino artists to continue their living traditions by extending appreciation in the diaspora. She believes that bringing indigenous practices to the future perpetuates time-tested traditions, helping the present and protecting the future. Each indigenous textile, music and movement executed today helps navigate societal atrocities, prevent climate change, and restore a more sustainable environment. Press Contact: Frany. Joson Group: Divine Creative Studio (on behalf of Daily Malong)Email: frany@divinecreativestudio.com Press Release Service by Newswire.com Original Source: Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year's New York Fashion Week\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/cdn.newswire.com\\\/files\\\/x\\\/c8\\\/b9\\\/c6b8ddae7834de2f39dc4db0c68c.jpg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/#mainImage\",\"caption\":\"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#8217;s  New York Fashion Week\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\\\/#mainImage\"},\"datePublished\":\"2022-08-17T09:00:08-04:00\",\"dateModified\":\"2022-08-17T09:00:08-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year’s New York Fashion Week - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year’s New York Fashion Week - Beauty Ring Magazine","description":"Daily Malong's New Collection Featured at this Year's SS22 NYFW Editorial Image by Lareni Terukina and Natalia Roxas NEW YORK - August 17, 2022 - (Newswire.com) Daily Malong brings a royalty inspired collection for its second year at New York Fashion Week. Keeping their momentum from last year's debut in New York Fashion Week, Daily Malong once again champions Filipino Indigenous weaving through intentional pieces that will set the future of Pilipinx fashion in the diaspora. With the overarching theme of \"Royalty is Indigenous,\" the collection and its theme embody the soul of traditional weaving and designs that are rooted in the pre-colonial era of the Philippines. The pre-colonial Philippines is considered the golden age of ingenuity. The new collection flaunts intricate artisan hand-woven pieces, which were adorned by pre-colonial tribal leaders, master artists, shamans and other important roles in communities called barangay or balangay. The vibrant prints and designs represent strength, solidarity, and tradition that embody the true regal spirit of the culture. Daily Malong is pivoting the conversation around indigeneity into the present and future by showcasing pieces that show the true essence of less tapped Filipino culture that is reminiscent of artistry beyond the more common Manila-centric and post colonial narrative. Expect to see empowered silhouettes and strobes of colors as the handwoven fabrics meld into modern ensembles. Creative Director (Lydia Querian) started Daily Malong's journey due to a growing interest of the Pilipinx community in indigenous culture and heritage. Lydia saw the opportunity between the diaspora's needs for cultural identity and the indigenous Filipinos' need to keep the living traditions. Daily Malong provides the North American market with a supply of fashionable clothing pieces that use artisan textiles and materials. The pieces can be casual and formal wear, which easily fall under the categories of high fashion, sustainable, and slow fashion. As a social enterprise, Daily Malong takes pride in providing livelihood to indigenous communities in the Philippines through an ethical supply chain, bridging the gap between both spectrums of the diaspora and the homeland. \"Bringing indigenous weaving practices to the future perpetuates time-tested traditions, helping the present and protecting the future,\" said Querian. \"Each indigenous textile worn today helps wearers and weavers navigate societal atrocities, prevent climate change, and restore a more sustainable environment.\" The show is ready to set another groundbreaking fashion display at the Rooftop of The Edison at Time Square on September 10, 2022, at 5:00 PM EST in partnership with hiTechMODA. hiTechMODA is a brand that promotes fashion brands focused on environmental causes, sustainability, and inclusivity, which is in line with Daily Malong's values. For more information on Daily Malong, visit their website at www.dailymalong.com and their social media pages @DailyMalong *** About Daily Malong Daily Malong strives to empower Indigenous Filipino artisans to continue their living traditions by extending appreciation in the diaspora. Daily Malong is an ecommerce store promoting the application of indigenous handwoven textiles on modern wearables offering handwoven products sourced from different indigenous communities in the Philippines through different apparels, accessories and home goods. The store is proud of its sustainable operations by working directly with communities. About the Designer: Lydia Querian is a multi-faceted artist. A fashion designer, dance and music practitioner who left her corporate career to pursue deeper cultural work and entrepreneurship. Born and raised in the Philippines she lived in San Francisco for 10 years and now based in Hawaii. She's done several performances, having toured nationally and internationally with Dancing Earth, KulArts, Parangal Dance Company and Fusion Dance Project. Querian was a featured artist at the Smithsonian Folklife Festival in 2017 and the Merrie Monarch Festival in 2016. Lydia completed Fashion Design and Fashion business certification from Parsons New School and as her work evolves, she frequently immerses with indigenous communities in both Southern and Northern Philippines. Alongside her passion for fashion, she co-founded several organizations, chaired several others, and produced several events that act as pillars in the Filipino community. She is also the executive producer of Gongster's Paradise, the only Kulintang Festival in North America, which has been long standing since 2017. Her work was recently featured at SS21 New York Fashion Week. Daily Malong and all her other work is on a mission to help empower Indigenous Filipino artists to continue their living traditions by extending appreciation in the diaspora. She believes that bringing indigenous practices to the future perpetuates time-tested traditions, helping the present and protecting the future. Each indigenous textile, music and movement executed today helps navigate societal atrocities, prevent climate change, and restore a more sustainable environment. Press Contact: Frany. Joson Group: Divine Creative Studio (on behalf of Daily Malong)Email: frany@divinecreativestudio.com Press Release Service by Newswire.com Original Source: Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year's New York Fashion Week","canonical_url":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year’s New York Fashion Week - Beauty Ring Magazine","og:description":"Daily Malong's New Collection Featured at this Year's SS22 NYFW Editorial Image by Lareni Terukina and Natalia Roxas NEW YORK - August 17, 2022 - (Newswire.com) Daily Malong brings a royalty inspired collection for its second year at New York Fashion Week. Keeping their momentum from last year's debut in New York Fashion Week, Daily Malong once again champions Filipino Indigenous weaving through intentional pieces that will set the future of Pilipinx fashion in the diaspora. With the overarching theme of &quot;Royalty is Indigenous,&quot; the collection and its theme embody the soul of traditional weaving and designs that are rooted in the pre-colonial era of the Philippines. The pre-colonial Philippines is considered the golden age of ingenuity. The new collection flaunts intricate artisan hand-woven pieces, which were adorned by pre-colonial tribal leaders, master artists, shamans and other important roles in communities called barangay or balangay. The vibrant prints and designs represent strength, solidarity, and tradition that embody the true regal spirit of the culture. Daily Malong is pivoting the conversation around indigeneity into the present and future by showcasing pieces that show the true essence of less tapped Filipino culture that is reminiscent of artistry beyond the more common Manila-centric and post colonial narrative. Expect to see empowered silhouettes and strobes of colors as the handwoven fabrics meld into modern ensembles. Creative Director (Lydia Querian) started Daily Malong's journey due to a growing interest of the Pilipinx community in indigenous culture and heritage. Lydia saw the opportunity between the diaspora's needs for cultural identity and the indigenous Filipinos' need to keep the living traditions. Daily Malong provides the North American market with a supply of fashionable clothing pieces that use artisan textiles and materials. The pieces can be casual and formal wear, which easily fall under the categories of high fashion, sustainable, and slow fashion. As a social enterprise, Daily Malong takes pride in providing livelihood to indigenous communities in the Philippines through an ethical supply chain, bridging the gap between both spectrums of the diaspora and the homeland. &quot;Bringing indigenous weaving practices to the future perpetuates time-tested traditions, helping the present and protecting the future,&quot; said Querian. &quot;Each indigenous textile worn today helps wearers and weavers navigate societal atrocities, prevent climate change, and restore a more sustainable environment.&quot; The show is ready to set another groundbreaking fashion display at the Rooftop of The Edison at Time Square on September 10, 2022, at 5:00 PM EST in partnership with hiTechMODA. hiTechMODA is a brand that promotes fashion brands focused on environmental causes, sustainability, and inclusivity, which is in line with Daily Malong's values. For more information on Daily Malong, visit their website at www.dailymalong.com and their social media pages @DailyMalong *** About Daily Malong Daily Malong strives to empower Indigenous Filipino artisans to continue their living traditions by extending appreciation in the diaspora. Daily Malong is an ecommerce store promoting the application of indigenous handwoven textiles on modern wearables offering handwoven products sourced from different indigenous communities in the Philippines through different apparels, accessories and home goods. The store is proud of its sustainable operations by working directly with communities. About the Designer: Lydia Querian is a multi-faceted artist. A fashion designer, dance and music practitioner who left her corporate career to pursue deeper cultural work and entrepreneurship. Born and raised in the Philippines she lived in San Francisco for 10 years and now based in Hawaii. She's done several performances, having toured nationally and internationally with Dancing Earth, KulArts, Parangal Dance Company and Fusion Dance Project. Querian was a featured artist at the Smithsonian Folklife Festival in 2017 and the Merrie Monarch Festival in 2016. Lydia completed Fashion Design and Fashion business certification from Parsons New School and as her work evolves, she frequently immerses with indigenous communities in both Southern and Northern Philippines. Alongside her passion for fashion, she co-founded several organizations, chaired several others, and produced several events that act as pillars in the Filipino community. She is also the executive producer of Gongster's Paradise, the only Kulintang Festival in North America, which has been long standing since 2017. Her work was recently featured at SS21 New York Fashion Week. Daily Malong and all her other work is on a mission to help empower Indigenous Filipino artists to continue their living traditions by extending appreciation in the diaspora. She believes that bringing indigenous practices to the future perpetuates time-tested traditions, helping the present and protecting the future. Each indigenous textile, music and movement executed today helps navigate societal atrocities, prevent climate change, and restore a more sustainable environment. Press Contact: Frany. Joson Group: Divine Creative Studio (on behalf of Daily Malong)Email: frany@divinecreativestudio.com Press Release Service by Newswire.com Original Source: Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year's New York Fashion Week","og:url":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/","og:image":"https:\/\/cdn.newswire.com\/files\/x\/c8\/b9\/c6b8ddae7834de2f39dc4db0c68c.jpg","og:image:secure_url":"https:\/\/cdn.newswire.com\/files\/x\/c8\/b9\/c6b8ddae7834de2f39dc4db0c68c.jpg","article:published_time":"2022-08-17T13:00:08+00:00","article:modified_time":"2022-08-17T13:00:08+00:00","twitter:card":"summary_large_image","twitter:title":"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year’s New York Fashion Week - Beauty Ring Magazine","twitter:description":"Daily Malong's New Collection Featured at this Year's SS22 NYFW Editorial Image by Lareni Terukina and Natalia Roxas NEW YORK - August 17, 2022 - (Newswire.com) Daily Malong brings a royalty inspired collection for its second year at New York Fashion Week. Keeping their momentum from last year's debut in New York Fashion Week, Daily Malong once again champions Filipino Indigenous weaving through intentional pieces that will set the future of Pilipinx fashion in the diaspora. With the overarching theme of &quot;Royalty is Indigenous,&quot; the collection and its theme embody the soul of traditional weaving and designs that are rooted in the pre-colonial era of the Philippines. The pre-colonial Philippines is considered the golden age of ingenuity. The new collection flaunts intricate artisan hand-woven pieces, which were adorned by pre-colonial tribal leaders, master artists, shamans and other important roles in communities called barangay or balangay. The vibrant prints and designs represent strength, solidarity, and tradition that embody the true regal spirit of the culture. Daily Malong is pivoting the conversation around indigeneity into the present and future by showcasing pieces that show the true essence of less tapped Filipino culture that is reminiscent of artistry beyond the more common Manila-centric and post colonial narrative. Expect to see empowered silhouettes and strobes of colors as the handwoven fabrics meld into modern ensembles. Creative Director (Lydia Querian) started Daily Malong's journey due to a growing interest of the Pilipinx community in indigenous culture and heritage. Lydia saw the opportunity between the diaspora's needs for cultural identity and the indigenous Filipinos' need to keep the living traditions. Daily Malong provides the North American market with a supply of fashionable clothing pieces that use artisan textiles and materials. The pieces can be casual and formal wear, which easily fall under the categories of high fashion, sustainable, and slow fashion. As a social enterprise, Daily Malong takes pride in providing livelihood to indigenous communities in the Philippines through an ethical supply chain, bridging the gap between both spectrums of the diaspora and the homeland. &quot;Bringing indigenous weaving practices to the future perpetuates time-tested traditions, helping the present and protecting the future,&quot; said Querian. &quot;Each indigenous textile worn today helps wearers and weavers navigate societal atrocities, prevent climate change, and restore a more sustainable environment.&quot; The show is ready to set another groundbreaking fashion display at the Rooftop of The Edison at Time Square on September 10, 2022, at 5:00 PM EST in partnership with hiTechMODA. hiTechMODA is a brand that promotes fashion brands focused on environmental causes, sustainability, and inclusivity, which is in line with Daily Malong's values. For more information on Daily Malong, visit their website at www.dailymalong.com and their social media pages @DailyMalong *** About Daily Malong Daily Malong strives to empower Indigenous Filipino artisans to continue their living traditions by extending appreciation in the diaspora. Daily Malong is an ecommerce store promoting the application of indigenous handwoven textiles on modern wearables offering handwoven products sourced from different indigenous communities in the Philippines through different apparels, accessories and home goods. The store is proud of its sustainable operations by working directly with communities. About the Designer: Lydia Querian is a multi-faceted artist. A fashion designer, dance and music practitioner who left her corporate career to pursue deeper cultural work and entrepreneurship. Born and raised in the Philippines she lived in San Francisco for 10 years and now based in Hawaii. She's done several performances, having toured nationally and internationally with Dancing Earth, KulArts, Parangal Dance Company and Fusion Dance Project. Querian was a featured artist at the Smithsonian Folklife Festival in 2017 and the Merrie Monarch Festival in 2016. Lydia completed Fashion Design and Fashion business certification from Parsons New School and as her work evolves, she frequently immerses with indigenous communities in both Southern and Northern Philippines. Alongside her passion for fashion, she co-founded several organizations, chaired several others, and produced several events that act as pillars in the Filipino community. She is also the executive producer of Gongster's Paradise, the only Kulintang Festival in North America, which has been long standing since 2017. Her work was recently featured at SS21 New York Fashion Week. Daily Malong and all her other work is on a mission to help empower Indigenous Filipino artists to continue their living traditions by extending appreciation in the diaspora. She believes that bringing indigenous practices to the future perpetuates time-tested traditions, helping the present and protecting the future. Each indigenous textile, music and movement executed today helps navigate societal atrocities, prevent climate change, and restore a more sustainable environment. Press Contact: Frany. Joson Group: Divine Creative Studio (on behalf of Daily Malong)Email: frany@divinecreativestudio.com Press Release Service by Newswire.com Original Source: Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year's New York Fashion Week","twitter:image":"https:\/\/cdn.newswire.com\/files\/x\/c8\/b9\/c6b8ddae7834de2f39dc4db0c68c.jpg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/#blogposting","name":"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year’s New York Fashion Week - Beauty Ring Magazine","headline":"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#8217;s  New York Fashion Week","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/cdn.newswire.com\/files\/x\/c8\/b9\/c6b8ddae7834de2f39dc4db0c68c.jpg","caption":"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#8217;s  New York Fashion Week"},"datePublished":"2022-08-17T09:00:08-04:00","dateModified":"2022-08-17T09:00:08-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/#webpage"},"articleSection":"Fashion"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/fashion\/#listItem","position":2,"name":"Fashion","item":"https:\/\/beautyring.info\/category\/fashion\/","nextItem":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/#listItem","position":3,"name":"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year's  New York Fashion Week","previousItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/#webpage","url":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/","name":"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year’s New York Fashion Week - Beauty Ring Magazine","description":"Daily Malong's New Collection Featured at this Year's SS22 NYFW Editorial Image by Lareni Terukina and Natalia Roxas NEW YORK - August 17, 2022 - (Newswire.com) Daily Malong brings a royalty inspired collection for its second year at New York Fashion Week. Keeping their momentum from last year's debut in New York Fashion Week, Daily Malong once again champions Filipino Indigenous weaving through intentional pieces that will set the future of Pilipinx fashion in the diaspora. With the overarching theme of \"Royalty is Indigenous,\" the collection and its theme embody the soul of traditional weaving and designs that are rooted in the pre-colonial era of the Philippines. The pre-colonial Philippines is considered the golden age of ingenuity. The new collection flaunts intricate artisan hand-woven pieces, which were adorned by pre-colonial tribal leaders, master artists, shamans and other important roles in communities called barangay or balangay. The vibrant prints and designs represent strength, solidarity, and tradition that embody the true regal spirit of the culture. Daily Malong is pivoting the conversation around indigeneity into the present and future by showcasing pieces that show the true essence of less tapped Filipino culture that is reminiscent of artistry beyond the more common Manila-centric and post colonial narrative. Expect to see empowered silhouettes and strobes of colors as the handwoven fabrics meld into modern ensembles. Creative Director (Lydia Querian) started Daily Malong's journey due to a growing interest of the Pilipinx community in indigenous culture and heritage. Lydia saw the opportunity between the diaspora's needs for cultural identity and the indigenous Filipinos' need to keep the living traditions. Daily Malong provides the North American market with a supply of fashionable clothing pieces that use artisan textiles and materials. The pieces can be casual and formal wear, which easily fall under the categories of high fashion, sustainable, and slow fashion. As a social enterprise, Daily Malong takes pride in providing livelihood to indigenous communities in the Philippines through an ethical supply chain, bridging the gap between both spectrums of the diaspora and the homeland. \"Bringing indigenous weaving practices to the future perpetuates time-tested traditions, helping the present and protecting the future,\" said Querian. \"Each indigenous textile worn today helps wearers and weavers navigate societal atrocities, prevent climate change, and restore a more sustainable environment.\" The show is ready to set another groundbreaking fashion display at the Rooftop of The Edison at Time Square on September 10, 2022, at 5:00 PM EST in partnership with hiTechMODA. hiTechMODA is a brand that promotes fashion brands focused on environmental causes, sustainability, and inclusivity, which is in line with Daily Malong's values. For more information on Daily Malong, visit their website at www.dailymalong.com and their social media pages @DailyMalong *** About Daily Malong Daily Malong strives to empower Indigenous Filipino artisans to continue their living traditions by extending appreciation in the diaspora. Daily Malong is an ecommerce store promoting the application of indigenous handwoven textiles on modern wearables offering handwoven products sourced from different indigenous communities in the Philippines through different apparels, accessories and home goods. The store is proud of its sustainable operations by working directly with communities. About the Designer: Lydia Querian is a multi-faceted artist. A fashion designer, dance and music practitioner who left her corporate career to pursue deeper cultural work and entrepreneurship. Born and raised in the Philippines she lived in San Francisco for 10 years and now based in Hawaii. She's done several performances, having toured nationally and internationally with Dancing Earth, KulArts, Parangal Dance Company and Fusion Dance Project. Querian was a featured artist at the Smithsonian Folklife Festival in 2017 and the Merrie Monarch Festival in 2016. Lydia completed Fashion Design and Fashion business certification from Parsons New School and as her work evolves, she frequently immerses with indigenous communities in both Southern and Northern Philippines. Alongside her passion for fashion, she co-founded several organizations, chaired several others, and produced several events that act as pillars in the Filipino community. She is also the executive producer of Gongster's Paradise, the only Kulintang Festival in North America, which has been long standing since 2017. Her work was recently featured at SS21 New York Fashion Week. Daily Malong and all her other work is on a mission to help empower Indigenous Filipino artists to continue their living traditions by extending appreciation in the diaspora. She believes that bringing indigenous practices to the future perpetuates time-tested traditions, helping the present and protecting the future. Each indigenous textile, music and movement executed today helps navigate societal atrocities, prevent climate change, and restore a more sustainable environment. Press Contact: Frany. Joson Group: Divine Creative Studio (on behalf of Daily Malong)Email: frany@divinecreativestudio.com Press Release Service by Newswire.com Original Source: Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year's New York Fashion Week","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/cdn.newswire.com\/files\/x\/c8\/b9\/c6b8ddae7834de2f39dc4db0c68c.jpg","@id":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/#mainImage","caption":"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#8217;s  New York Fashion Week"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/#mainImage"},"datePublished":"2022-08-17T09:00:08-04:00","dateModified":"2022-08-17T09:00:08-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"116940","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-04-11 20:36:32","updated":"2023-04-11 20:38:09"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/fashion\/\" title=\"Fashion\">Fashion<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tFilipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year’s  New York Fashion Week\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Fashion","link":"https:\/\/beautyring.info\/category\/fashion\/"},{"label":"Filipina Owned Brand Brings Indigenous Royalty Inspired Collection to This Year&#8217;s  New York Fashion Week","link":"https:\/\/beautyring.info\/fashion\/filipina-owned-brand-brings-indigenous-royalty-inspired-collection-to-this-years-new-york-fashion-week\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/116940"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=116940"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/116940\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/116941"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=116940"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=116940"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=116940"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}