{"id":117303,"date":"2022-05-09T20:00:00","date_gmt":"2022-05-10T00:00:00","guid":{"rendered":"https:\/\/24fashion.tv\/Article\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists-182590"},"modified":"2022-05-09T20:00:00","modified_gmt":"2022-05-10T00:00:00","slug":"foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists","status":"publish","type":"post","link":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/","title":{"rendered":"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists"},"content":{"rendered":" <img src='https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-7_1652156686.jpg' style=\"display:none\"> <br><p><strong>FOXYLAB NEW YORK RELEASING STREETWEAR COLLECTION WITH GLOBAL ATHLETES AND ARTISTS<\/strong><\/p><p>NEW YORK, NY -&nbsp;<a href=\"http:\/\/www.foxylabny.com\/\" rel=\"noopener noreferrer nofollow external sponsored\" style=\"color: purple;\" data-wpel-link=\"external\" target=\"_blank\">FOXYLAB NEW YORK<\/a>&nbsp;introduces DISCLOSING ATHLETES' CREATIVITY, a unisex streetwear c<span style=\"color: rgb(53, 53, 53);\">ollection inspired by the Tokyo Olympics. It is the first and one-of-a-kind capsule collection by FOXYLAB NEW YORK, created in collaboration with worlds top athletes and artists. FOXYLAB NEW YORK will donate 10% of all the profits from the sales of this Streetwear fashion collection to <\/span><a href=\"https:\/\/voices.org.ua\/en\/who-we-are\/\" rel=\"noopener noreferrer nofollow external sponsored\" style=\"color: purple;\" data-wpel-link=\"external\" target=\"_blank\">Voices of Children<\/a><span style=\"color: rgb(53, 53, 53);\">, a non-profit organization that helps Ukrainian children cope with the consequences of the war against Ukraine.<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-20_1652155881.jpg\" alt=\"24Fashion TV FoxyLab NY streetwear fashion 2022 USA 20 1652155881 jpg\"><\/p><p><span style=\"color: rgb(53, 53, 53);\">It all started in March 2021 with debates about the powerful impact of art on different industries, and it led the FOXYLAB NEW YORK founder <\/span><strong style=\"color: rgb(53, 53, 53);\">Oxana De Castro<\/strong><span style=\"color: rgb(53, 53, 53);\"> to a realization that sport is one of the most artistic, creative, and free-spirited phenomena that meets FOXYLAB NEW YORK adventurous identity. Then, there was the selection of a list of sports that reflect the ethics of FOXYLAB NEW YORK. The list initially included many disciplines, but then was narrowed down to six: athletics, handball, modern pentathlon, 3x3 basketball, artistic gymnastics, and beach volleyball. These sports share common values with FOXYLAB NEW YORK: audacity, heart, friskiness, courage, and ingenuity.<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-3_1652155915.jpg\" alt=\"24Fashion TV FoxyLab NY streetwear fashion 2022 USA 3 1652155915 jpg\"><\/p><p><span style=\"color: rgb(53, 53, 53);\">The next major step was to find those athletes who share one more fundamental thing with the brand: creativity. FOXYLAB NEW YORK interviewed around 100 athletes from all over the planet, before the six allies were selected, those who compete with daring expression and introduce innovativeness into their sports, like true artists. Given the challenging tournament schedule, preparation for the major competition of the four (this time five) years and depletion from traveling and rigid training in difficult post-covid time, FOXYLAB NEW YORK aimed to challenge the imagination of athletes and extract the pure ideas inspired by their lifestyle and professional career in sports. Each athlete had to go back in time and recall all the little moments where the connection with art played a definite role in forming their character and later helped build their athletic performance.&nbsp;<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-9_1652155941.jpg\" alt=\"24Fashion TV FoxyLab NY streetwear fashion 2022 USA 9 1652155941 jpg\"><\/p><p><span style=\"color: rgb(53, 53, 53);\">As the dots between art and sport were connected, each athlete was assigned an artist-partner to embody their ideas within unique personal designs and bring them to life. To match each team of artist and athlete, a distinct personal style of each artist was carefully evaluated, and the points of intersection with the stories of each athlete were found. The goal was to establish chemistry and perfect mutual understanding between the two creators. Supervised by the FOXYLAB NEW YORK team, the six pairs of athletes and artists from different countries worked together for three months to carve out their final designs. FOXYLAB NEW YORK placed the prints on six oversized signature t-shirts and marked each piece with a special tag with the names of both creators, their signatures, and a brief description of the art fashion collaboration.&nbsp;<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-8_1652155971.jpg\" alt=\"24Fashion TV FoxyLab NY streetwear fashion 2022 USA 8 1652155971 jpg\"><\/p><p><span style=\"color: rgb(53, 53, 53);\">DISCLOSING ATHLETES CREATIVITY capsule merged different nationalities, cultures, and visions, stimulated by the creative environment of FOXYLAB NEW YORK. When put together, sport and art prove that they are both moved by creativity of the performers, and their combined work leads to extraordinary results.&nbsp;<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-17_1652156472.jpg\" alt=\"24Fashion TV FoxyLab NY streetwear fashion 2022 USA 17 1652156472 jpg\"><\/p><p><span style=\"color: rgb(53, 53, 53);\">Introduced below are the pairs of athletes and artists that worked together. Every match is explained:<\/span><\/p><p><span style=\"color: rgb(53, 53, 53);\">1. Rebecca Silva (beach volleyball, Brazil) and Meir Srebiansky (France). <\/span><strong style=\"color: rgb(38, 38, 38);\"><em><u>Rebecca Silva<\/u><\/em><\/strong><span style=\"color: rgb(38, 38, 38);\">&nbsp;hails from the seaside city Fortaleza, Brazil. She is known as a hand of stone for her strong attack and was awarded the Best Pass of the Year at the Brazilian Championship. Her first appearance at the Olympic Games was in Tokyo.&nbsp;Rebecca is inspired by beach volleyball, the dream of going to the Olympics, her family, and the city of Fortaleza  the city in Brazil where she was born and now lives and where she developed as an athlete until she earned the trip to the Olympics. The strength of the northeastern region in Brazil is very significant in Rebeccas life. She is also a fan of strong, vibrant colors, which is why she worked in a pair with&nbsp;<\/span><strong style=\"color: rgb(38, 38, 38);\"><em><u>Meir Srebriansky<\/u><\/em><\/strong><span style=\"color: rgb(38, 38, 38);\">, a French-born abstract artist based in New York, whose signature artwork includes large pieces made of colorful asymmetric resin.<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-11_1652156506.jpg\" alt=\"24Fashion TV FoxyLab NY streetwear fashion 2022 USA 11 1652156506 jpg\"><\/p><p><span style=\"color: rgb(53, 53, 53);\">2.&nbsp;Ulyana Batashova (modern pentathlon, E. Europe) and Felix Nguyen (Germany). <\/span><strong style=\"color: rgb(53, 53, 53);\"><em><u>Ulyana Batashova<\/u><\/em><\/strong><span style=\"color: rgb(53, 53, 53);\">&nbsp;is an athlete who is broadly known not only for her multiple international titles in modern pentathlon, but also entrepreneurship. She launched&nbsp;<\/span><em style=\"color: rgb(53, 53, 53);\">Under By Me<\/em><span style=\"color: rgb(53, 53, 53);\">, a lifestyle brand that sells running uniforms, sweatsuits, sports diaries, and various sports accessories. In June 2021, Ulyana won a silver medal at the World Championship, and also managed to tailor uniforms for the tournament for two National Teams that also performed in&nbsp;<\/span><em style=\"color: rgb(53, 53, 53);\">Under By Me<\/em><span style=\"color: rgb(53, 53, 53);\">&nbsp;gear at the Tokyo Olympics, which is another huge success for Ulyanas brand. Ulyanas family comes from nobility and had their own coat of arms that contained a unicorn, an image, which ties to Ulyanas life closely  one of the disciplines in modern pentathlon is equestrian show jumping. Ulyana has a deep love for and feels horses. The unicorn on the family coat of arms represents her dream of going to the Olympics and becoming a top professional athlete, a dream that she brought to reality with her hard work. She worked in a pair with Vietnamese-German artist&nbsp;<\/span><strong style=\"color: rgb(53, 53, 53);\"><em><u>Felix Nguyen<\/u><\/em><\/strong><span style=\"color: rgb(53, 53, 53);\">, whose tender narrative style expressed Ulyanas compelling story in detail, highlighting the kind heart embedded under the strong spirit.<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-14_1652156522.jpg\" alt=\"24Fashion TV FoxyLab NY streetwear fashion 2022 USA 14 1652156522 jpg\"><\/p><p><span style=\"color: rgb(53, 53, 53);\">3.&nbsp;Dominique Jones (3x3 basketball, USA) and Edward Acosta (Puerto Rico). <\/span><strong style=\"color: rgb(53, 53, 53);\"><em><u>Dominique Jones<\/u><\/em><\/strong><span style=\"color: rgb(53, 53, 53);\">&nbsp;is from Harlem. As a member of the USA 3x3 Men's National Team, the 59 guard, finished 3-2 at the 2021 FIBA 3x3 Olympic Qualifying Tournament. In 2016, he took part in the FIBA 3x3 World Tour and led all scorers with 44 points in 5 games. He loves fashion, and he compares fashion with himself. His style is very recognizable, because he grew up and spent most of his life in Harlem, which imprinted its culture in him.&nbsp;Dominique believes that ones wardrobe must give its owner a feeling of confidence and underscore their authenticity. He worked with a FOXYLAB NEW YORK former contributor&nbsp;<\/span><strong style=\"color: rgb(53, 53, 53);\"><em><u>Edward Acosta<\/u><\/em><\/strong><span style=\"color: rgb(53, 53, 53);\">&nbsp;because they share the same values of Harlem NY streetwear and iconic culture. A big part of Edwards inspiration comes from the Harlem influences in fashion, music, and art, and it is shared by Dominique. Acostas avant-garde bold style became beneficial in portraying Dominiques appreciation of simple but important things in life, such as family, origins, and basketball.<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-15_1652156544.jpg\" alt=\"24Fashion TV FoxyLab NY streetwear fashion 2022 USA 15 1652156544 jpg\"><\/p><p><span style=\"color: rgb(53, 53, 53);\">4.&nbsp;Jestena Mattson (athletics, USA) and Moko (Croatia). <\/span><strong style=\"color: rgb(38, 38, 38);\"><em><u>Jestena Mattson<\/u><\/em><\/strong><span style=\"color: rgb(38, 38, 38);\">&nbsp;is a former Fresno State Bulldog, a two-time NCAA All-American, who represented team USA and placed 8<\/span><sup style=\"color: rgb(38, 38, 38);\">th<\/sup><span style=\"color: rgb(38, 38, 38);\">&nbsp;at the World University Games in Naples, Italy, became a four-time Mountain West Champion and 7th at 2020 USA Indoor Nationals in the Pentathlon. Jestena has always been into arts and fashion. She was her family artist for everything that needed to be created. In fourth grade, she designed and sewed her own dress to model at her local fair and won. She had a whole lookbook full of styles that she had drawn herself. In the future, Jestena plans to open her athletic wear brand to support young athletes. She was matched with Croatian artist&nbsp;<\/span><strong style=\"color: rgb(38, 38, 38);\"><em><u>Moko<\/u><\/em><\/strong><span style=\"color: rgb(38, 38, 38);\">, because of Mokos ability to capture the most powerful details. After getting to know Jestena closer, Moko discovered a hook to authenticity that ended up being a perfect representation of Jestenas character in sports and life.<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-10_1652156567.jpg\" alt=\"24Fashion TV FoxyLab NY streetwear fashion 2022 USA 10 1652156567 jpg\"><\/p><p><span style=\"color: rgb(53, 53, 53);\">5.&nbsp;Eythora Thorsdottir (artistic gymnastics, Netherlands) and Marcello Silvestre (Italy) At the 2016 Summer Olympic Games in Rio, then 17-year-old&nbsp;<\/span><strong style=\"color: rgb(53, 53, 53);\"><em><u>Eythora Thorsdottir&nbsp;<\/u><\/em><\/strong><span style=\"color: rgb(53, 53, 53);\">made history along with her team, placing 7<\/span><sup style=\"color: rgb(53, 53, 53);\">th<\/sup><span style=\"color: rgb(53, 53, 53);\">&nbsp; a humble achievement, which has never been accomplished by any other team of gymnasts in the Netherlands before. As a kid, Eythora studied performing arts and her parents took her to her favorite musicals, including Wicked, which always put her in a happy and joyful spirit and made her feel like moving. She always appreciated arts and fashion, her preferable colors are lilac, blue, and red. At the Tokyo Olympics, Eythora performed her new floor routine set to music she made herself by recreating a piece from a song as well as performing the lyrics. Eythoras art partner, an admirer of skillful Renaissance artists who captured moving objects in a block of hard marble,&nbsp;<\/span><strong style=\"color: rgb(53, 53, 53);\"><em><u>Marcello Silvestre<\/u><\/em><\/strong><span style=\"color: rgb(53, 53, 53);\">&nbsp;is a 3D artist, with his work he draws attention to the virtual world and space, controlled only by fantasies. They both appreciate the beauty of movement and are sure that movement is the most powerful expression of self.<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-13_1652156607.jpg\" alt=\"24Fashion TV FoxyLab NY streetwear fashion 2022 USA 13 1652156607 jpg\"><\/p><p><span style=\"color: rgb(53, 53, 53);\">6.&nbsp;Vladlena Bobrovnikova (handball, E. Europe) and Elena Smith (UK) <\/span><strong style=\"color: rgb(38, 38, 38);\"><em><u>Vladlena Bobrovnikova<\/u><\/em><\/strong><span style=\"color: rgb(38, 38, 38);\">&nbsp;led her team to a triumphal victory at the 2016 Olympics in Rio, and she was back at the Tokyo Games to receive a silver medal. In 2020 she entered the All-Star Team, as the best Left Back at the EHF European Handball Championship.&nbsp;For Vladlena, going to her first Olympics felt like making a statement  with her on the team, they received the first Olympic gold in over 30 years. However, her team made a big statement by winning in the toughest semifinal against Norway and crushing France in the final game. Vladlena thinks about the Olympics as a burst of emotions, colors, cultures, and a quintessential moment in the career of every athlete. For her, handball is true art that she devoted a lifetime to, and working with a British illustrator&nbsp;<\/span><strong style=\"color: rgb(53, 53, 53);\"><em><u>Elena Smith<\/u><\/em><\/strong><span style=\"color: rgb(38, 38, 38);\">, whose art contains a lot of powerful expressions and hidden interpretations of global issues, helped her to frame her position and inspiration coming from a game of handball in the most confident and assertive light.&nbsp;<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-12_1652156211.jpg\" alt=\"24Fashion TV FoxyLab NY streetwear fashion 2022 USA 12 1652156211 jpg\"><\/p><p><span style=\"color: rgb(53, 53, 53);\">FOXYLAB NEW YORK celebrated each contributor by sharing their personal stories in exclusive interviews in their websites <\/span><a href=\"https:\/\/foxylabny.com\/blog\/\" rel=\"noopener noreferrer nofollow external sponsored\" data-wpel-link=\"external\" target=\"_blank\">BLOGAZINE<\/a><span style=\"color: rgb(53, 53, 53);\"> showcasing the deep meaning behind every collaboration to fully disclose the athletes creativity.<\/span><\/p><p><a href=\"http:\/\/www.foxylabny.com\/\" rel=\"noopener noreferrer nofollow external sponsored\" data-wpel-link=\"external\" target=\"_blank\">www.foxylabny.com<\/a><\/p><p>FoxyLab NY Instagram:&nbsp;<a href=\"https:\/\/www.instagram.com\/foxylab.newyork\/?hl=en\" rel=\"noopener noreferrer nofollow external sponsored\" data-wpel-link=\"external\" target=\"_blank\">@foxylab.newyork<\/a>&nbsp;&nbsp;<\/p><p>Community Instagram&nbsp;<a href=\"https:\/\/www.instagram.com\/fxlb_mag\/?hl=en\" rel=\"noopener noreferrer nofollow external sponsored\" data-wpel-link=\"external\" target=\"_blank\">@fxlb_mag<\/a><\/p><p>FXLB Community:&nbsp;<a href=\"https:\/\/www.youtube.com\/channel\/UCVqLZbbWcanMp1zf39WKjaQ\" rel=\"noopener noreferrer nofollow external sponsored\" data-wpel-link=\"external\" target=\"_blank\">YouTube<\/a><\/p><p>Founder Instagram:&nbsp;<a href=\"https:\/\/www.instagram.com\/oxy_newyork\/?hl=en\" rel=\"noopener noreferrer nofollow external sponsored\" data-wpel-link=\"external\" target=\"_blank\">@oxy_newyork<\/a><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-4_1652156237.jpg\" alt=\"24Fashion TV FoxyLab NY streetwear fashion 2022 USA 4 1652156237 jpg\"><\/p><h4>Photo credits: Creative and executive producer: Vyach Klnov. Producer: Arseniy Savochkin. Photo and art director: Vasiliy Shvetsov. Light: Gena Belyh. Models: Brian Opoku-Adzhemang, Victoriya Buckih. Style: Daria Bowkun. Mua: Ksenia Andreeva. Location: Mayak<\/h4>","protected":false},"excerpt":{"rendered":"<p>FOXYLAB NEW YORK RELEASING STREETWEAR COLLECTION WITH GLOBAL ATHLETES AND ARTISTSNEW YORK, NY &#8211; FOXYLAB NEW&#8230;<\/p>\n","protected":false},"author":1,"featured_media":117304,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[548],"tags":[],"class_list":["post-117303","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fashion"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"FOXYLAB NEW YORK RELEASING STREETWEAR COLLECTION WITH GLOBAL ATHLETES AND ARTISTSNEW YORK, NY - FOXYLAB NEW...\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"FOXYLAB NEW YORK RELEASING STREETWEAR COLLECTION WITH GLOBAL ATHLETES AND ARTISTSNEW YORK, NY - FOXYLAB NEW...\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-7_1652156686.jpg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-7_1652156686.jpg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2022-05-10T00:00:00+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2022-05-10T00:00:00+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"FOXYLAB NEW YORK RELEASING STREETWEAR COLLECTION WITH GLOBAL ATHLETES AND ARTISTSNEW YORK, NY - FOXYLAB NEW...\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-7_1652156686.jpg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/#blogposting\",\"name\":\"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists - Beauty Ring Magazine\",\"headline\":\"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/s3.wasabisys.com\\\/24fashion\\\/article_photos\\\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-7_1652156686.jpg\",\"caption\":\"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists\"},\"datePublished\":\"2022-05-09T20:00:00-04:00\",\"dateModified\":\"2022-05-09T20:00:00-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/#webpage\"},\"articleSection\":\"Fashion\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\",\"position\":2,\"name\":\"Fashion\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/#listItem\",\"position\":3,\"name\":\"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/\",\"name\":\"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists - Beauty Ring Magazine\",\"description\":\"FOXYLAB NEW YORK RELEASING STREETWEAR COLLECTION WITH GLOBAL ATHLETES AND ARTISTSNEW YORK, NY - FOXYLAB NEW...\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/s3.wasabisys.com\\\/24fashion\\\/article_photos\\\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-7_1652156686.jpg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/#mainImage\",\"caption\":\"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\\\/#mainImage\"},\"datePublished\":\"2022-05-09T20:00:00-04:00\",\"dateModified\":\"2022-05-09T20:00:00-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists - Beauty Ring Magazine","description":"FOXYLAB NEW YORK RELEASING STREETWEAR COLLECTION WITH GLOBAL ATHLETES AND ARTISTSNEW YORK, NY - FOXYLAB NEW...","canonical_url":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists - Beauty Ring Magazine","og:description":"FOXYLAB NEW YORK RELEASING STREETWEAR COLLECTION WITH GLOBAL ATHLETES AND ARTISTSNEW YORK, NY - FOXYLAB NEW...","og:url":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/","og:image":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-7_1652156686.jpg","og:image:secure_url":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-7_1652156686.jpg","article:published_time":"2022-05-10T00:00:00+00:00","article:modified_time":"2022-05-10T00:00:00+00:00","twitter:card":"summary_large_image","twitter:title":"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists - Beauty Ring Magazine","twitter:description":"FOXYLAB NEW YORK RELEASING STREETWEAR COLLECTION WITH GLOBAL ATHLETES AND ARTISTSNEW YORK, NY - FOXYLAB NEW...","twitter:image":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-7_1652156686.jpg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/#blogposting","name":"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists - Beauty Ring Magazine","headline":"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-7_1652156686.jpg","caption":"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists"},"datePublished":"2022-05-09T20:00:00-04:00","dateModified":"2022-05-09T20:00:00-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/#webpage"},"articleSection":"Fashion"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/fashion\/#listItem","position":2,"name":"Fashion","item":"https:\/\/beautyring.info\/category\/fashion\/","nextItem":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/#listItem","position":3,"name":"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists","previousItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/#webpage","url":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/","name":"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists - Beauty Ring Magazine","description":"FOXYLAB NEW YORK RELEASING STREETWEAR COLLECTION WITH GLOBAL ATHLETES AND ARTISTSNEW YORK, NY - FOXYLAB NEW...","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_FoxyLab_NY_streetwear_fashion_2022_USA-7_1652156686.jpg","@id":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/#mainImage","caption":"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/#mainImage"},"datePublished":"2022-05-09T20:00:00-04:00","dateModified":"2022-05-09T20:00:00-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"117303","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-04-12 00:20:37","updated":"2023-04-12 02:34:37"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/fashion\/\" title=\"Fashion\">Fashion<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tFOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Fashion","link":"https:\/\/beautyring.info\/category\/fashion\/"},{"label":"FOXYLAB NEW YORK Releasing Streetwear Collection with Global Athletes and Artists","link":"https:\/\/beautyring.info\/fashion\/foxylab-new-york-releasing-streetwear-collection-with-global-athletes-and-artists\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/117303"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=117303"}],"version-history":[{"count":1,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/117303\/revisions"}],"predecessor-version":[{"id":125267,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/117303\/revisions\/125267"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/117304"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=117303"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=117303"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=117303"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}