{"id":117477,"date":"2021-11-28T20:00:00","date_gmt":"2021-11-29T00:00:00","guid":{"rendered":"https:\/\/24fashion.tv\/Article\/istituto-maragoni-during-miami-art-week-december-2-4-220955"},"modified":"2021-11-28T20:00:00","modified_gmt":"2021-11-29T00:00:00","slug":"istituto-marangoni-during-miami-art-week-december-2-4","status":"publish","type":"post","link":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/","title":{"rendered":"Istituto Marangoni during Miami Art Week December 2-4"},"content":{"rendered":" <img src='https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_Instituto_Marangoni_1638227079.jpg' style=\"display:none\"> <br><p><strong>ISTITUTO MARANGONI MIAMI TO HOST MI + MI = MILAN + MIAMI CONTEMPORARY ART EXHIBIT DURING MIAMI ART WEEK, DECEMBER 2-4&nbsp;<\/strong><\/p><p>Exhibit will showcase eight contemporary Italian artists plus one U.S.-based artist, to be held at the esteemed fashion and design school in Miami Design District. Premier Italian fashion and design school&nbsp;Istituto Marangoni Miami&nbsp;will host&nbsp;MI + MI = MILAN + MIAMI,&nbsp;a contemporary art exhibition, during Miami Art Week. Showcasing eight contemporary Italian artists, plus one U.S.-based artist, MI + MI = MILAN + MIAMI will be held at the fashion and design school in the Miami Design District, 3704 NE 2nd&nbsp;Ave., Miami, FL 33137.&nbsp;The public can view the exhibition free of charge, Monday through Friday, 11 a.m. to 6 p, m. Masks are required.<\/p><p>Curated by&nbsp;Aldo Premoli&nbsp;in collaboration with&nbsp;Istituto Marangoni Miami&nbsp;and&nbsp;Fabbrica Eos,&nbsp;the exhibition will feature artists from the&nbsp;Fabbrica Eos Gallery&nbsp;in Milan. One-third of the proceeds from sales of the art will benefit&nbsp;Istituto Marangoni Miamis&nbsp;scholarship program. Each year, Istituto Marangoni Miami awards scholarships to gifted students who wish to pursue a career in the fashion, design and art industries.<\/p><p>The purpose of the exhibit is to create a bridge between two distinct cultures: the spirit and artistry of&nbsp;Milan -- internationally recognized as the hub of Italian excellence in fashion, design, art and luxury  and the trend-driven, multi-cultural eclecticism of Miami. Milan and Miami are both incredibly dynamic cities that look to the future, and embrace the discovery of new visions, new perspectives and new talents, said&nbsp;Hakan&nbsp;Baykam, CEO and President of&nbsp;Istituto Marangoni Miami.<\/p><p>The contemporary artists exhibiting in&nbsp;MI + MI = MILAN + MIAMI&nbsp;are:&nbsp;Giampiero Bodino, Manuel Felisi, Fabio Giampietro, Sonja Quarone, Davide Bramante, Beatrice Gallori, Dario Goldaniga, Troilo&nbsp;and&nbsp;Tomer Peretz, all from&nbsp;Fabbrica Eos Gallery, an art gallery founded in Milan in the early 1990s by&nbsp;Giancarlo Pedrazzini. The exhibition will remain at&nbsp;Istituto Marangoni Miami&nbsp;through December 2021. The eight Italian artists chosen for&nbsp;MI + MI = MILAN + MIAMI&nbsp;will conduct talks and\/or workshops on art, fashion and design for the students of&nbsp;Istituto Marangoni Miami&nbsp;from December 2021 to March 2022. During these events, participating artist&nbsp;Peretz&nbsp;will create a pictorial portrait of the artist leading the talk or workshop.&nbsp;There will be a video wall of NFTs, comprised of both unrealized and famed NFTS by world-renowned artists&nbsp;Alessio De Vecchi, Fabio Giampietro&nbsp;and&nbsp;Manuel Felisi&nbsp; who are all associated with&nbsp;Fabbrica Eos Gallery.<\/p><p>Founded in 1935 by the Milanese tailor&nbsp;Giulio Marangoni, Istituto Marangoni, which has satellites in seven international locations and Miami, combines advanced teaching methods with the latest developments in fashion, design, and art to impart all the knowledge that students need to fully express their creative selves.<\/p><p>THE CURATOR:&nbsp;ALDO PRIMOLI&nbsp;<\/p><p>&nbsp;A journalist and writer,&nbsp;Aldo Primoli&nbsp;is a columnist for&nbsp;Linkiuesta&nbsp;and director of the Italian lifestyle website SudStyle.it. Born in Milan, Primoli lives in Catania, Milan, New York and Washington, and is Senior Curator of San Sebastiano Contemporary Art Gallery in Palazzolo Acreide. In Catania, Primoli founded the non-profit organization Mediterraneo Sicilia Europa, which helps fight poverty. In 2021, he founded La Cernobbina Art Studio.<\/p><p>THE ARTISTS<\/p><p>GIAMPIERO BODINO&nbsp;was born in Turin where he studied design and architecture. At the end of the 1970s, while still a young student, he began working with Giorgetto Giugiaro, where he learned the importance of designing three-dimensional and aerodynamic volumes. In 1981, he moved to Rome, where he worked closely with Gianni Bulgari, and started to design jewelry. When he met Franco Cologni, then at the top of Cartier and Richemont, he moved in 1989 to Milan, where he still lives today. There he collaborates with the most important watch, jewelry and accessories brands. Through his studio \"Style Life,\" Bodino always remains discreet, methodical, and behind the scenes, even when he signs pieces that quickly become icons. In 2002, he became the artistic director of the Richemont Group, dedicating himself exclusively to the maisons that are part of it, revisiting their stylistic heritage and revitalizing their DNA. In 2003, he became professor and supervisor of the Creative Academy, Richemont's school of design and applied arts. Giampiero Bodino, also an artist, began his pictorial journey in 1997 with the collective exhibition \"La ragione trasparente\" at the Galleria Fabbrica Eos in Milan.<\/p><p>After his last solo exhibition \"Cabinet priv\" in 2014, also at Fabbrica Eos, Bodino developed his first site-specific project in 2015, conceived for the historic Casa Museo Bagatti Valsecchi in Milan, and based on the genius loci and collections. The result was the exhibition \"Imago Non Fugit,\" curated by Francesco Gattuso (Fondation Beyeler) with an installation where Bodino's works are camouflaged with those of the Museum's permanent collection, in an unusual and mysterious path through the rooms. In September 2016, Bodino, in conjunction with the presentation of his jewels at the Muse Bourdelle in Paris, exhibited 10 new works made for the museum, in tune with the works of the sculptor Antoine Bourdelle, whose modus operandi Bodino revived with the languages most congenial to him (photography and painting on canvas), to lead to contemporary artistic languages that remain as relevant as a sculpture from the 1900s.<\/p><p>DAVIDE BRAMANTE&nbsp;was born in Syracuse, NY. At the end of 1999, he returned to live in Syracuse after 13 years spent in Turin, Rome, Bologna, Milan and New York. Bramante studied at the State Institute of Art in Siracusa; \"Albertina\" Academy of Fine Arts in Turin, graduating cum laude with a degree in Set Design in 1995; and \"Fidia\" Academy of Fine Arts of Cosenza, obtaining a degree with honors in Set Design in 2006. Bramantes scholarships\/Masters include: 1998 Franklin Furnace Foundation, New York (USA) project: \"The future of the present\"; and the 1999 Ministry of Foreign Affairs project \"Movin' up\", held in New York at the Franklin Furnace Foundation.<\/p><p>MANUEL FELISI&nbsp;was born in 1976 in Milan. He attended the&nbsp;Liceo Artistico&nbsp;art school and the Academy of Fine Arts of Brera. His artistic production moves between different areas, including painting, photography and collage, to create installations which translate and narrate the time. The&nbsp;leit motiv&nbsp;that runs through his production is the topic of time -- of being present in the here and now, as well as how time as it passes changes things, preserves them and makes us forget. He uses photography to express a time that immobilizes and measures places, objects, people and feelings; the instant of the photographic shot is no longer a mere mechanical operation but becomes the symbol that binds the different types of time described in the work. His works are made up of layers of different materials that always follow the same scientific order, like a ritual that -- from painting to printing -- is never confused with the mechanics and repetitiveness, as it is always the result of the involvement and the feeling that guide his artistic work.<\/p><p>BEATRICE GALLORI&nbsp;was born in Montevarchi in 1978. She graduated in 1996 from the Liceo Classico Cicognini in Prato. In 2001 she realized her passion for fashion and design by attending the Polimoda Institute in Florence, specializing in Fashion Design and Knitwear.&nbsp;The study of fashion also gave rise to the desire to experiment with painting: Galloris first creations were characterized by her innate ability to use the material giving the canvas thickness and life through instinct and emotional jets using various recycled materials. In 2010, she created handmade knitwear sketches with pictorial interventions for the brand Bettaknit, producing a collection. After these experiences came the desire to conceptualize her work, so she began to study the movement and recreate it on the canvas -- for the viewer tries to lock \"that movement\" made by nature unique and unrepeatable but stopped, before the fall, by the artist herself. The first sculptures that face the third dimension are born -- real flows of paint trapped and stopped in a temporal dimension, crystallized in an instant, after the fall, but before landing.<\/p><p>FABIO GIAMPIETRO&nbsp;was born in 1974 in Milan, where he still lives and works. He graduated in 1998 from the University Institute of Modern Languages IULM in Milan. A talented, self-taught painter with a unique technique of painting by subtracting the oil color from the canvas, Giampietro expresses a strong and intense figurative painting. In his most recent research, he combined painting with his passion for gaming, computer science and new technologies to create in 2015, together with expert VR programmer Alessio de Vecchi, the multimedia project \"Hyperplanes of Simultaneity\", which won the Gold Award at The Lumen Prize 2015 as the best digital artwork in the world. It is the first one of his projects to combine painting and new technologies. HPS allows users, through a VR visor, to enter inside Giampietro's paintings. He has numerous exhibitions in Italy and abroad, in Milan -- including the public exhibition at the museum of Palazzo Reale for the presentation of HPS, Bologna, Venice, Shanghai, Miami, Los Angeles, San Francisco, Berlin and Toronto. In addition to being one of the most promising young Italian artists, he was the first in Italy to discover and interact with the world of CryptoArt and NFT.&nbsp;<\/p><p>DARIO GOLDANIGA&nbsp;was born in Milan in 1960, where he still lives and works, alternating sculpture production with teaching plastic disciplines at the Fondazione Sacro Cuore Art School. He graduated from the New Academy of Fine Arts NABA. He was taught by teachers Kengiro Azuma, Carlo Mo and Gianni Colombo, with whom he worked as an assistant. He made his debut in 2005 with the exhibition \"Di forma e di luce\" (Of Shape and Light) at Galleria Fabbrica Eos in Milan, with a series of bronze sculptures in lost wax -- having the common theme of the balance of figures, geometry and natural forms. Since 2008, he has dedicated himself to a series of works using scraps of bronze castings, resulting in unpredictable and random shapes that create, when assembled, the recent series entitled \"Mappe terrestri\" (Earth Maps). In 2014, he created a series of engravings depicting imaginary \"Mappe stellari\" (Star Maps) on flat and spherical blackboard. These large portions of blackboard, as well as the scraps of bronze casting used in previous works, are recycled materials that the artist rescues from destruction, reintegrating them into the circuit of his own artistic production. Since 2016 he has been working on a series of works on canvas using a bronze welder: stencils of negatives where the positive image is formed by the process of combustion that releases a pattern of marks and burns on the canvas, created by the incandescent particles that detach from the metal.<\/p><p>SONJA QUARONE&nbsp;was born in Vigevano (Pavia) in 1972, where she still currently lives and works. She attended the Art School of Novara and the Academy of Fine Arts of Brera, where teachers such as the conceptual artist Vincenzo Ferrari and the visual poet Ugo Carrega greatly influenced her artistic and cultural background. She is an expert in the use of resin, for which she knows in depth the characteristics, the peculiarities, and the application potential. For many years it has been her material of choice for the creation of works that often dialogue with the millenary history of Western art. A renowned professional in the application and use of this contemporary material, Quarone began her own entrepreneurial journey dealing with resin finishes for architecture as well as large construction sites. She regularly collaborates with prestigious companies in the field of design and architecture, experiences that allow her to continuously experiment with materials and applications. She has recently conducted several workshops on techniques and application of new materials in art and architecture at the Academy of Brera and the Milan Polytechnic.<\/p><p>TROILO&nbsp;was born in Taranto in 1972, currently living and working between Milan and Palermo. He studied Architecture and Modern Literature at the University of Florence, then in Rome at the European Institute of Design. From 1997 to 2009, he worked first as Art Director and then as Creative Director in several international advertising agencies (Saatchi&amp;Saatchi, Arnold Worldwide). He has won all the most prestigious awards in the industry and, in 2007, he was awarded by ADCI as Best Italian Creative together with Alessandro Sabini. In 2009, he left advertising to follow his passion for painting. A self-taught artist, he started drawing with a pencil when he was 4 years old and has never stopped. In April 2005, in parallel with his career in advertising, he started his career as a professional artist and due to a distraction (he forgot to buy brushes) he started to paint with his fingers; the powerful figures born from his finger painting can be considered unique in the world. Troilo dips his fingers directly into cans of acrylic  in black and ivory -- and spreads the color, abandoning the \"tools of art.\" In 2011, he was selected for the 54th Venice Art Biennale. His works have been exhibited in Milan, Rome, Florence, Madrid, Paris, Singapore, San Francisco, New York, Istanbul, Tel Aviv and Los Angeles.<\/p><p>TOMER PERETZ&nbsp;was born in Israel in 1982. Peretz is a Los Angeles-based artist who creates paintings and mixed media works. He is a self-taught artist and often makes portraits of family, friends and celebrities in a highly detailed and surrealistic manner. However, his goal is to capture the essence of his subjects regardless of their social status. Born and raised in Jerusalem, he moved to America in his early twenties after serving four and a half years in the Israeli army. Peretz uses oil, acrylic, graphite and photography to convey his perspective and evoke emotions from viewers. He is represented internationally by Fabbrica Eos Gallery in Milan, Italy and Peimbert Gallery in Acapulco, Mexico. Peretz received the Arthur Szyk Prize for Disruptive Thinking, and his work has been featured at Art Basel Miami and the Los Angeles Show.<\/p><p>ABOUT ISTITUTO MARANGONI<\/p><p><span style=\"color: rgb(0, 0, 0);\">With a highly qualified academic team, combining European instructors and prominent local professionals,&nbsp;Istituto Marangoni&nbsp;offers a variety of fashion marketing courses and fashion graduate programs. The Miami School of Fashion offers students an unprecedented opportunity for innovation, inspiration, and creativity to build a promising future within the fashion and design industry.<\/span><\/p>","protected":false},"excerpt":{"rendered":"<p>ISTITUTO MARANGONI MIAMI TO HOST MI + MI = MILAN + MIAMI CONTEMPORARY ART EXHIBIT&#8230;<\/p>\n","protected":false},"author":1,"featured_media":117478,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[548],"tags":[],"class_list":["post-117477","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fashion"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"ISTITUTO MARANGONI MIAMI TO HOST MI + MI = MILAN + MIAMI CONTEMPORARY ART EXHIBIT...\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"Istituto Marangoni during Miami Art Week December 2-4 - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"ISTITUTO MARANGONI MIAMI TO HOST MI + MI = MILAN + MIAMI CONTEMPORARY ART EXHIBIT...\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_Instituto_Marangoni_1638227079.jpg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_Instituto_Marangoni_1638227079.jpg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2021-11-29T00:00:00+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2021-11-29T00:00:00+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"Istituto Marangoni during Miami Art Week December 2-4 - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"ISTITUTO MARANGONI MIAMI TO HOST MI + MI = MILAN + MIAMI CONTEMPORARY ART EXHIBIT...\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_Instituto_Marangoni_1638227079.jpg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/#blogposting\",\"name\":\"Istituto Marangoni during Miami Art Week December 2-4 - Beauty Ring Magazine\",\"headline\":\"Istituto Marangoni during Miami Art Week December 2-4\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/s3.wasabisys.com\\\/24fashion\\\/article_photos\\\/24Fashion_TV_Instituto_Marangoni_1638227079.jpg\",\"caption\":\"Istituto Marangoni during Miami Art Week December 2-4\"},\"datePublished\":\"2021-11-28T20:00:00-05:00\",\"dateModified\":\"2021-11-28T20:00:00-05:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/#webpage\"},\"articleSection\":\"Fashion\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\",\"position\":2,\"name\":\"Fashion\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/#listItem\",\"position\":3,\"name\":\"Istituto Marangoni during Miami Art Week December 2-4\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/\",\"name\":\"Istituto Marangoni during Miami Art Week December 2-4 - Beauty Ring Magazine\",\"description\":\"ISTITUTO MARANGONI MIAMI TO HOST MI + MI = MILAN + MIAMI CONTEMPORARY ART EXHIBIT...\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/s3.wasabisys.com\\\/24fashion\\\/article_photos\\\/24Fashion_TV_Instituto_Marangoni_1638227079.jpg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/#mainImage\",\"caption\":\"Istituto Marangoni during Miami Art Week December 2-4\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/istituto-marangoni-during-miami-art-week-december-2-4\\\/#mainImage\"},\"datePublished\":\"2021-11-28T20:00:00-05:00\",\"dateModified\":\"2021-11-28T20:00:00-05:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>Istituto Marangoni during Miami Art Week December 2-4 - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"Istituto Marangoni during Miami Art Week December 2-4 - Beauty Ring Magazine","description":"ISTITUTO MARANGONI MIAMI TO HOST MI + MI = MILAN + MIAMI CONTEMPORARY ART EXHIBIT...","canonical_url":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"Istituto Marangoni during Miami Art Week December 2-4 - Beauty Ring Magazine","og:description":"ISTITUTO MARANGONI MIAMI TO HOST MI + MI = MILAN + MIAMI CONTEMPORARY ART EXHIBIT...","og:url":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/","og:image":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_Instituto_Marangoni_1638227079.jpg","og:image:secure_url":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_Instituto_Marangoni_1638227079.jpg","article:published_time":"2021-11-29T00:00:00+00:00","article:modified_time":"2021-11-29T00:00:00+00:00","twitter:card":"summary_large_image","twitter:title":"Istituto Marangoni during Miami Art Week December 2-4 - Beauty Ring Magazine","twitter:description":"ISTITUTO MARANGONI MIAMI TO HOST MI + MI = MILAN + MIAMI CONTEMPORARY ART EXHIBIT...","twitter:image":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_Instituto_Marangoni_1638227079.jpg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/#blogposting","name":"Istituto Marangoni during Miami Art Week December 2-4 - Beauty Ring Magazine","headline":"Istituto Marangoni during Miami Art Week December 2-4","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_Instituto_Marangoni_1638227079.jpg","caption":"Istituto Marangoni during Miami Art Week December 2-4"},"datePublished":"2021-11-28T20:00:00-05:00","dateModified":"2021-11-28T20:00:00-05:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/#webpage"},"articleSection":"Fashion"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/fashion\/#listItem","position":2,"name":"Fashion","item":"https:\/\/beautyring.info\/category\/fashion\/","nextItem":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/#listItem","position":3,"name":"Istituto Marangoni during Miami Art Week December 2-4","previousItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/#webpage","url":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/","name":"Istituto Marangoni during Miami Art Week December 2-4 - Beauty Ring Magazine","description":"ISTITUTO MARANGONI MIAMI TO HOST MI + MI = MILAN + MIAMI CONTEMPORARY ART EXHIBIT...","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_Instituto_Marangoni_1638227079.jpg","@id":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/#mainImage","caption":"Istituto Marangoni during Miami Art Week December 2-4"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/#mainImage"},"datePublished":"2021-11-28T20:00:00-05:00","dateModified":"2021-11-28T20:00:00-05:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"117477","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-04-12 00:15:59","updated":"2023-04-12 02:22:15"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/fashion\/\" title=\"Fashion\">Fashion<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tIstituto Marangoni during Miami Art Week December 2-4\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Fashion","link":"https:\/\/beautyring.info\/category\/fashion\/"},{"label":"Istituto Marangoni during Miami Art Week December 2-4","link":"https:\/\/beautyring.info\/fashion\/istituto-marangoni-during-miami-art-week-december-2-4\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/117477"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=117477"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/117477\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/117478"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=117477"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=117477"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=117477"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}