{"id":117432,"date":"2022-01-02T20:00:00","date_gmt":"2022-01-03T00:00:00","guid":{"rendered":"https:\/\/24fashion.tv\/Article\/natalia-fedner-409106"},"modified":"2022-01-02T20:00:00","modified_gmt":"2022-01-03T00:00:00","slug":"natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time","status":"publish","type":"post","link":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/","title":{"rendered":"Natalia Fedner &#8211; Creating One-of-a-kind Wearable Art One Piece at a Time"},"content":{"rendered":" <img src='https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_NataliaFedner_SwimWeek_2021_Group__DSC5742_1641261357.jpeg' style=\"display:none\"> <br><p><a href=\"https:\/\/24fashion.tv\/\" rel=\"noopener noreferrer follow\" data-wpel-link=\"exclude\" target=\"_blank\">24Fashion TV&nbsp;<\/a>had a chance to sit down for an interview with a celebrity couture designer Natalia Fedner. Educated in both Paris and New York, Natalia Fedner is a couture designer who is based in New York and Los Angeles. She is known most for creating avant-garde jewelry for celebrities such as Beyonc, Jennifer Lopez, Cher, Janet Jackson, Charlize Theron, Alicia Keys, Lenny Kravitz, Cardi B, Rosario Dawson, Shakira, Kim Kardashian, Kendall Jenner, Kylie Jenner, Kourtney Kardashian, Kristen Stewart, Sharon Stone, Doja Cat, Chloe X Halle, Anitta, Tiffany Haddish, Teyana Taylor, Lili Reinhart, Jessie J, Kristin Chenoweth, Pamela Anderson, Bebe Rexha, Keke Palmer, Laverne Cox, Rose McGowan, Steve Aoki, and others. After graduating from Parsons School of Design, Natalia worked for Calvin Klein Collection, Donna Karan Collection, and Marc Jacobs. Natalia's designs have been shown on runways in Paris and NYC, and featured in the prestigious windows of Bergdorf Goodman and Saks Fifth Avenue in NYC. Magazines highlights include Vogue, Harpers Bazaar, Elle, The Cut, LOfficiel, Esquire, Maxim, Sports Illustrated, Complex, and Galore. <\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/976_24Fashion_TV_KylieJenner_1641265830.jpg\" alt=\"976 24Fashion TV KylieJenner 1641265830 jpg\"><\/p><h5 class=\"ql-align-center\">Kylie Jenner wearing Natalia Fedner <\/h5><p><strong style=\"color: rgb(0, 0, 0);\">24Fashion TV:&nbsp;<\/strong><strong style=\"color: rgb(50, 49, 48);\">When did you first realize you wanted to pursue a career as a fashion designer?<\/strong><\/p><p><em style=\"color: rgb(50, 49, 48);\">When I first learned the term fashion designer. I had been designing clothes from the first moments I learned to draw, at 2 years old, but I didnt realize this was a type of job until I was around 12 years old. I loved drawing Barbie-like women and coming up with different outfits for them. As I got older, I started hand sewing Barbie and Troll clothes. At around 12 years old, I started getting into fashion magazines like W and Numero- and I knew my future would be in high-end fashion.<\/em><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/976_24Fashion_TV_Rosalia_1641266264.jpg\" alt=\"976 24Fashion TV Rosalia 1641266264 jpg\"><\/p><h5 class=\"ql-align-center\">Pop-star Rosalia wearing Natalia Fedner <\/h5><p><strong style=\"color: rgb(50, 49, 48);\">What is your favorite part about being a designer?<\/strong><\/p><p><em style=\"color: rgb(50, 49, 48);\">I love the creativity involved. Being a fashion designer is all about solving problems in the most beautiful and inventive way possible. But no matter how creative you get, you always have to solve the problem - and thats a fun challenge. During the problem-solving process, of course mistakes occur. Ive learned to enjoy my mistakes. Mistakes are an amazing opportunity to go in a new direction or come up with an unexpected solution  even if its not the one you originally intended. Some of my favorite designs started out as mistakes.<\/em><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/976_24Fashion_TV_CoreyMyers_NataliaFedner_IMG_5058_1641267223.jpeg\" alt=\"976 24Fashion TV CoreyMyers NataliaFedner IMG 5058 1641267223 jpeg\"><\/p><h5 class=\"ql-align-center\">Natalia Fedner backstage - photo credit Corey Myers<\/h5><p><strong style=\"color: rgb(50, 49, 48);\">Where do you usually find creative inspiration for your new collection?<\/strong><\/p><p><em style=\"color: rgb(50, 49, 48);\">Like many designers, I used to find a lot of inspiration in nature, but the older I get, the more I am inspired by innovating upon my own past work. How can I take my existing designs to the next level? How can I introduce a different level of function? How can I collaborate with another artists skill sets to elevate my collection? How can I incorporate new technology into existing silhouettes? So its a lot of creative problem-solving. I still am very much inspired by nature- but I find the inspiration to be less direct. I have all sorts of ideas I hope to get to  but there are always more ideas than hours in the day.<\/em><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/976_24Fashion_TV_Natalia-Fedner_Miami-swim-week-24FashionTV-Natalie-Svors-art-hearts-fashion-24fashion-tv-6_1641266323.jpg\" alt=\"976 24Fashion TV Natalia Fedner Miami swim week 24FashionTV Natalie Svors art hearts fashion 24fashion tv 6 1641266323 jpg\"><\/p><h5 class=\"ql-align-center\">Natalia Fedner collection shown at Miami Swim Week 2021<\/h5><p><strong style=\"color: rgb(50, 49, 48);\">How did you come up with an idea for metal textile?<\/strong><\/p><p><em style=\"color: rgb(50, 49, 48);\">I didnt learn to machine sew till I went to Parsons School of Design. As a child and teenager, I had become pretty good at jewelry making  and certainly understood the basics better than clothing construction. When I studied abroad at Parsons Paris my junior year, I took a textile design class that opened my mind to the different ways I could control a garment from the very beginning  by making the actual fabric from which it was made. I started playing around with unconventional materials  challenging myself to create beautiful end-results that started out with unconventional supplies. Somewhere along the way, I married my love of jewelry making with my love of making garments. Many, many, MANY, trials and errors later I was able to come up with my patented 6-way stretch metal textile.<\/em><\/p><p><strong style=\"color: rgb(50, 49, 48);\">What is fashion to you?<\/strong><\/p><p><em style=\"color: rgb(50, 49, 48);\">I think its easier to say what fashion is not. For me, clothing is what I wear every day. Clothing is utilitarian  its my t-shirts and jeans and socks. I see a significant difference between clothing and fashion. With fashion, I can experiment more and take it to more extreme places. Whereas with clothing, its really more about what I need at that exact moment to function in the most fluid way possible. Dont get me wrong, clothing is challenging to design  designing clean, simple, super-functional garments is often more challenging than seemingly more complex garments. I love my clothing, but I live for the art of fashion. Fashion doesnt have to be comfortable, logical, or useful. Fashion is art you can wear. Clothing is a need  fashion is a want.<\/em><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/976_24Fashion_TV_Natalia-Fedner_Miami-swim-week-24FashionTV-Natalie-Svors-art-hearts-fashion-24fashion-tv-2_1641266388.jpg\" alt=\"976 24Fashion TV Natalia Fedner Miami swim week 24FashionTV Natalie Svors art hearts fashion 24fashion tv 2 1641266388 jpg\"><\/p><h5 class=\"ql-align-center\">Natalia Fedner collection shown at Miami Swim Week 2021<\/h5><p><strong style=\"color: rgb(50, 49, 48);\">How is working in fashion different today than from when you started out?<\/strong><\/p><p><em style=\"color: rgb(50, 49, 48);\">I think the fashion world is so much more collaborative and open to new ideas. Social media has made it possible for student designers to reach huge audiences in a very short amount of time. Its also made it possible for emerging designers to connect directly with major taste-makers in the celebrity and media world. Its pretty amazing. I always get excited when I see talented students elevated out of obscurity thanks to accounts like <\/em><a href=\"https:\/\/www.instagram.com\/upnextdesigner\" rel=\"noopener noreferrer nofollow external sponsored\" style=\"color: rgb(50, 49, 48);\" data-wpel-link=\"external\" target=\"_blank\"><em>@upnextdesigner<\/em><\/a><em style=\"color: rgb(50, 49, 48);\">. I think a lot of my fellow classmates at Parsons could have had really successful independent careers if social media existed in the way it currently does when we were students. Instead, a lot of them ended up taking fairly boring fashion desk jobs- and many left fashion altogether. And Im talking about incredibly talented designers who went from creating stunning evening-wear to designing boring knock-offs at fast-fashion and basics fashion companies  because they had to pay the bills. Its pretty heart-breaking to watch very talented people have to water down their talents in order to just make ends meet. Thanks to present day social media platforms like TikTok, YouTube, &amp; Instagram, fresh graduates have other options.<\/em><\/p><p><strong style=\"color: rgb(50, 49, 48);\">What role do you think social media plays in fashion today?<\/strong><\/p><p><em style=\"color: rgb(50, 49, 48);\">I think I just answered that question to a certain degree. The role it plays is HUGE.&nbsp; Besides the way it helps emerging and student designers, it is a vital part of every fashion companys marketing strategy and the way they connect with their audience. Social media has made direct-to-consumer online shopping a much more viable option for brands. In the past most brands could only do wholesale sales, but thanks to the viral nature of social media, they have a captive audience they can market to day or night  often without a huge advertising budget. Social media has completely changed fashion shows. Now its not about where or when your fashion show was, but rather how it looks and who posts about it on Instagram.<\/em><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/976_24Fashion_TV_Natalia-Fedner_Miami-swim-week-24FashionTV-Natalie-Svors-art-hearts-fashion-24fashion-tv-5_1641266470.jpg\" alt=\"976 24Fashion TV Natalia Fedner Miami swim week 24FashionTV Natalie Svors art hearts fashion 24fashion tv 5 1641266470 jpg\"><\/p><h5 class=\"ql-align-center\">Natalia Fedner collection shown at Miami Swim Week 2021<\/h5><p><strong style=\"color: rgb(50, 49, 48);\">How was your brand affected by the Covid-19 lockdown?<\/strong><\/p><p><em style=\"color: rgb(50, 49, 48);\">Long story short, it caused my business to come to a complete standstill. All of the ways in which we generated money stopped happening. I often dress performers, but concerts and music videos stopped being produced. I sell in stores in big cities, but stores in big cities closed down. I had to start considering other ways to generate income outside of my fashion business in case things got really bad. I moved back to Los Angeles in September 2020 and luckily things really started to pick back up  because celebrities in LA were still doing photo-shoots for product launches. I really havent had a day off since September 2020. Yes, because of all the work, but also because I stopped taking on interns and didnt even have assistants for a while. I joke, in a kind of sad but true way, that in 2020, I was my own intern, assistant, errand-runner, and janitor. Not only was I very COVID careful, but I also needed to be on a strict budget after all the losses earlier in the year. It was really tough and makes me extra grateful for the people who currently help me with my company.<\/em><\/p><p><strong style=\"color: rgb(50, 49, 48);\">What do you think about sustainable fashion? Should fashion be more sustainable?&nbsp;<\/strong><\/p><p><em style=\"color: rgb(50, 49, 48);\">100%! I am all about sustainable fashion. Its much easier for a small company like mine to be sustainable compared to a giant company. Being small means I can order just the supplies I need and can have more oversight over the supplies and how the garments are made. Big companies have way more logistics and moving parts  so I know its a true challenge for them. But I do think that a big company also has more financial resources and often more responsibility for the existing problems&nbsp;  so they need to do the work to ensure their supply chain is as sustainable as possible. Here are some of the ways I keep my small company sustainable: I use deadstock fabric whenever possible, only order the materials I know we will use, re-use existing supplies, rework existing garments from past collections to give them a new look, create all garments in house (which reduces on shipping supplies and emissions).<\/em><\/p><p><em style=\"color: rgb(50, 49, 48);\"><span class=\"ql-cursor\"><\/span><\/em><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/976_24Fashion_TV_MauriceThompson_DSC03212_NataliaFedner_1641266718.jpg\" alt=\"976 24Fashion TV MauriceThompson DSC03212 NataliaFedner 1641266718 jpg\"><\/p><h5 class=\"ql-align-center\">Natalia Fedner backstage wih models at Miami Swim Week 2021 - photo credit Maurice Thompson<\/h5><h5 class=\"ql-align-center\"><br><\/h5><p><strong style=\"color: rgb(50, 49, 48);\">How do you want women to feel when wearing your clothes?<\/strong><\/p><p><em style=\"color: rgb(50, 49, 48);\">I want them to feel daring, and excited, and original! I want them to feel like human works of art  like Joan of Arcs!<\/em><\/p><p><strong style=\"color: rgb(50, 49, 48);\">What comes next for Natalia Fedner?<\/strong><\/p><p><em style=\"color: rgb(50, 49, 48);\">Growth. I dont know exactly what that entails. I can guess, of course. But I see a lot of growth in the future. For the brand, I want to continue to expand the brand's international footprint  it would be so cool to be in more stores. I love the idea of continuing to experiment with celebrity fashion&nbsp; - really using that aspect of my brand as a playground for new and extra creative ideas. I also want to make our website easier to shop. Personally, I hope to find more balance. Ill be blunt  I work too much. I dont see my friends enough. I used to be proud of being a workaholic but now I see it for the true double-edged sword that it is. COVID -19 has put me in peak workaholism mode (because I avoided most social gatherings)  which has been great for my business, but exhausting for my mind and body - not to mention its effects on non-work relationships. I want to spend the next year figuring out how to work smart, not hard. I want to see friends and family more often. I want to take an actual vacation! Maybe even get a massage for the first time in 3 years? I am the absolute worst at self-care  Im going to work on that.<\/em><\/p><p>To learn more about Natalia Fedner, visit <a href=\"https:\/\/nataliafedner.com\/\" rel=\"noopener noreferrer nofollow external sponsored\" data-wpel-link=\"external\" target=\"_blank\">https:\/\/nataliafedner.com\/<\/a><\/p><p><br><\/p>","protected":false},"excerpt":{"rendered":"<p>24Fashion TV had a chance to sit down for an interview with a celebrity couture designer&#8230;<\/p>\n","protected":false},"author":1,"featured_media":117433,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[548],"tags":[],"class_list":["post-117432","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fashion"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"24Fashion TV had a chance to sit down for an interview with a celebrity couture designer...\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"Natalia Fedner – Creating One-of-a-kind Wearable Art One Piece at a Time - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"24Fashion TV had a chance to sit down for an interview with a celebrity couture designer...\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_NataliaFedner_SwimWeek_2021_Group__DSC5742_1641261357.jpeg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_NataliaFedner_SwimWeek_2021_Group__DSC5742_1641261357.jpeg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2022-01-03T00:00:00+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2022-01-03T00:00:00+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"Natalia Fedner – Creating One-of-a-kind Wearable Art One Piece at a Time - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"24Fashion TV had a chance to sit down for an interview with a celebrity couture designer...\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_NataliaFedner_SwimWeek_2021_Group__DSC5742_1641261357.jpeg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/#blogposting\",\"name\":\"Natalia Fedner \\u2013 Creating One-of-a-kind Wearable Art One Piece at a Time - Beauty Ring Magazine\",\"headline\":\"Natalia Fedner &#8211; Creating One-of-a-kind Wearable Art One Piece at a Time\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/s3.wasabisys.com\\\/24fashion\\\/article_photos\\\/24Fashion_TV_NataliaFedner_SwimWeek_2021_Group__DSC5742_1641261357.jpeg\",\"caption\":\"Natalia Fedner &#8211; Creating One-of-a-kind Wearable Art One Piece at a Time\"},\"datePublished\":\"2022-01-02T20:00:00-05:00\",\"dateModified\":\"2022-01-02T20:00:00-05:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/#webpage\"},\"articleSection\":\"Fashion\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\",\"position\":2,\"name\":\"Fashion\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/#listItem\",\"position\":3,\"name\":\"Natalia Fedner - Creating One-of-a-kind Wearable Art One Piece at a Time\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/\",\"name\":\"Natalia Fedner \\u2013 Creating One-of-a-kind Wearable Art One Piece at a Time - Beauty Ring Magazine\",\"description\":\"24Fashion TV had a chance to sit down for an interview with a celebrity couture designer...\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/s3.wasabisys.com\\\/24fashion\\\/article_photos\\\/24Fashion_TV_NataliaFedner_SwimWeek_2021_Group__DSC5742_1641261357.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/#mainImage\",\"caption\":\"Natalia Fedner &#8211; Creating One-of-a-kind Wearable Art One Piece at a Time\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\\\/#mainImage\"},\"datePublished\":\"2022-01-02T20:00:00-05:00\",\"dateModified\":\"2022-01-02T20:00:00-05:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>Natalia Fedner – Creating One-of-a-kind Wearable Art One Piece at a Time - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"Natalia Fedner – Creating One-of-a-kind Wearable Art One Piece at a Time - Beauty Ring Magazine","description":"24Fashion TV had a chance to sit down for an interview with a celebrity couture designer...","canonical_url":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"Natalia Fedner – Creating One-of-a-kind Wearable Art One Piece at a Time - Beauty Ring Magazine","og:description":"24Fashion TV had a chance to sit down for an interview with a celebrity couture designer...","og:url":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/","og:image":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_NataliaFedner_SwimWeek_2021_Group__DSC5742_1641261357.jpeg","og:image:secure_url":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_NataliaFedner_SwimWeek_2021_Group__DSC5742_1641261357.jpeg","article:published_time":"2022-01-03T00:00:00+00:00","article:modified_time":"2022-01-03T00:00:00+00:00","twitter:card":"summary_large_image","twitter:title":"Natalia Fedner – Creating One-of-a-kind Wearable Art One Piece at a Time - Beauty Ring Magazine","twitter:description":"24Fashion TV had a chance to sit down for an interview with a celebrity couture designer...","twitter:image":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_NataliaFedner_SwimWeek_2021_Group__DSC5742_1641261357.jpeg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/#blogposting","name":"Natalia Fedner – Creating One-of-a-kind Wearable Art One Piece at a Time - Beauty Ring Magazine","headline":"Natalia Fedner &#8211; Creating One-of-a-kind Wearable Art One Piece at a Time","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_NataliaFedner_SwimWeek_2021_Group__DSC5742_1641261357.jpeg","caption":"Natalia Fedner &#8211; Creating One-of-a-kind Wearable Art One Piece at a Time"},"datePublished":"2022-01-02T20:00:00-05:00","dateModified":"2022-01-02T20:00:00-05:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/#webpage"},"articleSection":"Fashion"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/fashion\/#listItem","position":2,"name":"Fashion","item":"https:\/\/beautyring.info\/category\/fashion\/","nextItem":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/#listItem","position":3,"name":"Natalia Fedner - Creating One-of-a-kind Wearable Art One Piece at a Time","previousItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/#webpage","url":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/","name":"Natalia Fedner – Creating One-of-a-kind Wearable Art One Piece at a Time - Beauty Ring Magazine","description":"24Fashion TV had a chance to sit down for an interview with a celebrity couture designer...","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/24Fashion_TV_NataliaFedner_SwimWeek_2021_Group__DSC5742_1641261357.jpeg","@id":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/#mainImage","caption":"Natalia Fedner &#8211; Creating One-of-a-kind Wearable Art One Piece at a Time"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/#mainImage"},"datePublished":"2022-01-02T20:00:00-05:00","dateModified":"2022-01-02T20:00:00-05:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"117432","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-04-12 00:16:00","updated":"2023-04-12 02:26:40"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/fashion\/\" title=\"Fashion\">Fashion<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tNatalia Fedner – Creating One-of-a-kind Wearable Art One Piece at a Time\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Fashion","link":"https:\/\/beautyring.info\/category\/fashion\/"},{"label":"Natalia Fedner &#8211; Creating One-of-a-kind Wearable Art One Piece at a Time","link":"https:\/\/beautyring.info\/fashion\/natalia-fedner-creating-one-of-a-kind-wearable-art-one-piece-at-a-time\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/117432"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=117432"}],"version-history":[{"count":1,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/117432\/revisions"}],"predecessor-version":[{"id":125294,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/117432\/revisions\/125294"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/117433"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=117432"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=117432"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=117432"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}