{"id":117882,"date":"2021-07-26T20:00:00","date_gmt":"2021-07-27T00:00:00","guid":{"rendered":"https:\/\/24fashion.tv\/Article\/highlights-feeric-fashion-week-202053"},"modified":"2021-07-26T20:00:00","modified_gmt":"2021-07-27T00:00:00","slug":"highlights-feeric-fashion-week","status":"publish","type":"post","link":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/","title":{"rendered":"HIGHLIGHTS FEERIC FASHION WEEK"},"content":{"rendered":" <img src='https:\/\/dim.mcusercontent.com\/cs\/931445a7131710c45b2091bbb\/images\/f63d57e1-e755-3ce9-926d-1cf04505b487.jpg' style=\"display:none\"> <br><p>Feeric Fashion Week. We were back!<\/p><p>Curtains down for the successful edition of Feeric Fashion Week, the driving force of the fashion industry in Eastern Europe, that always supported the artisanal works of young and established designers. Since 2008, it has been a meeting point to explore new trends and an important national and international showcase for creatives of the fashion world.<\/p><p>The 13th edition of Feeric Fashion Week turned, once again, Sibiu into the world capital of fashion and between July 21st and 25th, guests from all over the world came to Sibiu, to #feelfeeric and to discover new collections in unconventional spaces like the cinema of Promenada Mall Sibiu, an abandoned building, the forest or the traditional village of Apoldu de Jos.<\/p><p>Fashion Week opened with a welcome event hosted by Landiana, Vice President of Feeric<\/p><p>Fashion Week that included the opening of a photo exhibition entitled -Make simplicity great again-, the motto of the entire edition of Feeric Fashion Week, which focused on recycling, education about consuming and more responsibility in fashion industry.<\/p><p>The first day of individual fashion Shows began in the center of Apoldu de Jos, in a beautiful rural atmosphere, which impressed guests from abroad, from the United States, France, Italy, Monaco, Belgium, Pakistan, Spain and Egypt.<\/p><p>The guests were received in the purest Romanian style, with bread and salt, with villagers dressed in traditional costumes and with a Transylvanian musical show that opened the presentation of the Apoldist store collection.<\/p><p>Being the first sustainable store from Romania, Eastern Europe, Apoldist offers customers the opportunity to purchase clothes with the help of discounts, in exchange for used items that will be recycled. The presented collection consists of old pieces of clothing, reused, restyled, and thus re-highlighted.<\/p><p>Apoldist is a fair trade online curated fashion store that aims to make a change by highlighting ethics & aesthetics, and for the ones that need more, they are here to teach them how to choose better. Being the first sustainable shop of its kind, Apoldist offers its customers the possibility to buyback clothes with discounts, in exchange of their own used\/vintage items that will later be upcycled.For a unique & sustainable shopping experience, Apoldist offers a selection of curated designers, both emerging and established, young talents and students, some of whom work with sustainable fabrics but surely all of them are operating ethically. We will discover together the work of the selected designers but not before being encouraged by the team of Apoldist to invest in long lasting design, dress effortlessly, make conscious choices, be material wise, wear clothes that matter, and never refuse to reuse fashion.<\/p><p>From the center of the village, the guests set off for the forest near the commune, to present the Hooldra brand. Hooldra is an upcycled clothing brand that uses old items of clothing, which are passed through the hands of artists who bring them back to life before being put up for sale again.<\/p><p>And because Hooldra proposes a new ethical standard in fashion, sustainable and with considerable impact on the environment, the artistic moment was joined by a media campaign initiated by Feeric Fashion Week and Humane Society International in Romania, which aims to stop the use of furs and leather natural in fashion creations. Influencers and fashion journalists have joined the #furskin campaign, supporting the cessation of the practice of raising and sacrificing animals to turn them into clothing.<\/p><p>The first evening of the individual presentations ended in the beautiful setting of Cetii Street, between the Potters and Carpenters towers. Bennu presented its first collection that mixes the traditional with innovation, design and functionality, all in a sustainable direction. The bag collection is distinguished by the fact that it is completely ecological and explores new horizons by using vegan skin, obtained from fruit peel. Along with the bags created from vegan leather, the other part of the collection is made up of bags reused as part of a recycling program.<\/p><p>Bianca Popp opened the next day at Feeric Fashion Week with the presentation of the Inner Diva collection.<\/p><p>Inner Diva is a secret cruise collection by Bianca Popp. Dresses that we would wear on the red carpet of our dreams, in a holiday of lust, in a cruise as an object of desire until the end of the world. Life in black and white, where white is day and black is night. Between them, a few colored brushes meant to remind us of the real life we want to leave behind. The show took place at 1 pm, in the parking lot on the second floor of Promenada Sibiu.<\/p><p>Then, later, Ramelle presented a new collection in the Golden Square. Present for the third time, at Feeric Fashion Week, the RAMELLE brand presents the I AM UNIQUE collection, a collection full of color and harmony, with a minimalist design and architectural details transposed into feminine clothing creations.This collection is about the awakened woman, who is aware of her value, of her natural beauty and lives in a state of gratitude to everything around her. Through this collection Ramona Mihaela, the creator behind the brand, invites all women to see their uniqueness, the Divine gifts they are endowed with and which they offer to the world. The uniqueness of the woman represents her power, because she is irreplaceable.<\/p><p>Soon after, the American brand Bisoulovely showcased an impressive collection of jewelry in the Council Tower. To give magic and wonder a physical form, BISOULOVELY lovingly crafts jewelry inspired by the celestial, the magical, and the fantastic. BISOULOVELY finds sources of inspiration from both imagined worlds and natural scenic beauty to create dreamy jewelry akin to wearable magic. Each piece is made from high quality materials, frequently making use of sterling silver, 14 karat gold, and gemstones in our designs to add sparkle and whimsy to your jewelry collection. With a wide variety of whimsical treasures at BISOULOVELY, youre certain to find a little piece of magic perfect for you.<\/p><p>The last presentation of the day was given by Alist Boutique Designers and took place on the top floor of the building under construction in the Station Square. Alist Designers Boutique is the project initiated by Alist Magazine, which aims to support Romanian designers. With the support of Bucharest Mall Vitan, the project has promoted over 50 Romanian brands in the last two years, and today some of them are present here, with pieces from the latest collections. Respecting international trends, while maintaining a local specificity, the creations of Romanian designers are addressed to people who love fashion, art and who have the courage to reveal their spirit, supporting innovation and talent of local producers.<\/p><p>The fashion shows at Feeric Fashion Week ended on Saturday, with three other special events. At the Boromir Factory, New Talents by Kreep Agency and Alexandru Floarea presenter two unconventional collections.<\/p><p>KREEP Agency is an innovative and interdisciplinary platform focused on unconventional and aesthetic productions. Formed by visionary creatives worldwide, on July 22th at Feeric Fashion Week showcased for the third time a blended mix of young talents and aesthetic accessories designers.With a key interest in the sustainable aspect of the industry, the brands showcased are ethical, hand-made with an artisan touch. KREEP acts as a platform for showcasing new talents, showing a younger generation of visionaries who are pushing the boundaries. As always with impressive and pictorial showcases, this time, the New Talents by Kreep. collective show was curated and stylized by Sebastian Felix opescu, fashion editor at MODIC Magazine and 33 Magazine, a recent graduate of the Istituto Europeo de Design in Milan and showcased creations made by young designers: clothing by Yun Qu - Videmus Omnia -NYC, United States, Jennifer Moica - Jen MM - Germany, Bags by ZMAI by Nelizabeta - Germania, Aliel Official - Egypt, Scarves by Ralu FineArt - Belgium, Jewelry by Farah Wasi Ghatala, Pakistani-American - House of Wasee - based in California, United States.<\/p><p>KIKIMRA collection signed by Alexandru Floarea was a collection inspired by the desolate image of New York during the &#8217;70s and&#8217; 80s, reflected in the photographs of the German artist Miron Zownir. Years characterized by an overwhelming sexual and creative energy, the gloomy world of nightlife. The collection allows us to venture into a space beyond what the eye can see. Although poetic, it is at the same time sufficient of real to bother and to make us wonder and reflect. The collection is not part of the mainstream&#8221;, highlighting the unconventional, peripheral and extreme part of society, dominated by glamour entertainment and false feelings.<\/p><p>In the lobby of the VIP salon at CineGold - Promenada Sibiu, the lingerie brand SETHEI showcased a preview to its collection with elegant design lines and precious accents.<\/p><p>Mysticism and mythology are inexhaustible sources of inspiration and bring to the attention of the best characters.Theia is the titan born of earth and sky, she rulling gold, silver and diamonds. Selena is the daughter of them, the moon, and from the composition of the names of the two appears SETHEI - complex divinity, deity of the night and mystery, the mistress of fine and precious things. SETHEI is a lingerie brand that is shaped around elegant design lines, with fine lines and accents precious, the products being dedicated to a premium - luxury public. Superior quality materials, in some places with inserts special traditional motifs represent the particularity of the collections that follow a sustainable line of appreciation of local values and resources.<\/p><p>The last individual presentation took place in Huet Square, and was the last collection of the Blanche & Brownie brand. It was a playful collection, a &#8220;garden&#8221; collection that does not take into account age, inspired by all the reasons to be discovered during the lockdown. Strong colors and various pockets transposed into noisy materials.<\/p><p>The fashion shows at Feeric Fashion Week ended on Saturday night, in The Small Square - Piaa Mic, with the Feeric Gala, the grand final event of the fashion week in Sibiu. Five brands presented unique collections on the geometric catwalk located in the space in front of the House of Arts:<\/p><p>Lily of the Valley - For the Spring-Summer 2021 collection Lily of The Valley celebrated femininity inspired by nature&#8217;s beauty. Using refined natural materials and embroidery in organic shades mirroring nature, the collection suggests a feeling of sophistication and elegance. Each piece is adorned with a fine golden touch, like a delicate caress of the sun&#8217;s rays. Cocktail dresses make a game of opacity and transparency that give a note of brilliance to each design.<\/p><p>Valentina Zeed - Velmoda was born in 2016, when the young designer Valentina Zeed decided to enter this world the exuberance of fashion to materialize the uniqueness of its creativity. Valentina gave birth to a concept which brings to life the sensuality, emotion and power of being a woman, using materials such as silk natural, natural silk veil, but also precious stones sewn by hand in different shapes, joined harmoniously, together representing the unique Velmoda style. The creator addresses modern, romantic, sensual women, but also business women, independent, confident and confident, ready to conquer the world. The young designer wants that each to be unique and fabulous in its creations, these being distinguished by refinement, elegance and style.<\/p><p>Olga Mihoc - The garments in the MOtion collection combine contemporary styles specific to the active lifestyle of women with an emphasis on various elements such as pockets, collars, lapels, zippers, fringes, lines constructive-decorative, which outlines as a whole its artistic concept. The garments are produced in limited series, and some are unique, created from recycled materials. The collection finds its inspiration in the dynamics of today&#8217;s society in which women associate fashion with a tool of perfect expression of one&#8217;s identity and not just with a form expressed by the need to cover the body.<\/p><p>Bisoulovely - To give magic and wonder a physical form, BISOULOVELY lovingly crafts jewelry inspired by the celestial, the magical, and the fantastic. BISOULOVELY finds sources of inspiration from both imagined worlds and natural scenic beauty to create dreamy jewelry akin to wearable magic. Each piece is made from high quality materials, frequently making use of sterling silver, 14 karat gold, and gemstones in our designs to add sparkle and whimsy to your jewelry collection. With a wide variety of whimsical treasures at BISOULOVELY, you&#8217;re certain to find a little piece of magic perfect for you.<\/p><p>Inessa Creations Monaco - Award Winner and eco responsible Monegasque brand which is building a human connection based on the social codes by touching people from the aesthetic aspect in order to resonate inside them and build a community where everyone can share and show their true colours by being and feeling unique.<\/p><p>You are the creator of your own life. The new couture collection  Monte Carlo hills  SS21 is about craftsmanship, haute couture, high-end fabrics as well as Swarovski crystals presented in unique pieces. From Gala couture dresses to unique craftsmanship pieces and ready to wear luxury, this collection englobes the wide array of monegasque fashion while renewing it and creating new codes , new values and going further establishing a straight vision for the brand. - said Inessa, founder and designer Inessa Creations Monaco.<\/p><p>The Gala included the award ceremony as a result of the long term partnership between IED - European Design Institute and Feeric Fashion Week, started 4 years ago. IED offered a free scholarship in Barcelona to one or the most promising Romanian designers of this edition: Alexandru Florea.<\/p><p>We have made an incredible effort to organize Feeric Fashion Week this tangled year and we were glad to be the first major fashion event in the world to take place with spectators and international participation. Last year taught us many lessons, sustainability in fashion becoming the most important aspect we need to focus on, before anything else. Therefore, this edition we decided to use all our resources in terms of educating the audience on the aspects of ethics in fashion, recycling\/upcycling and responsibility of consuming. At the same time, I think we have prepared one of the most exciting and beautiful editions of recent years, witH some really surprising scenarios, shows and locations &#8220;, said Mitichi, president of Feeric Fashion Week.<\/p><p>Regarding the beauty direction, this year confirmed the tradition of teaming up once again with Cristian Buca key make-up artist and Geta Marin key hair-stylist.<\/p><p>Feeric Fashion Week was organized by Mitichi Foundation and was co-financed by The Sibiu Local Council through The City Hall of Sibiu and The County Council of Sibiu. This edition was supported by Ford, Label M, Paese and Visit.Sibiu.<\/p><p>Access to the area of fashion shows was free and allowed to everybody willing to attend, under the restrictions of the current situation caused by SARS-CoV-2 pandemic. The events within Feeric Fashion Week 2021 took place in compliance with the rules of physical distance, and the wearing of a protective mask was mandatory within the perimeter of the event.<\/p><p>Thank you for feeling Feeric with us! #FeelFeeric<\/p>","protected":false},"excerpt":{"rendered":"<p>Feeric Fashion Week. We were back!Curtains down for the successful edition of Feeric Fashion Week,&#8230;<\/p>\n","protected":false},"author":1,"featured_media":117883,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[548],"tags":[],"class_list":["post-117882","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fashion"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"Feeric Fashion Week. We were back!Curtains down for the successful edition of Feeric Fashion Week,...\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"HIGHLIGHTS FEERIC FASHION WEEK - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"Feeric Fashion Week. We were back!Curtains down for the successful edition of Feeric Fashion Week,...\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/dim.mcusercontent.com\/cs\/931445a7131710c45b2091bbb\/images\/f63d57e1-e755-3ce9-926d-1cf04505b487.jpg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/dim.mcusercontent.com\/cs\/931445a7131710c45b2091bbb\/images\/f63d57e1-e755-3ce9-926d-1cf04505b487.jpg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2021-07-27T00:00:00+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2021-07-27T00:00:00+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"HIGHLIGHTS FEERIC FASHION WEEK - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"Feeric Fashion Week. We were back!Curtains down for the successful edition of Feeric Fashion Week,...\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/dim.mcusercontent.com\/cs\/931445a7131710c45b2091bbb\/images\/f63d57e1-e755-3ce9-926d-1cf04505b487.jpg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/#blogposting\",\"name\":\"HIGHLIGHTS FEERIC FASHION WEEK - Beauty Ring Magazine\",\"headline\":\"HIGHLIGHTS FEERIC FASHION WEEK\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/dim.mcusercontent.com\\\/cs\\\/931445a7131710c45b2091bbb\\\/images\\\/f63d57e1-e755-3ce9-926d-1cf04505b487.jpg\",\"caption\":\"HIGHLIGHTS FEERIC FASHION WEEK\"},\"datePublished\":\"2021-07-26T20:00:00-04:00\",\"dateModified\":\"2021-07-26T20:00:00-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/#webpage\"},\"articleSection\":\"Fashion\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\",\"position\":2,\"name\":\"Fashion\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/#listItem\",\"position\":3,\"name\":\"HIGHLIGHTS FEERIC FASHION WEEK\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/\",\"name\":\"HIGHLIGHTS FEERIC FASHION WEEK - Beauty Ring Magazine\",\"description\":\"Feeric Fashion Week. We were back!Curtains down for the successful edition of Feeric Fashion Week,...\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/dim.mcusercontent.com\\\/cs\\\/931445a7131710c45b2091bbb\\\/images\\\/f63d57e1-e755-3ce9-926d-1cf04505b487.jpg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/#mainImage\",\"caption\":\"HIGHLIGHTS FEERIC FASHION WEEK\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/highlights-feeric-fashion-week\\\/#mainImage\"},\"datePublished\":\"2021-07-26T20:00:00-04:00\",\"dateModified\":\"2021-07-26T20:00:00-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>HIGHLIGHTS FEERIC FASHION WEEK - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"HIGHLIGHTS FEERIC FASHION WEEK - Beauty Ring Magazine","description":"Feeric Fashion Week. We were back!Curtains down for the successful edition of Feeric Fashion Week,...","canonical_url":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"HIGHLIGHTS FEERIC FASHION WEEK - Beauty Ring Magazine","og:description":"Feeric Fashion Week. We were back!Curtains down for the successful edition of Feeric Fashion Week,...","og:url":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/","og:image":"https:\/\/dim.mcusercontent.com\/cs\/931445a7131710c45b2091bbb\/images\/f63d57e1-e755-3ce9-926d-1cf04505b487.jpg","og:image:secure_url":"https:\/\/dim.mcusercontent.com\/cs\/931445a7131710c45b2091bbb\/images\/f63d57e1-e755-3ce9-926d-1cf04505b487.jpg","article:published_time":"2021-07-27T00:00:00+00:00","article:modified_time":"2021-07-27T00:00:00+00:00","twitter:card":"summary_large_image","twitter:title":"HIGHLIGHTS FEERIC FASHION WEEK - Beauty Ring Magazine","twitter:description":"Feeric Fashion Week. We were back!Curtains down for the successful edition of Feeric Fashion Week,...","twitter:image":"https:\/\/dim.mcusercontent.com\/cs\/931445a7131710c45b2091bbb\/images\/f63d57e1-e755-3ce9-926d-1cf04505b487.jpg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/#blogposting","name":"HIGHLIGHTS FEERIC FASHION WEEK - Beauty Ring Magazine","headline":"HIGHLIGHTS FEERIC FASHION WEEK","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/dim.mcusercontent.com\/cs\/931445a7131710c45b2091bbb\/images\/f63d57e1-e755-3ce9-926d-1cf04505b487.jpg","caption":"HIGHLIGHTS FEERIC FASHION WEEK"},"datePublished":"2021-07-26T20:00:00-04:00","dateModified":"2021-07-26T20:00:00-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/#webpage"},"articleSection":"Fashion"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/fashion\/#listItem","position":2,"name":"Fashion","item":"https:\/\/beautyring.info\/category\/fashion\/","nextItem":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/#listItem","position":3,"name":"HIGHLIGHTS FEERIC FASHION WEEK","previousItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/#webpage","url":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/","name":"HIGHLIGHTS FEERIC FASHION WEEK - Beauty Ring Magazine","description":"Feeric Fashion Week. We were back!Curtains down for the successful edition of Feeric Fashion Week,...","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/dim.mcusercontent.com\/cs\/931445a7131710c45b2091bbb\/images\/f63d57e1-e755-3ce9-926d-1cf04505b487.jpg","@id":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/#mainImage","caption":"HIGHLIGHTS FEERIC FASHION WEEK"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/#mainImage"},"datePublished":"2021-07-26T20:00:00-04:00","dateModified":"2021-07-26T20:00:00-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"117882","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-04-11 23:08:35","updated":"2023-04-11 23:31:09"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/fashion\/\" title=\"Fashion\">Fashion<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tHIGHLIGHTS FEERIC FASHION WEEK\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Fashion","link":"https:\/\/beautyring.info\/category\/fashion\/"},{"label":"HIGHLIGHTS FEERIC FASHION WEEK","link":"https:\/\/beautyring.info\/fashion\/highlights-feeric-fashion-week\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/117882"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=117882"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/117882\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/117883"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=117882"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=117882"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=117882"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}