{"id":117969,"date":"2021-07-05T20:00:00","date_gmt":"2021-07-06T00:00:00","guid":{"rendered":"https:\/\/24fashion.tv\/Article\/franck-sorbier-haute-couture-223550"},"modified":"2021-07-05T20:00:00","modified_gmt":"2021-07-06T00:00:00","slug":"franck-sorbier-haute-couture","status":"publish","type":"post","link":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/","title":{"rendered":"FRANCK SORBIER HAUTE COUTURE"},"content":{"rendered":" <img src='https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX-1_1625695205.jpg' style=\"display:none\"> <br><p class=\"ql-align-center\">FRANCK SORBIER HAUTE COUTURE<\/p><p class=\"ql-align-center\">Les Sorbier<\/p><p class=\"ql-align-center\">Pices uniques Haute Couture Hiver 2021-2022<\/p><p class=\"ql-align-center\">L Esprit des lieux<\/p><p class=\"ql-align-center\">CHAALIS<\/p><h6><em><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX-1_1625695332.jpg\" alt=\"592 24Fashion TV FRANCK SORBIER HAUTE COUTURE L ESPRIT DES LIEUX 1 1625695332 jpg\">Loeil de la Relique Sainte Zo<\/em><\/h6><h6><em> Laurent-Stphane Montfort 189.photography \/ Franck Sorbier - Extraits film  LEsprit des lieux -Chaalis <\/em><\/h6><p><em style=\"color: rgb(89, 89, 89);\">The Servant, the Ferryman and the Relic<\/em><\/p><p><span style=\"color: rgb(89, 89, 89);\">The title sounds like a philosophical fable, a dreamlike tale, a belief shared by believers from all walks of life. But he speaks, above all, despite his backward references, of an increasingly hot topicality on the subject of wealth and poverty. Some time ago, the magazine &nbsp;<\/span><em style=\"color: rgb(89, 89, 89);\">LHistoire&nbsp;<\/em><span style=\"color: rgb(89, 89, 89);\"> had the headline &nbsp;<\/span><em style=\"color: rgb(89, 89, 89);\">The Rich and the Poor, 1000 years of inequality&nbsp;<\/em><span style=\"color: rgb(89, 89, 89);\">. Far from me the idea of any morality or a trial of intent. I must admit that I had a lot of trouble choosing the direction of this collection. To be honest, I didnt want to choose and each character finally found its place.` <\/span><em style=\"color: rgb(89, 89, 89);\">The Servant, the Ferryman and the Relic. <\/em><span style=\"color: rgb(89, 89, 89);\">The Servant embodies a girl of the woods, glades and ponds. A peasant&nbsp;woman who evolves in a bucolic universe which translates my desire for stripping back. A pauperism inspired by a series of photographs by artist Jackie Nickerson who photographed farm workers in Zimbabwe in 1996, and who emphasized the unique and beautiful clothes that the workers themselves made up. A foolproof identity, individuality and modernity. The silhouettes appropriate the traditional influences of Europe but having washed them of any coloristic folklore. Francisco de Zubarn, a great Spanish Baroque painter and his compatriot, Jos Ortiz Echage, photographer, follower of pictorialism, also accompanied me in this quest for authenticity. <\/span>Wh<span style=\"color: rgb(89, 89, 89);\">ite, ecru, ivory, beige and greige make up the range of models. A skirted Romanian dress is the basis of the history of the Handmaids outfits. We then come to ennoble by layering capes, raincoats, vests, short jackets, shawls ...<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_1-FRANCK_SORBIER_AmauryVoslion-FranckSorbier_1625696837.jpg\" alt=\"592 24Fashion TV 1 FRANCK SORBIER AmauryVoslion FranckSorbier 1625696837 jpg\"><\/p><h6>AmauryVoslion. FranckSorbier<\/h6><p><span style=\"color: rgb(89, 89, 89);\">The materials are raw or rustic in appearance, a blend of linen and silk, silk and cotton, silk and viscose, plasticized organza, frayed jacquard, wick and thread wool, boiled wool, crochet and pleated velvet Mariano Fortuny y Madrazo style. The ferryman makes known and propagates a work, a doctrine, a knowledge. He is the intermediary between two cultures and two eras. The ferryman, so named, is also a two-sided mirror. You will discover him blond in a neoclassical white toga but also brown, in a fiery black jumper, draped in a cape floating like a standard. Jean-Jacques Rousseau, who has never left my thoughts, is once again present in Ermenonville, not far from Chaalis. He will live there for the last ten years of his life.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">Here, he is at the heart of his deep convictions, those related to nature. Among other things, he built the Temple of Modern Philosophy there, overlooking Lake Ermenonville. The places have evocative names, the <\/span><em style=\"color: rgb(89, 89, 89);\">writers trail<\/em><span style=\"color: rgb(89, 89, 89);\">, the <\/span><em style=\"color: rgb(89, 89, 89);\">witch stone<\/em><span style=\"color: rgb(89, 89, 89);\">, the <\/span><em style=\"color: rgb(89, 89, 89);\">sea of sand<\/em><span style=\"color: rgb(89, 89, 89);\">, the <\/span><em style=\"color: rgb(89, 89, 89);\">dreamers walk<\/em><span style=\"color: rgb(89, 89, 89);\">. Later, Etienne Pivert de Senancour and Grard de Nerval made this land,&nbsp;already steeped in spirituality, one of the cradles of French literary romanticism. The Domaine de Chaalis, in the heart of the Ermenonville forest, was the films natural setting.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">Nlie Jacquemart-Andr, last owner of the Royal Abbey of Chaalis and famous art collector, said &nbsp;<\/span>i<em style=\"color: rgb(89, 89, 89);\">t is one of the most admirable landscapes in France&nbsp;<\/em><\/p><p><span style=\"color: rgb(89, 89, 89);\">. This former Cistercian abbey, founded by King Louis VI at the beginning of the 12th century, has&nbsp;undergone many changes since its foundation, but the remains of its abbey church bear&nbsp;witness to its past grandeur. The Abbey of Saint Guillaume was, in the Middle Ages, a powerful economic&nbsp;and intellectual center, close to Paris. Many personalities and kings of France regularly attended the abbey to interact with the monks, like King Saint Louis.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">After experiencing a period of decline at the end of the Middle Ages, the estate rose from its ashes during the Renaissance. The frescoes of the Italian painter Primatice bear witness to this. Despite the ravages of time, the Domaine de Chaalis has remained a green&nbsp;setting containing many treasures. A place of inspiration which today is the property of the Institut de France.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">I had, for a long time, in archives, sublime images of Bavarian relics from the&nbsp;magazine F.M.R.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">A few months ago, in a bookstore, I saw, to my great happiness, a book called &nbsp;<\/span><em style=\"color: rgb(89, 89, 89);\">Catacombs Treasures&nbsp;<\/em><span style=\"color: rgb(89, 89, 89);\">. I find many photographs of these relics.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">But what is it exactly?<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_2-FRANCK_SORBIER-AmauryVoslion-FranckSorbier_copy_1625696947.jpg\" alt=\"592 24Fashion TV 2 FRANCK SORBIER AmauryVoslion FranckSorbier copy 1625696947 jpg\"><\/p><h6>AmauryVoslion. FranckSorbier<\/h6><p><span style=\"color: rgb(89, 89, 89);\">The author of the book relates that in the 1723s a complete skeleton labeled as that of Saint Albert arrived in a small church in Bavaria. This skeleton was beautifully adorned by a nun named Pontentia Hmmerl.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">Gold threads, precious stones, fine pearls have been embroidered or encrusted on the bones. The relics were also clothed in precious fabrics and displayed in display cases. I saw there a dream of eternity and as I longed, too, for opulence, we created&nbsp;our own relic and dressed it with coats in jacquards of floral spirit and vat paper, in mineral brocade, in Greek Orthodox damask, in baroque tones. Pieces embroidered in-between with gold and copper mechanical lace,&nbsp;water pearls, ruched edges and pale gold guipures. These relics were the object of devotion and wonder. They also had for&nbsp;mission to be the bridges between the wishes the wishes of the priors and the&nbsp;heavens. So, fable, tale, belief or simply allegory. This season is about, above all, a simple intention, that of questioning.<\/span><\/p><p><em style=\"color: rgb(89, 89, 89);\">Frank Sorbier<\/em><\/p><h6><em><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_W2122_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX_FranckSorbier9_1625695426.jpg\" alt=\"592 24Fashion TV FRANCK SORBIER W2122 HAUTE COUTURE L ESPRIT DES LIEUX FranckSorbier9 1625695426 jpg\">Elena Berbinau incarnant la Servante au sein de lAbbaye Royale de Chaalis<\/em><\/h6><h6><em> Laurent-Stphane Montfort 189.photography \/ Franck Sorbier - Extraits film  LEsprit des lieux -Chaalis <\/em><\/h6><p><em style=\"color: rgb(89, 89, 89);\">The Directors note<\/em><\/p><p><span style=\"color: rgb(89, 89, 89);\">The world of Franck Sorbier ...<\/span><\/p><p>Intense, multicolored, plural, deep and much more ...<\/p><p><span style=\"color: rgb(89, 89, 89);\"> Qualifying  would already be putting it in a cage ...<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">So ... Hushhhhh Close your eyes ... Put your hand in it ... Listen up ... Feel ...<\/span><\/p><p>Live ...<\/p><p><span style=\"color: rgb(89, 89, 89);\">Thanks to Frank and Isabelle<\/span><\/p><p><em style=\"color: rgb(89, 89, 89);\">Laurent-Stphane Montfort&nbsp;189.photography<\/em><\/p><p><em>La Relique Sainte Zo<\/em><\/p><h6><em> Laurent-Stphane Montfort 189.photography \/ Franck Sorbier - Extraits film  LEsprit des lieux -Chaalis <\/em><\/h6><p><em style=\"color: rgb(89, 89, 89);\">Descriptions<\/em><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_3-FRANCK_SORBIER_AmauryVoslion-FranckSorbier_1625697073.jpg\" alt=\"592 24Fashion TV 3 FRANCK SORBIER AmauryVoslion FranckSorbier 1625697073 jpg\"><\/p><p><em style=\"color: rgb(89, 89, 89);\">The servant<\/em><\/p><p><span style=\"color: rgb(89, 89, 89);\">1. Still life with reference to the Flemish School of the 15th and 16th centuries. Burgundy woven basket in white wicker garnished with vegetables, country bread, pine needles and dried beech foliage.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">2. Romanian dress with a belt in silk and ecru cotton on a ruffled tulle petticoat.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">3. Bustier in lace from Socit Choletaise de Fabrication, grosgrain ribbons and ecru guipure flowers on a  Romanian  dress in silk and ecru cotton on a ruffled tulle petticoat.<\/span><\/p><p>4<span style=\"color: rgb(89, 89, 89);\">. A large cotton crochet blanket capeline over a Romanian dress with a belt in silk and ecru cotton on a ruffled tulle petticoat.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">5. A shepherds cape in boiled wool with two-tone greige and ecru patterns<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">6. A hooded houppelande in plasticized organza veil edged with a ruche on a  Romanian  dress belted with an ecru silk and cotton taillonne on a ruffled tulle petticoat.<\/span><\/p><p><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_4-FRANCK_SORBIER-AmauryVoslion_copy_1625697261.jpg\" alt=\"592 24Fashion TV 4 FRANCK SORBIER AmauryVoslion copy 1625697261 jpg\"><\/p><p><span style=\"color: rgb(89, 89, 89);\">7. An ecru jacket in crochet and bobbin lace in the early twentieth century, embroidered with guipure flowers on a  Romanian  dress belted with an ecru silk and cotton taillonne on a ruffled tulle petticoat.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">8. A skirt with three superimposed ruffles edged with ecru ruching and a white boutis jacket trimmed with flower embroidery in white cotton.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">9. A long jacket in patched silk canvas with squares and rectangles in a frayed crude silk and viscose bunch over a  Romanian  dress belted with an ecru silk and cotton taillonne on a ruffled tulle petticoat.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">10. A skirt and a shawl embroidered with seashells in a greige floating thread jacquard on a  Romanian  dress with a belt in ecru silk and cotton on a petticoat with ruffles in tulle.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">11. A skirt with five free flounces in ecru paper effect linen and silk cloque and&nbsp;short cardigan with geometric patterns in merino and alpaca wool, braided and&nbsp;fringed on a  Romanian  dress belted with an ecru silk and cotton taillonne on the petticoat ruffled tulle.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">12. Cotton shawl crocheted and application of lace mosaics on a  Romanian  dress belted with a silk and ecru cotton belt on a ruffled tulle petticoat.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">13. A monastic coat in pleated Fortuny velvet, with draped sleeves, embroidered with water pearl at the end of the 19th century, offered by Mr. Franois Lesage.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">14. A bridal set made up of a lace camisole, white, ecru and gold guipures, entirely inlaid by hand on fragments of lace skirt from Lyon and Calais and a circle skirt in white silk organza, embroidered with stars and leaves of gold guipures.<\/span><\/p><p><em style=\"color: rgb(89, 89, 89);\">The Ferryman<\/em><\/p><p><span style=\"color: rgb(89, 89, 89);\">15. A toga draped in white cotton veil jacquard fil coup.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">16. A toga draped in white cotton veil with thread-cut jacquard and wings in a spider-like composition of embroidery threads, raffia and organza feathers.<\/span><\/p><p><em style=\"color: rgb(89, 89, 89);\">The Relic<\/em><\/p><p><span style=\"color: rgb(89, 89, 89);\">17. The relic is wrapped between two gold mechanical lace from Socit&nbsp;Choletaise de Fabrication, guipures by Monsieur Beauvillain, embroidered with&nbsp;faceted, colored and translucent rhinestones diamond-like, cultured pearls and chains, enhanced with elements of Napoleon III bridal globes.<\/span><\/p><p>1<span style=\"color: rgb(89, 89, 89);\">8. Long full-biased sheath with train, American armholes in black silk crepe.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">19. Long coat, short sleeves with pleats in gold, silver and black jacquard with a granite effect, trimmed with fine gold guipure by Monsieur Beauvillain on a long full-biased sheath with a train, American armholes in black silk crepe.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">20.  Renaissance  pleated cape in damask with flower and leaf patterns&nbsp;embroidered in between with copper mechanical lace from Socit Choletaise de Fabrication on a long full-biased sheath with a train, American armholes in&nbsp;black silk crepe.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">21. Long full-biased sheath with a small train, half-cup neckline in ecru silk crepe.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">22. Mid-length coat, three-quarter sleeves in Greek Orthodox jacquard patterned with floral arrangements and illumination-style chalices on a long full- biased sheath with a small train, demi-cup neckline in ecru silk crepe.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">23. Small coat in Baroque Greek Orthodox damask with floral motifs and&nbsp;illuminations, embroidered with water pearls on a long full-biased sheath with a&nbsp;small train, plunging neckline in ecru silk crepe.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">24. Long sheath with a train, stand-up collar in black gold guipures by Monsieur Beauvillain, entirely inlaid by hand.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">25. Long cardigan in jacquard in the Maison Rubelli vat style edged with a beaded ruche on a long sheath sheath with a train, stand-up collar in black gold guipures by Monsieur Beauvillain, entirely inlaid by hand.<\/span><\/p><p><span style=\"color: rgb(89, 89, 89);\">26. Long batwing coat in pastel, brown and gold floral jacquard by Rubelli,&nbsp;embroidered in-between with mechanical lace from Socit Choletaise de&nbsp;Fabrication on a long sheath with a train, stand-up collar in black gold guipures by Monsieur Beauvillain, entirely inlaid with the hand.<\/span><\/p><h6><em><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_W2122_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX_Photography_FranckSorbier14_1625695502.jpg\" alt=\"592 24Fashion TV FRANCK SORBIER W2122 HAUTE COUTURE L ESPRIT DES LIEUX Photography FranckSorbier14 1625695502 jpg\">Minos de chez Mario Luraschi<\/em><\/h6><h6><em> Laurent-Stphane Montfort 189.photography \/ Franck Sorbier - Extraits film  LEsprit des lieux -Chaalis <\/em><\/h6><p>Assistants tournage cadrage, lumires, photographie et logistique&nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ Shooting assistants framing, light, photography and logistics <\/span><em>Jules Sarah&nbsp;&amp;&nbsp;Grgoire Vallet. <\/em>Montage et talonnage <span style=\"color: rgb(89, 89, 89);\">\/ Making and calibration <\/span><em>Laurent-Stphane Montfort \/ 189.photography. <\/em>Lieux de tournage <span style=\"color: rgb(89, 89, 89);\">\/ shooting sets <\/span><\/p><p><em>Abbaye Royale de Chaalis Domaine de Chaalis<\/em><\/p><p><em>Fort dErmenonville<\/em><\/p><p><em>Ferme Chaalis de la Socit Cavalcade<\/em><\/p><p>Coordination et Image <span style=\"color: rgb(89, 89, 89);\">\/ Coordination and Branding <\/span><em>Bruno Le Page <\/em><\/p><p>Stagiaire assistante habillage <span style=\"color: rgb(89, 89, 89);\">\/ dressing assistant trainee <\/span><em>Lucie Menzaroba <\/em><\/p><p>La Maison Franck Sorbier remercie <span style=\"color: rgb(89, 89, 89);\">\/ Maison Franck Sorbier thanks<\/span><\/p><p><em>Mario Luraschi&nbsp;&amp;&nbsp;Clmence Faivre-Luraschi<\/em><\/p><p>et tout particulirement &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ and particularly&nbsp;<\/span><em>Yann Vaille <\/em>accompagn de &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ accompanied by&nbsp;<\/span><em>Martial Bergier, Nathanal Foucault &amp;&nbsp;Guillaume Castillon <\/em>et&nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ and&nbsp;<\/span><em>Galle Brigo <\/em>de la Socit Cavalcade&nbsp; \/<span style=\"color: rgb(89, 89, 89);\"> of Socit Cavalcad e&nbsp;<\/span>pour sa patience et son ternelle amiti \/ fo<span style=\"color: rgb(89, 89, 89);\">r her patience and timeless friendship<\/span><\/p><p>Frank et Isabelle Sorbier remercient tout particulirement \/ Fr<span style=\"color: rgb(89, 89, 89);\">ank and Isabelle Sorbier especially thank<\/span><\/p><p>Ale<em>xis de Kermel <\/em>, Administrateur du Domaine de Chaalis&nbsp;\/<span style=\"color: rgb(89, 89, 89);\"> Director of the Domaine de Chaalis&nbsp; <\/span>et&nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ and <\/span><em>Virginie Potdevin<\/em><\/p><p>Des remerciements  linfini &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ ad infinitum thanks <\/span> &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ to&nbsp;<\/span><em>Laurent-Stphane Montfor t<\/em> &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ to&nbsp;<\/span><em>Bruno Le Page <\/em> &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ to&nbsp;<\/span><em>Henri Scars Struck <\/em> &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ to&nbsp;<\/span><em>Jules Sarah&nbsp;&amp;&nbsp;Grgoire Valle t<\/em>deux belles personnes  lavenir certain \/<span style=\"color: rgb(89, 89, 89);\"> two beautiful people with an obvious future <\/span>&nbsp; \/<span style=\"color: rgb(89, 89, 89);\"> to&nbsp; <\/span><em>Elena Berbinau&nbsp;&amp;&nbsp;Chems Haj Ayed <\/em> &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ to&nbsp;<\/span><em>Ilian Gacogne <\/em> &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ to&nbsp;<\/span><em>Mario Luraschi&nbsp;&amp;&nbsp;Clmence Faivre-Luraschi &nbsp;<\/em> &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ to&nbsp;<\/span><em>Yann Vaille&nbsp;&amp;&nbsp;Galle Brig o<\/em> &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ to&nbsp;<\/span><em>Monsieur de Kermel <\/em> &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ to&nbsp;<\/span><em>Sophie Gassmann<\/em><\/p><p> &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ to&nbsp;<\/span><em>Christian Montfort&nbsp;<\/em>pour son amiti &nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ for his friendship <\/span>Producteurs&nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ producers <\/span>pour le Fonds de Dotation Sorbier&nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ for the Sorbier Endowment Funds<\/span><\/p><p><em>Sophie&nbsp;&amp;&nbsp;Franois Berbinau Olivia Chekroun Marie-Laure Le Guay Marie-Laure Martin Jeanne Morel Clment Pouliquen Guy Soyez <\/em> notre Ami, le dernier Samoura disparu en Avril 2021 \/ t<span style=\"color: rgb(89, 89, 89);\">o our Friend, the last Samurai gone in April, 2021 <\/span>Ka<em>nae Taniwaki<\/em><\/p><p><em><img src=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_W2122_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX_Photography_FranckSorbier48_1625695569.jpg\" alt=\"592 24Fashion TV FRANCK SORBIER W2122 HAUTE COUTURE L ESPRIT DES LIEUX Photography FranckSorbier48 1625695569 jpg\">Chems Haj Ayed incarnant le Passeur au sein de la Fort dErmenonville<\/em><\/p><h6> Laurent-Stphane Montfort 189.photography \/ Franck Sorbier - Extraits film  LEsprit des lieux -Chaalis <\/h6><p>MAISON FRANCK SORBIER<\/p><p>Relations Extrieures&nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ External Relations<\/span><\/p><p>Maison de Haute Couture Franck Sorbier et&nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ and<\/span><\/p><p>Le Fonds de Dotation Sorbier<\/p><p><em>Madame Isabelle Tartire-Sorbier<\/em>, Prsidente&nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ CEO <\/span>+ 33 (0) 1 75 51 70 55 + 33 (0) 9 51 71 47 51<\/p><p>corporate.francksorbier@gmail.com fondsdotationsorbier@gmail.com<\/p><p>Relations Presse&nbsp;<span style=\"color: rgb(89, 89, 89);\">\/ Press Relations&nbsp;<\/span>communication.francksorbier@gmail.com<\/p><p>Relations Haute Couture &amp; Contact Acheteurs Internationaux <span style=\"color: rgb(89, 89, 89);\">\/ Haute Couture Relations &amp; International buyers contact<\/span><\/p><p>hautecouturefrancksorbier@gmail.com<\/p><p> Mme la nuit la plus sombre prendra fin et le soleil se lvera.<\/p><p>V<em>ictor Hugo<\/em><\/p>","protected":false},"excerpt":{"rendered":"<p>FRANCK SORBIER HAUTE COUTURELes SorbierPices uniques Haute Couture Hiver 2021-2022L Esprit des lieuxCHAALISLoeil de la&#8230;<\/p>\n","protected":false},"author":1,"featured_media":117970,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[548],"tags":[],"class_list":["post-117969","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fashion"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"FRANCK SORBIER HAUTE COUTURELes SorbierPices uniques Haute Couture Hiver 2021-2022L Esprit des lieuxCHAALISLoeil de la...\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"FRANCK SORBIER HAUTE COUTURE - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"FRANCK SORBIER HAUTE COUTURELes SorbierPices uniques Haute Couture Hiver 2021-2022L Esprit des lieuxCHAALISLoeil de la...\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX-1_1625695205.jpg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX-1_1625695205.jpg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2021-07-06T00:00:00+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2021-07-06T00:00:00+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"FRANCK SORBIER HAUTE COUTURE - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"FRANCK SORBIER HAUTE COUTURELes SorbierPices uniques Haute Couture Hiver 2021-2022L Esprit des lieuxCHAALISLoeil de la...\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX-1_1625695205.jpg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/#blogposting\",\"name\":\"FRANCK SORBIER HAUTE COUTURE - Beauty Ring Magazine\",\"headline\":\"FRANCK SORBIER HAUTE COUTURE\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/s3.wasabisys.com\\\/24fashion\\\/article_photos\\\/592_24Fashion_TV_FRANCK_SORBIER_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX-1_1625695205.jpg\",\"caption\":\"FRANCK SORBIER HAUTE COUTURE\"},\"datePublished\":\"2021-07-05T20:00:00-04:00\",\"dateModified\":\"2021-07-05T20:00:00-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/#webpage\"},\"articleSection\":\"Fashion\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\",\"position\":2,\"name\":\"Fashion\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/#listItem\",\"position\":3,\"name\":\"FRANCK SORBIER HAUTE COUTURE\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/\",\"name\":\"FRANCK SORBIER HAUTE COUTURE - Beauty Ring Magazine\",\"description\":\"FRANCK SORBIER HAUTE COUTURELes SorbierPices uniques Haute Couture Hiver 2021-2022L Esprit des lieuxCHAALISLoeil de la...\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/s3.wasabisys.com\\\/24fashion\\\/article_photos\\\/592_24Fashion_TV_FRANCK_SORBIER_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX-1_1625695205.jpg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/#mainImage\",\"caption\":\"FRANCK SORBIER HAUTE COUTURE\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/franck-sorbier-haute-couture\\\/#mainImage\"},\"datePublished\":\"2021-07-05T20:00:00-04:00\",\"dateModified\":\"2021-07-05T20:00:00-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>FRANCK SORBIER HAUTE COUTURE - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"FRANCK SORBIER HAUTE COUTURE - Beauty Ring Magazine","description":"FRANCK SORBIER HAUTE COUTURELes SorbierPices uniques Haute Couture Hiver 2021-2022L Esprit des lieuxCHAALISLoeil de la...","canonical_url":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"FRANCK SORBIER HAUTE COUTURE - Beauty Ring Magazine","og:description":"FRANCK SORBIER HAUTE COUTURELes SorbierPices uniques Haute Couture Hiver 2021-2022L Esprit des lieuxCHAALISLoeil de la...","og:url":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/","og:image":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX-1_1625695205.jpg","og:image:secure_url":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX-1_1625695205.jpg","article:published_time":"2021-07-06T00:00:00+00:00","article:modified_time":"2021-07-06T00:00:00+00:00","twitter:card":"summary_large_image","twitter:title":"FRANCK SORBIER HAUTE COUTURE - Beauty Ring Magazine","twitter:description":"FRANCK SORBIER HAUTE COUTURELes SorbierPices uniques Haute Couture Hiver 2021-2022L Esprit des lieuxCHAALISLoeil de la...","twitter:image":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX-1_1625695205.jpg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/#blogposting","name":"FRANCK SORBIER HAUTE COUTURE - Beauty Ring Magazine","headline":"FRANCK SORBIER HAUTE COUTURE","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX-1_1625695205.jpg","caption":"FRANCK SORBIER HAUTE COUTURE"},"datePublished":"2021-07-05T20:00:00-04:00","dateModified":"2021-07-05T20:00:00-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/#webpage"},"articleSection":"Fashion"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/fashion\/#listItem","position":2,"name":"Fashion","item":"https:\/\/beautyring.info\/category\/fashion\/","nextItem":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/#listItem","position":3,"name":"FRANCK SORBIER HAUTE COUTURE","previousItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/#webpage","url":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/","name":"FRANCK SORBIER HAUTE COUTURE - Beauty Ring Magazine","description":"FRANCK SORBIER HAUTE COUTURELes SorbierPices uniques Haute Couture Hiver 2021-2022L Esprit des lieuxCHAALISLoeil de la...","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/s3.wasabisys.com\/24fashion\/article_photos\/592_24Fashion_TV_FRANCK_SORBIER_HAUTE_COUTURE_L_ESPRIT_DES_LIEUX-1_1625695205.jpg","@id":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/#mainImage","caption":"FRANCK SORBIER HAUTE COUTURE"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/#mainImage"},"datePublished":"2021-07-05T20:00:00-04:00","dateModified":"2021-07-05T20:00:00-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"117969","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-04-11 22:30:01","updated":"2023-04-11 23:24:49"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/fashion\/\" title=\"Fashion\">Fashion<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tFRANCK SORBIER HAUTE COUTURE\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Fashion","link":"https:\/\/beautyring.info\/category\/fashion\/"},{"label":"FRANCK SORBIER HAUTE COUTURE","link":"https:\/\/beautyring.info\/fashion\/franck-sorbier-haute-couture\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/117969"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=117969"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/117969\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/117970"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=117969"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=117969"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=117969"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}