{"id":118011,"date":"2021-06-17T20:00:00","date_gmt":"2021-06-18T00:00:00","guid":{"rendered":"https:\/\/24fashion.tv\/Article\/interview-yun-qu-about-videmus-omnia-rtw%C2%A0aw21-collection-379244"},"modified":"2021-06-17T20:00:00","modified_gmt":"2021-06-18T00:00:00","slug":"interview-yun-qu-about-videmus-omnia-rtw-aw21-collection","status":"publish","type":"post","link":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/","title":{"rendered":"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection"},"content":{"rendered":" <img src='https:\/\/vprcommag.com\/wp-content\/uploads\/2021\/06\/VIDEMUS30-BLK1-1.jpg' style=\"display:none\"> <br><p>Videmus Omnia is an artisan fashion brand based in New York City. Founded in 2016 by Chinese fashion designer Yun Qu.<\/p><p>Music and fashion have been closely intertwined for most of the 20th and 21st centuries. The grunge stylings of the 1990s are forever synonymous with the music of Nirvana whilst the flapper dresses of 1920s New York evoke a vibrant vision of a live Jazz band. These powerful connections between clothing and music form the basis for the designs of Videmus Omnia (We see everything) by designer Yun Qu. This is especially true of her latest AW2021 collection The Wanderer.<\/p><p>The New York based brand focuses on creating innovative, unconventional fashion while taking cues from modern art and music pioneers. The brand aims to design timeless wearable art garments with deconstructed silhouettes, infused with luxurious and intricate textiles.<\/p><p>Videmus Omnia is originated from Latin. It means We See Everything.<\/p><p>The brand breaks with traditional garment construction exploring new ways to dress people. As the designer, Yun tried to break the stereotypical method of developing a collection. Different from other young designers brand, the designer doesn&#8217;t follow a commercial or classic route. She designs for the women who genuinely want to dress unique and artistic, but also care about the quality and tailoring of the garments.<\/p><p>INTERVIEW WITH YUN QU, FOUNDER OF VIDEMUS OMNIA<\/p><p>When did you first realize you wanted to launch VIDEMUS OMNIA?<\/p><p>I realized that I wanted to start my own brand when I was studying fashion design in Milan. When I was studying in Italy, I usually walked around the city and saw a few independent fashion shops. The experience gave me an idea that I wanted to start my brand one day. After I moved back to New York, I worked for a brand briefly and I made the decision to start my own brand a few month after I graduated from FIT. <\/p><p>If you could go back and tell yourself one thing before beginning your career what would it be?<\/p><p>Before you sign any contracts with different companies, please ready the contracts carefully and send them to a lawyer to review if it is necessary. Do thorough research before you work with any companies you dont know. Always negotiate the terms with them and dont be shy about it. <\/p><p>What role do you think social media plays in art industry today?<\/p><p>Social media has been playing important role in our daily lives. At this digital age, we rely on our phone every day, even every hour. It has improved accessibility to the art industry, and help promoting businesses to wider audiences and generate greater sales. People use social media to promote their works, make connections, and introduce new brands and artists to the market. <\/p><p>How do you want your clients to feel when wearing VIDEMUS OMNIApiecesand in what occasions can be worn?<\/p><p>I want my clients to feel joyful and confident when they wear my pieces. They will feel they are unique, and excited to show off the clothes and express themselves. My brand always use premium materials, I want the clients to feel comfortable when they wear our clothes too. <\/p><p>I have two lines, Haute Couture and Ready To wear. The clients can wear the Haute Couture pieces to important events, red carpets, interviews and photoshoots. They can wear the Ready-To-Wear line anywhere they want. They can wear them to go to work, go to events, to go on a date or to go party. It really depend on the clients and how they style the pieces. Ill just be happy to see them wearing my clothes and feeling very confident. <\/p><p>What do you think is the biggest advantage in being based in United States?<\/p><p>Its very easy to find resources and materials in the city. The US has good E-commerce systems. If you order any materials online, you can always receive the packages within a few days. New York is rich in culture and filled with creative people from all over the world. It is easy to make connections and I found that people are very open-minded and willing to try new things. <\/p><p>There is one market, in particular that youre interested in now?<\/p><p>Im very interested in the Middle East market. The customers in the middle east love gowns and unique dresses. I like to design Haute Couture dresses with luxurious materials. Id like to bring my brand to the Middle East market one day and see if people will like my designs. Im also very interested in the UK market. I think the customers in the UK will like my brands artistic styles. <\/p><p>How COVID19 situation affected your brand and how did you overcome this challenge?<\/p><p>I think 2020 was the worst year for my brand, I struggled a lot with the funding problem. I tried to budget everything and the sale went down a lot. I left the showroom and boutique in New York that Ive been working with for the past two year. We needed to cut down a lot of costs with PR and showrooms to proceed with up and coming new collections. As soon as I got back from Paris Fashion Week in March, New York was on lockdown for a couple of months and I was not able to work with the pattern maker and seamstress. We decided to take a break from one season. <\/p><p>Im glad I took some time off to myself last year. It would be a waste of money to launch a collection during the middle of the pandemic. After I took a few months off, I could think more clearly with better plans for the brand. The pandemic has forced me to slow down my paste and to think, instead of just keep doing collections after collections in order to fulfill the industry and buyers standard. <\/p><p>How do you think a brand should motivate its collaborators?<\/p><p>I usually give the collaborators small gifts from my brand such as the hoodies, or take them out for lunch or dinner after the collaboration to thank them for the hard work. <\/p><p>Describe us you as a creative in your personal lifeand how your feelings influence the creativity process?<\/p><p>When you run a brand and work on designs and marketing all by yourself, you dont really have a personal life. Thats what Ive learned from the past few years. I manage to take a day off once in a while to practice piano and guitar or to meet with friends. I enjoy working. It makes me feel happy and motivated to do better for the future. <\/p><p>When I work, I usually stay inside of my apartment and listen to different kinds of music, and try to decide what I want to do for the next seasons. Im a highly sensitive and emotional person. I can be in the zone and sketch unpredictable designs when I listen to certain songs. Usually, different kinds of music bring me different feelings, and those feelings can transform into images in my head, and I would start sketching the ideas based on those feelings and images that I -see-. I would say my feelings have influenced the way I design and what I design. And for me, this is an intriguing and riveting creative process. <\/p><p>What is the main inspiration of your new collection and why did you choose Paris to showcase it?<\/p><p>The new collection was inspired by 1920s Jazz music and the city of Paris. When I was in Paris back in 2020, I fell in love with this romantic city. I went to many jazz clubs there. I decided to use those two elements as inspiration for the new collection. And that is why I chose Paris to showcase it. I designed this new collection for women who live in Paris, or who love Paris. I supposed that after the pandemic ends, everybody would go outside, they will drink wine, dance, and wear artistic and elegant dresses on the street of Paris, or anywhere in the world. <\/p><p>Would you like to involve other creatives in your future projects and what do you think is the main mission of the CO-BRANDING concept?<\/p><p>Yes, I would love to involve other creatives in my future projects. I have collaborated with a music band, a graphic designer, and a shoe designer to develop a few designs in the past. I didnt use my name as the brand name because I didn&#8217;t want people to have certain expectations based on my nationality thus limit the brand&#8217;s potential for the future. I want to collaborate with talented people around the world and to develop innovative designs or products together. <\/p><p>The Co-Branding concept can bring new ideas as a team, and combine the strength of the creatives and grow together. During the process, the brands can learn from each other, share ideas, attract more traffic and business opportunities, and increase revenue for both businesses in effective ways. <\/p><p>How big fashion corporations can help young brands, in your opinion?<\/p><p>Young brands can bring innovative ideas to the industry. They dont have sufficient funding or resources to maintain the management or development cost. Some young brands are struggling with product development and can not generate bigger revenues. Big Fashion corporations can help young brands grow with their resources and connections. They can be the mentors or investors of those brands. They can also collaborate with young brands, and work together to help them gain recognition, increase the credibility of the products, and promote the brand through shared resources.<\/p><p>What are the next steps for your label, in order to grow up more?<\/p><p>Ive always wanted to work with scientists and engineers to develop new materials or new methods of designing clothes. In order to do so, I am preparing to move my brand to Europe very soon and start from there. I also plan to find investors to invest in my company, or to look for big fashion corporations to collaborate with. <\/p><p><\/p><p>Music and fashion have been closely intertwined for most of the 20th and 21st centuries. The grunge stylings of the 1990s are forever synonymous with the music of Nirvana whilst the flapper dresses of 1920s New York evoke a vibrant vision of a live Jazz band. These powerful connections between clothing and music form the basis for the designs of Videmus Omnia (We see everything) by designer Yun Qu. This is especially true of her latest AW2021 collection The Wanderer.<\/p><p>Yun Qus passion for fashion is matched only by her enduring love of music. A trained musician, she plays piano, electric guitar and drums, and whilst in High School played in a rock band. While her earlier AW2019 collection, Enigma, explored the music and fashion possibilities of a 21st century grunge, her AW2021 collection set it sights on the interwar Parisian jazz scene. Considering the fusion of music and fashion Yun reimagines the expressive, elegant a bold outfits worn by the Parisian women of the Annes Folles. Women like dancer Josephine Baker, who would spend her days drinking coffee in Montmartre, and her nights dancing at the Folies-Bergere. Yun captures the sense of movement and emotion evoked by jazz; from the up-tempo heart thumping thrills to the low-tempo graceful sway. Using metallic colours, exaggerated sleeves, fringing and frills, Yun has created pieces that evoke the artistry and sculptural elegance of the period whilst feeling thoroughly modern. Puff sleeves, patterned knitwear, bows, polka dots and harlequin prints are all drawn into the maelstrom of Yuns reimagined Parisian Jazz scene. A structured lace bodice dress grants the wearer the musical sensuality of the era, while a knitted dress underscores the feminine freedoms rediscovered in the 1920s. Yuns expansive silhouettes are matched only by her broad palette of textures and materials. Coloured metallics mirror the Parisian avant-gardes fascination with the machine age, exaggerated frills conjure a vision of the bustling cabaret and knitwear reinforces the eras shift away from restrictive corsets and unruly crinolines.<\/p><p>Yun captures the essence and spirit of the Annes Folles when women began to discover the path to political, economic and sexual liberation. Reimagining the golden age of style and grace in and the dawn of the modern era of female liberation, she distills a moment in history pregnant with possibility into an exciting and beautiful collection that empowers the 21st century wearer.<\/p><p>An advocate for slow fashion items made with care and love, Yuns AW2021 collection embrace classic construction techniques that produce beautiful, long lasting apparel. The classic and timeless designs, produced with the finest quality materials engage with the movement for clothing that translates across multiple seasons.<\/p><p> In 2016, after Yun graduated in 2016 from Fashion Institute of Technology, she started her artisanal avant-garde brand Videmus Omnia. The brand has been producing Couture collection for the last two years before taking a brief break to develop the ready to wear collection.<\/p><p>Videmus Omnia AW2021 Ready To Wear<\/p><p>Pre-order for customers coming soon on thewebsite.<\/p><p>Buyers can order at@imonishowroomparis<\/p><p>&nbsp;<\/p><p>* All images: Courtesy of Videmus Omnia<\/p><p>Photographer:@pmphotographynycModel:@anna_ebergMUA\/Hair:@catcam__<\/p>","protected":false},"excerpt":{"rendered":"<p>Videmus Omnia is an artisan fashion brand based in New York City. Founded in 2016&#8230;<\/p>\n","protected":false},"author":1,"featured_media":118012,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[548],"tags":[],"class_list":["post-118011","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fashion"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"Videmus Omnia is an artisan fashion brand based in New York City. Founded in 2016...\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"Videmus Omnia is an artisan fashion brand based in New York City. Founded in 2016...\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/vprcommag.com\/wp-content\/uploads\/2021\/06\/VIDEMUS30-BLK1-1.jpg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/vprcommag.com\/wp-content\/uploads\/2021\/06\/VIDEMUS30-BLK1-1.jpg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2021-06-18T00:00:00+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2021-06-18T00:00:00+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"Videmus Omnia is an artisan fashion brand based in New York City. Founded in 2016...\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/vprcommag.com\/wp-content\/uploads\/2021\/06\/VIDEMUS30-BLK1-1.jpg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/#blogposting\",\"name\":\"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection - Beauty Ring Magazine\",\"headline\":\"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW\\u00a0AW21 collection\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/vprcommag.com\\\/wp-content\\\/uploads\\\/2021\\\/06\\\/VIDEMUS30-BLK1-1.jpg\",\"caption\":\"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW\\u00a0AW21 collection\"},\"datePublished\":\"2021-06-17T20:00:00-04:00\",\"dateModified\":\"2021-06-17T20:00:00-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/#webpage\"},\"articleSection\":\"Fashion\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\",\"position\":2,\"name\":\"Fashion\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/#listItem\",\"position\":3,\"name\":\"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW\\u00a0AW21 collection\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/fashion\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/\",\"name\":\"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection - Beauty Ring Magazine\",\"description\":\"Videmus Omnia is an artisan fashion brand based in New York City. Founded in 2016...\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/vprcommag.com\\\/wp-content\\\/uploads\\\/2021\\\/06\\\/VIDEMUS30-BLK1-1.jpg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/#mainImage\",\"caption\":\"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW\\u00a0AW21 collection\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/fashion\\\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\\\/#mainImage\"},\"datePublished\":\"2021-06-17T20:00:00-04:00\",\"dateModified\":\"2021-06-17T20:00:00-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection - Beauty Ring Magazine","description":"Videmus Omnia is an artisan fashion brand based in New York City. Founded in 2016...","canonical_url":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection - Beauty Ring Magazine","og:description":"Videmus Omnia is an artisan fashion brand based in New York City. Founded in 2016...","og:url":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/","og:image":"https:\/\/vprcommag.com\/wp-content\/uploads\/2021\/06\/VIDEMUS30-BLK1-1.jpg","og:image:secure_url":"https:\/\/vprcommag.com\/wp-content\/uploads\/2021\/06\/VIDEMUS30-BLK1-1.jpg","article:published_time":"2021-06-18T00:00:00+00:00","article:modified_time":"2021-06-18T00:00:00+00:00","twitter:card":"summary_large_image","twitter:title":"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection - Beauty Ring Magazine","twitter:description":"Videmus Omnia is an artisan fashion brand based in New York City. Founded in 2016...","twitter:image":"https:\/\/vprcommag.com\/wp-content\/uploads\/2021\/06\/VIDEMUS30-BLK1-1.jpg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/#blogposting","name":"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection - Beauty Ring Magazine","headline":"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/vprcommag.com\/wp-content\/uploads\/2021\/06\/VIDEMUS30-BLK1-1.jpg","caption":"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection"},"datePublished":"2021-06-17T20:00:00-04:00","dateModified":"2021-06-17T20:00:00-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/#webpage"},"articleSection":"Fashion"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/fashion\/#listItem","position":2,"name":"Fashion","item":"https:\/\/beautyring.info\/category\/fashion\/","nextItem":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/#listItem","position":3,"name":"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection","previousItem":"https:\/\/beautyring.info\/category\/fashion\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/#webpage","url":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/","name":"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection - Beauty Ring Magazine","description":"Videmus Omnia is an artisan fashion brand based in New York City. Founded in 2016...","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/vprcommag.com\/wp-content\/uploads\/2021\/06\/VIDEMUS30-BLK1-1.jpg","@id":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/#mainImage","caption":"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/#mainImage"},"datePublished":"2021-06-17T20:00:00-04:00","dateModified":"2021-06-17T20:00:00-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"118011","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-04-11 22:30:01","updated":"2023-04-11 23:22:44"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/fashion\/\" title=\"Fashion\">Fashion<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tINTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Fashion","link":"https:\/\/beautyring.info\/category\/fashion\/"},{"label":"INTERVIEW: Yun Qu about VIDEMUS OMNIA RTW AW21 collection","link":"https:\/\/beautyring.info\/fashion\/interview-yun-qu-about-videmus-omnia-rtw-aw21-collection\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/118011"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=118011"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/118011\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/118012"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=118011"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=118011"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=118011"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}