{"id":119068,"date":"2023-04-21T10:36:03","date_gmt":"2023-04-21T14:36:03","guid":{"rendered":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/"},"modified":"2023-04-21T10:36:03","modified_gmt":"2023-04-21T14:36:03","slug":"new-york-festivals-announces-2023-tv-film-awards-winners","status":"publish","type":"post","link":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/","title":{"rendered":"New York Festivals Announces 2023 TV &#038; Film Awards Winners"},"content":{"rendered":"<p><\/p>\n<div>\n<div class=\"pr_images_column\">\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/458179\/2023-tvf-winners-graphic-pr.jpeg#3000x1100\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/458179\/2023-tvf-winners-graphic-pr.jpeg\" width=\"300\" height=\"110\" style=\"display:none\"\/><\/a><\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/437929\/tvf-logo.png#866x361\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/437929\/tvf-logo.png\" width=\"300\" height=\"125\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/div>\n<\/div>\n<p style=\"margin-bottom:1em;font-size:115%;\"><i>Al Jazeera English is Broadcaster of the Year, Zinc Media Group Earns Production Company of the Year<\/i><\/p>\n<p>NEW YORK, NEW YORK, USA, April 18, 2023\/<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.einpresswire.com\/\" dir=\"auto\" data-wpel-link=\"external\">EINPresswire.com<\/a>\/ &#8212; New York Festivals<sup>®<\/sup> <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/tvfilm.newyorkfestivals.com\/\" data-wpel-link=\"external\">TV &amp; Film Awards<\/a> competition announced the 2023 <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.newyorkfestivals.com\/Storytellers-gala\/\" data-wpel-link=\"external\">Storytellers Gala<\/a> <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/tvfilm.newyorkfestivals.com\/winners\/List\/7839e438-6aec-439e-bf9a-7ca894d7d5dd\" data-wpel-link=\"external\">award winners<\/a>. Globally recognized content created by some of the world’s most innovative storytellers and broadcasters from 42 countries were honored with awards on April 18th at the virtual Storytellers Gala. <\/p>\n<p>NYF’s TV &amp; Film Grand Jury recognized captivating content created by  global storytellers in the following genres primetime entertainment, documentaries, investigative journalism, sports coverage, promos, streaming media, and brand image films. To view the 2022 TV &amp; Film winners’ gallery visit: HERE. <\/p>\n<p>For the seventh consecutive year, Al Jazeera English’s coverage of international issues and wide-ranging themes earned the network the prestigious title of Broadcaster of the Year.  The network was awarded an impressive number of trophies across NYF’s robust category roster for their diverse international news and current affairs programming including The Big Picture, Fault Lines, Witness, 101 East, Africa Direct, Al Jazeera Investigations. A Sense of Community, and First Nation Frontlines.   Gold winners include “Fault Lines – Silenced: The Killing of Journalists in Mexico,” “101 East – Thailand&#8217;s Fearless Cop,” and, “A Sense of Community: Outer Hebrides.” Al Jazeera Digital Gold winners include “Start Here – On the Road,” and “AJ Close Up.”<\/p>\n<p>“It’s an honour to be named Broadcaster of the Year by the New York Festivals TV &amp; Film Awards,” said Giles Trendle, Managing Director of Al Jazeera English.  “Like many media organisations, our journalists face so many challenges in reporting the news and telling the important stories from around the world that matter. This reward is a tribute to our wonderful, creative, hardworking teams who deliver so consistently and with such professionalism. I would like to thank the international jurors and our media industry peers for recognizing the work we do.”<\/p>\n<p>Zinc Media Group was honored with the Production Company of the Year Award. Known for creating high quality content for its brands, Zinc Media Group earned multiple trophies including a 2023 Grand Award, a Gold trophy, 4 Silver, and a Bronze trophy for their productions including “Vulnerable People,” “Wish,” “Opening Up,” “Body-Worn Cameras: Teenagers,” and “My Greatest Shot in partnership with Adobe.” <\/p>\n<p>&#8220;To be awarded this overall prize of Production Company of the Year, when competing against such revered peers, is such an honour.  I’m very proud of the collective endeavour and the dedication of our team at Zinc Media Group to have reached such a significant milestone in our journey. Thank you to the judges and to the New York Festivals, the award is very gratefully received and will be a prominent part of our ongoing story.”— Mark Browning, CEO of Zinc Media Group <\/p>\n<p>2023 Grand Awards<\/p>\n<p>Vulnerable People, Zinc Media Group – Corporate Image\/Attitudinal Training. The Grand Award winning film was created for Network Rail (NR), the owner and infrastructure manager of the railway network in the UK, to provide NR personnel tasked with handling the delicate situation of the public trespassing on NR infrastructure and how to address the daily risk across the rail network. The film was designed to keep the viewer guessing how it would resolve, to draw them in and remind them that potential fatalities can arise not necessarily from a failure of protocol but by failing to connect separate reports and taking appropriate action.<\/p>\n<p>Peaky Blinders, Caryn Mandabach Productions and Tiger Aspect Productions for BBC One – Entertainment Program\/Drama earned the 2023 Grand Award. Set in Britain in 1919, with the nation cleaned out by the extravagances of the Great War, the series chronicles Thomas Shelby and his family who run the most feared and powerful gang, the Peaky Blinders. Named for their practice of sewing razor blades into the peaks of their caps, they make money from illegal betting, protection, and the black market. In season 6, Tommy faces his demons in an epic final showdown.<\/p>\n<p>Naked &#8211; Sex and Gender: 1. Born Unequal, 2. Finally Grown Up, German Television ZDF – Documentary\/Human Concerns. The Grand Award winning documentary explores the idea that a purely polar view of the sexes is no longer an option. The awareness of the diversity of the sexes, the fluidity of gender identity and the relativity of its classification has increased, due to the emergence of diverse minorities. The production details the sometimes uncontradicted journey through the variety of identities, feelings, fears, and joys urging that… We need to talk. With each other. Now.<\/p>\n<p>New York Festivals Storyteller’s Gala honored “The Kalb Report” with the 13th annual New York Festivals<sup>®<\/sup> Lifetime Achievement Award. For nearly 30 years the Kalb Report, moderated by eminent journalist Marvin Kalb, has provided a forum for prominent newsmakers and journalists to discuss the news media’s impact on American democracy. <\/p>\n<p>“Saving Venice” Lion TV\/All3Media International\/PBS\/Arte was honored with the 2023 WaterBear Award honoring the highest scoring documentary across the Climate Change &amp; Sustainability, Environment &amp; Ecology, and Nature &amp; Wildlife categories. The award-winning series captures extraordinary stories of the battle to save this historic city and reveals the city&#8217;s remarkable conflict with the elements and how solutions for its future could lie in its past.<\/p>\n<p>“It’s a real honor to win such a prestigious and important award and I want to thank Lion TV and All3Media for giving me the chance to be part of an incredible journey. I hope that this film contributes to raising awareness towards such important themes.” –Elena Mortelliti, Producer, Saving Venice<\/p>\n<p>Documentaries dominated this year’s competition. Top scoring docs captivated audiences and impressed the Grand Jury. Gold winning documentaries include “11 Minutes” See It Now Studios, Triage Entertainment, and All Rise Films\/Paramount+, “Secrets of the Sea” MacGillivray Freeman Films, “52 Documentary” Voice of America, “Janet Jackson” Workerbee and AEC for Lifetime and A+E, “The Unknown Master of Restoration” NHK (Japan Broadcasting Corporation), “Africa Direct &#8211; First Dance Steps: Don Sen Folo\/A Legacy” Big World Cinema for Al Jazeera English, “Forgotten Children – Rohingya Refugees” Threesixzero Productions Pte Ltd, “What is wilderness?” Nautilusfilm GmbH, “One at Heart, Jessica Soho: Wounds of Woes” and “The Atom Araullo Specials: Eye in the Dark” for GMA Network, Inc., “My Son and the Sun” Yomiuri Telecasting Corporation, “Choices &#8211; Dare to Dream” DW Deutsche Welle, “Riot Island” Peddling Pictures, “Juquery, A Place out of this World” GloboNews, “Auswärtsspiel &#8211; Die Toten Hosen in Ost-Berlin” Martin Groß, “Canada &#8211; Surviving the Wild North” Terra Mater Studios GmbH, “Bosnia &#8211; A Frozen Reconciliation” OFF THE GRID-TRT WORLD, “Keep on Dancing” ABC TV Australia, “Natures Magic Moments” Light &amp; Shadow GmbH, and “Old People&#8217;s Home for Teenagers” Endemol Shine Australia.<\/p>\n<p>Entertainment Gold winners include “Gordon Ramsay’s Future Food Stars” Studio Ramsay for BBC One, UK  and “The Detectorists Feature Special” Channel X for BBC One UK, produced in association with All3Media International; “Dias Mejores” and “Bose” Paramount, “Marie Antoinette” A CANAL+ Creation Originale Produced by CAPA Drama, Banijay Studios France and Les Gens, “Rogue Heroes” A Kudos and Nebulastar Production for BBC One, and “Youth News@ PTS: I&#8217;ve Attempted Suicide, But I Want to Live” Public Television Service Foundation (PTS Taiwan). <\/p>\n<p>Breaking news coverage, features, and investigative reports showcased topics and events unfolding on the world stage. Gold winning entries include “The Killing of Shireen Abu Akleh” Al Jazeera English, “A Queen&#8217;s Conquest &#8211; Serena Williams Tribute” ESPN, “Land of Rising Dreams?” NHK (Japan Broadcasting Corporation), “CNA Correspondent: The Shanghai Lockdown” Mediacorp Pte Ltd, “WAR AT OUR BORDERS” and “FEARLESS IN TRANSNISTRIA” Antena 3.  Charles Stratford Senior Correspondent, Al Jazeera English, and Mark Stone, US Correspondent, Sky News each earned the New York Festivals Gold trophy for Best News Reporter\/Correspondent.<\/p>\n<p>Sports programming united fans and captivated viewers, Gold trophy winners include “B1G Trailblazers” Big Ten Network, “The Tournament: A History of ACC Men’s Basketball” ESPN,  “Grails ‘When Sneakers Change the Game’&#8221;  Brainstormin Productions Inc., “Betty Skelton: Boundless” Fox Sports Network, “NBA Hoop Cities” Casual Films, “The Last Stone” Tern Television Productions Limited, a Zinc Media Company, “The Wall Climb for Gold” Windfall Films, and “Abuse- sexualised violence in German swimming” EyeOpening.Media GmbH.  <\/p>\n<p>Promos enticed viewers to tune in. Gold winners include “BBC First Finds” BBC Studios, “Tom Cruise´s Movies Stunt on AXN” Sony Pictures Entertainment Creative Center Iberia, “France 5 &#8211; Science Grand Format” France 3, “UCL Goosebumps are Back” beIN SPORTS Asia, “Gold Goal” Tyc Sports, “Sawa Radio Promotion” Alhurra Television, and “ABC Australia: Celebrating 90 years campaign” Australian Broadcasting Corp. Sydney.<\/p>\n<p>Corporate and Brand Image Films conveyed the company’s mission and ethos to consumers. Gold trophy winning work include “DBL &#8211; Nothing to hide” AL DENTE ENTERTAINMENT GMBH, “Benefits of Renewable Natural Gas” Shells Creative Solutions Content Engine, “Mitie Forte” and “Passion with Purpose “Casual Films, “Fire” DeVito\/Verdi, “You&#8217;re Welcome” Media Zoo Ltd., and “Opening Up” Zinc Media Group.<\/p>\n<p>New York Festivals Television &amp; Film Awards celebrates innovative storytelling from around the globe and honors content creators whose compelling programs reach international audiences. The competition’s 65-year legacy provides a showcase of exceptional work across all genres of entertainment media. <\/p>\n<p>All Entries in the 2023 competition were judged online and screened by NYF’s TV &amp; Film Awards Grand Jury of 200+ producers, directors, writers, and other creative media professionals from around the globe. Award-winning entries are showcased on the TV &amp; Film Awards winners gallery. <\/p>\n<p>New York Festivals announced the 2023 TV &amp; Film Awards competition’s award-winning entries at the 2023 Storytellers Gala virtual event on April 18th at 6PM EDT.  The virtual events featured global audio highlights, award winner’s acceptance speeches from around the world, and up-close and personal spotlight features with some of TV &amp; Film’s most respected storytellers and content creators. View the 2023 Storytellers Gala: <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.newyorkfestivals.com\/Storytellers-gala\/\" data-wpel-link=\"external\">https:\/\/www.newyorkfestivals.com\/Storytellers-gala\/<\/a>.<\/p>\n<p>To view the 2023 TV &amp; Film Awards winner’s showcase visit: <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/tvfilm.newyorkfestivals.com\/winners\/List\/7839e438-6aec-439e-bf9a-7ca894d7d5dd\" data-wpel-link=\"external\">https:\/\/tvfilm.newyorkfestivals.com\/winners\/List\/7839e438-6aec-439e-bf9a-7ca894d7d5dd<\/a>.<\/p>\n<p>About New York Festivals: <\/p>\n<p>New York Festivals <sup>®<\/sup><br \/>&#13;<br \/>\nCelebrating the World’s Best Work since 1957<\/p>\n<p>Advertising Awards<br \/>&#13;<br \/>\nAME Awards <sup>®<\/sup><br \/>&#13;<br \/>\nGlobal Awards <sup>®<\/sup><br \/>&#13;<br \/>\nBowery Awards<br \/>&#13;<br \/>\nRadio Awards<br \/>&#13;<br \/>\nTV &amp; Film Awards<\/p>\n<p>About NAB Show<\/p>\n<p>The 2023 NAB Show will be held April 15-19 at the Las Vegas Convention Center. NAB Show is the world&#8217;s largest and most comprehensive convention encompassing the convergence of media, entertainment, and technology. NAB Show is where global visionaries convene to bring content to life in new and exciting ways.<\/p>\n<p>About NAB <\/p>\n<p>The National Association of Broadcasters is the premier advocacy association for America&#8217;s broadcasters. NAB advances radio and television interests in legislative, regulatory and public affairs. Through advocacy, education and innovation, NAB enables broadcasters to best serve their communities, strengthen their businesses and seize new opportunities in the digital age. Learn more at <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.nab.org\" data-wpel-link=\"external\">www.nab.org<\/a>.<\/p>\n<p class=\"contact\" dir=\"auto\" style=\"margin: 1em 0;\">Gayle Seminara Mandel<br \/>New York Festivals<br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.einpresswire.com\/contact_author\/628708714\" data-src=\"akWTtSZOi21hyjZX\" data-wpel-link=\"external\">email us here<\/a><\/p>\n<p>    <img decoding=\"async\" alt=\"\" class=\"prtr\" src=\"https:\/\/www.einpresswire.com\/tracking\/article.gif?t=2&amp;a=8VD1QUWonjkrE9r8&amp;i=akWTtSZOi21hyjZX\"\/><\/p>\n<div class=\"article-footer\">\n<p class=\"text-center\">You just read:<\/p>\n<div class=\"share-vertical-bottom\">\n<div class=\"fleft pull-left\">\n<p>News Provided By<\/p>\n<p>\n      April 19, 2023, 01:27 GMT\n    <\/p>\n<\/p><\/div>\n<\/div>\n<p>      <input readonly=\"readonly\" type=\"text\" value=\"https:\/\/www.einpresswire.com\/article\/628708714\/new-york-festivals-announces-2023-tv-film-awards-winners\"\/><\/p>\n<p>\n        <br \/>EIN Presswire&#8217;s priority is source transparency. We do not allow opaque clients, and our editors try to be careful about weeding out false and misleading content.<br \/>\nAs a user, if you see something we have missed, please do bring it to our attention. Your help is welcome. EIN Presswire, Everyone&#8217;s Internet News Presswire,<br \/>\ntries to define some of the boundaries that are reasonable in today&#8217;s world. Please see our<br \/>\n<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/editorial-guidelines\" data-wpel-link=\"external\">Editorial Guidelines<\/a><br \/>\nfor more information.\n      <\/p>\n<\/p><\/div>\n<\/p><\/div>\n<p><script>\n  !function(f,b,e,v,n,t,s)\n  {if(f.fbq)return;n=f.fbq=function(){n.callMethod?\n  n.callMethod.apply(n,arguments):n.queue.push(arguments)};\n  if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0';\n  n.queue=[];t=b.createElement(e);t.async=!0;\n  t.src=v;s=b.getElementsByTagName(e)[0];\n  s.parentNode.insertBefore(t,s)}(window, document,'script',\n  'https:\/\/connect.facebook.net\/en_US\/fbevents.js');\n  fbq('init', '251889322717210');\n  fbq('track', 'PageView');\n<\/script><br \/>\n<br \/>Originally published at <a href=\"https:\/\/www.einpresswire.com\/article\/628708714\/new-york-festivals-announces-2023-tv-film-awards-winners\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">https:\/\/www.einpresswire.com\/article\/628708714\/new-york-festivals-announces-2023-tv-film-awards-winners<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Al Jazeera English is Broadcaster of the Year, Zinc Media Group Earns Production Company of the Year NEW YORK, NEW YORK, USA, April 18, 2023\/EINPresswire.com\/ &#8212; New York Festivals® TV &amp; Film Awards competition announced the 2023 Storytellers Gala award winners. Globally recognized content created by some of the world’s most innovative storytellers and broadcasters [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":119069,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[563],"tags":[],"class_list":["post-119068","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-movies"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"Al Jazeera English is Broadcaster of the Year, Zinc Media Group Earns Production Company of the Year NEW YORK, NEW YORK, USA, April 18, 2023\/EINPresswire.com\/ -- New York Festivals® TV &amp; Film Awards competition announced the 2023 Storytellers Gala award winners. Globally recognized content created by some of the world’s most innovative storytellers and broadcasters\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"New York Festivals Announces 2023 TV &amp; Film Awards Winners - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"Al Jazeera English is Broadcaster of the Year, Zinc Media Group Earns Production Company of the Year NEW YORK, NEW YORK, USA, April 18, 2023\/EINPresswire.com\/ -- New York Festivals® TV &amp; Film Awards competition announced the 2023 Storytellers Gala award winners. Globally recognized content created by some of the world’s most innovative storytellers and broadcasters\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/img.einpresswire.com\/medium\/458179\/2023-tvf-winners-graphic-pr.jpeg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/img.einpresswire.com\/medium\/458179\/2023-tvf-winners-graphic-pr.jpeg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2023-04-21T14:36:03+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2023-04-21T14:36:03+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"New York Festivals Announces 2023 TV &amp; Film Awards Winners - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"Al Jazeera English is Broadcaster of the Year, Zinc Media Group Earns Production Company of the Year NEW YORK, NEW YORK, USA, April 18, 2023\/EINPresswire.com\/ -- New York Festivals® TV &amp; Film Awards competition announced the 2023 Storytellers Gala award winners. Globally recognized content created by some of the world’s most innovative storytellers and broadcasters\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/img.einpresswire.com\/medium\/458179\/2023-tvf-winners-graphic-pr.jpeg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/#blogposting\",\"name\":\"New York Festivals Announces 2023 TV & Film Awards Winners - Beauty Ring Magazine\",\"headline\":\"New York Festivals Announces 2023 TV &#038; Film Awards Winners\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/458179\\\/2023-tvf-winners-graphic-pr.jpeg\",\"caption\":\"New York Festivals Announces 2023 TV &#038; Film Awards Winners\"},\"datePublished\":\"2023-04-21T10:36:03-04:00\",\"dateModified\":\"2023-04-21T10:36:03-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/#webpage\"},\"articleSection\":\"Movies and TV\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/movies\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/movies\\\/#listItem\",\"position\":2,\"name\":\"Movies and TV\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/movies\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/#listItem\",\"position\":3,\"name\":\"New York Festivals Announces 2023 TV & Film Awards Winners\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/movies\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/\",\"name\":\"New York Festivals Announces 2023 TV & Film Awards Winners - Beauty Ring Magazine\",\"description\":\"Al Jazeera English is Broadcaster of the Year, Zinc Media Group Earns Production Company of the Year NEW YORK, NEW YORK, USA, April 18, 2023\\\/EINPresswire.com\\\/ -- New York Festivals\\u00ae TV & Film Awards competition announced the 2023 Storytellers Gala award winners. Globally recognized content created by some of the world\\u2019s most innovative storytellers and broadcasters\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/458179\\\/2023-tvf-winners-graphic-pr.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/#mainImage\",\"caption\":\"New York Festivals Announces 2023 TV &#038; Film Awards Winners\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/new-york-festivals-announces-2023-tv-film-awards-winners\\\/#mainImage\"},\"datePublished\":\"2023-04-21T10:36:03-04:00\",\"dateModified\":\"2023-04-21T10:36:03-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>New York Festivals Announces 2023 TV &amp; Film Awards Winners - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"New York Festivals Announces 2023 TV & Film Awards Winners - Beauty Ring Magazine","description":"Al Jazeera English is Broadcaster of the Year, Zinc Media Group Earns Production Company of the Year NEW YORK, NEW YORK, USA, April 18, 2023\/EINPresswire.com\/ -- New York Festivals® TV & Film Awards competition announced the 2023 Storytellers Gala award winners. Globally recognized content created by some of the world’s most innovative storytellers and broadcasters","canonical_url":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"New York Festivals Announces 2023 TV &amp; Film Awards Winners - Beauty Ring Magazine","og:description":"Al Jazeera English is Broadcaster of the Year, Zinc Media Group Earns Production Company of the Year NEW YORK, NEW YORK, USA, April 18, 2023\/EINPresswire.com\/ -- New York Festivals® TV &amp; Film Awards competition announced the 2023 Storytellers Gala award winners. Globally recognized content created by some of the world’s most innovative storytellers and broadcasters","og:url":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/","og:image":"https:\/\/img.einpresswire.com\/medium\/458179\/2023-tvf-winners-graphic-pr.jpeg","og:image:secure_url":"https:\/\/img.einpresswire.com\/medium\/458179\/2023-tvf-winners-graphic-pr.jpeg","article:published_time":"2023-04-21T14:36:03+00:00","article:modified_time":"2023-04-21T14:36:03+00:00","twitter:card":"summary_large_image","twitter:title":"New York Festivals Announces 2023 TV &amp; Film Awards Winners - Beauty Ring Magazine","twitter:description":"Al Jazeera English is Broadcaster of the Year, Zinc Media Group Earns Production Company of the Year NEW YORK, NEW YORK, USA, April 18, 2023\/EINPresswire.com\/ -- New York Festivals® TV &amp; Film Awards competition announced the 2023 Storytellers Gala award winners. Globally recognized content created by some of the world’s most innovative storytellers and broadcasters","twitter:image":"https:\/\/img.einpresswire.com\/medium\/458179\/2023-tvf-winners-graphic-pr.jpeg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/#blogposting","name":"New York Festivals Announces 2023 TV & Film Awards Winners - Beauty Ring Magazine","headline":"New York Festivals Announces 2023 TV &#038; Film Awards Winners","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/458179\/2023-tvf-winners-graphic-pr.jpeg","caption":"New York Festivals Announces 2023 TV &#038; Film Awards Winners"},"datePublished":"2023-04-21T10:36:03-04:00","dateModified":"2023-04-21T10:36:03-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/#webpage"},"articleSection":"Movies and TV"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/movies\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/movies\/#listItem","position":2,"name":"Movies and TV","item":"https:\/\/beautyring.info\/category\/movies\/","nextItem":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/#listItem","position":3,"name":"New York Festivals Announces 2023 TV & Film Awards Winners","previousItem":"https:\/\/beautyring.info\/category\/movies\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/#webpage","url":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/","name":"New York Festivals Announces 2023 TV & Film Awards Winners - Beauty Ring Magazine","description":"Al Jazeera English is Broadcaster of the Year, Zinc Media Group Earns Production Company of the Year NEW YORK, NEW YORK, USA, April 18, 2023\/EINPresswire.com\/ -- New York Festivals® TV & Film Awards competition announced the 2023 Storytellers Gala award winners. Globally recognized content created by some of the world’s most innovative storytellers and broadcasters","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/458179\/2023-tvf-winners-graphic-pr.jpeg","@id":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/#mainImage","caption":"New York Festivals Announces 2023 TV &#038; Film Awards Winners"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/#mainImage"},"datePublished":"2023-04-21T10:36:03-04:00","dateModified":"2023-04-21T10:36:03-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"119068","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-04-21 14:36:04","updated":"2023-04-21 14:40:27"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/movies\/\" title=\"Movies and TV\">Movies and TV<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tNew York Festivals Announces 2023 TV &amp; Film Awards Winners\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Movies and TV","link":"https:\/\/beautyring.info\/category\/movies\/"},{"label":"New York Festivals Announces 2023 TV &#038; Film Awards Winners","link":"https:\/\/beautyring.info\/movies\/new-york-festivals-announces-2023-tv-film-awards-winners\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/119068"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=119068"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/119068\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/119069"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=119068"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=119068"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=119068"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}