{"id":119468,"date":"2023-04-26T16:43:52","date_gmt":"2023-04-26T20:43:52","guid":{"rendered":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/"},"modified":"2023-04-26T16:43:52","modified_gmt":"2023-04-26T20:43:52","slug":"vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023","status":"publish","type":"post","link":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/","title":{"rendered":"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023"},"content":{"rendered":"<p><img class=\"img-responsive\" title=\"Vail Resorts, Inc. logo (PRNewsFoto\/Vail Resorts, Inc.)\" data-getimg=\"https:\/\/mma.prnewswire.com\/media\/323609\/vail_Logo.jpg?w=200\" alt=\"Vail Resorts, Inc. logo (PRNewsFoto\/Vail Resorts, Inc.)\" loading=\"lazy\" style=\"display:none\"><\/p>\n<div class=\"row\">\n<div class=\"col-lg-10 col-lg-offset-1\">\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">BROOMFIELD, Colo.<\/span><\/span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">April 21, 2023<\/span><\/span> \/PRNewswire\/ &#8212; Vail Resorts, Inc. (NYSE: <a rel=\"nofollow noopener\" target=\"_blank\" class=\"ticket-symbol\" data-toggle=\"modal\" href=\"#financial-modal\">MTN<\/a>) today reported certain ski season metrics for the comparative periods from the beginning of the ski season through <span class=\"xn-chron\">April 16, 2023<\/span>, and for the prior year period through <span class=\"xn-chron\">April 17, 2022<\/span>. The reported ski season metrics are for the Company&#8217;s North American destination mountain resorts and regional ski areas, including the results of Seven Springs, Hidden Valley and <span class=\"xn-person\">Laurel Mountain<\/span> in both periods and excluding the results of the Australian ski areas and Andermatt-Sedrun in both periods. The data mentioned in this release is interim period data and is subject to fiscal quarter end review and adjustments.<\/p>\n<ul type=\"disc\">\n<li>Season-to-date total skier visits were up 6.1% compared to the prior year season-to-date period.<\/li>\n<li>Season-to-date total lift ticket revenue, including an allocated portion of season pass revenue for each applicable period, was up 4.0% compared to the prior year season-to-date period.<\/li>\n<li>Season-to-date ski school revenue was up 26.4% and dining revenue was up 35.3% compared to the prior year season-to-date period. Retail\/rental revenue for North American resort and ski area store locations was up 21.8% compared to the prior year season-to-date period.<\/li>\n<\/ul>\n<p>Commenting on the ski season to date, <span class=\"xn-person\">Kirsten Lynch<\/span>, Chief Executive Officer, said, &#8220;We are pleased with our overall results as the 2022\/2023 North American ski season nears completion, with strong growth in visitation and spending compared to the prior year. Our ancillary businesses, including ski school, dining, and retail\/rental, experienced strong growth compared to the prior year period, when those businesses were impacted by capacity constraints driven by staffing, and in the case of dining, by operational restrictions associated with COVID-19. The return to normal staffing levels enabled our mountain resorts to deliver a strong guest experience resulting in a significant improvement in guest satisfaction scores, which have exceeded pre-COVID levels at our destination resorts. The results throughout the 2022\/2023 North American ski season highlight the stability created from our advance commitment strategy, as the Company faced significant weather-related challenges this winter season from the travel disruptions over the peak holiday period, abnormal weather variability across our resorts in the East and significant storm related disruptions at our Tahoe resorts, as discussed in our March earnings release.<\/p>\n<p>The results in March and April improved as expected, with strong demand from local and destination guests driving visitation above prior year record levels. In addition, favorable conditions enabled the Company to extend the ski season at resorts across <span class=\"xn-location\">Utah<\/span>, Tahoe, and the Northeast. While some of our Eastern U.S. resorts in the Midwest and Mid-Atlantic closed earlier than originally intended due to unseasonably warm weather, our resorts in the Northeastern U.S. experienced improved conditions and visitation to finish the season.&#8221;<\/p>\n<p>Regarding the outlook for fiscal 2023, Lynch said, &#8220;The strong finish to the season produced results that were in line with the Resort Reported EBITDA guidance we issued on <span class=\"xn-chron\">March 9, 2023<\/span>. Our strong season pass sales results, prior to the start of this season, significantly mitigated the negative impacts from weather and peak holiday travel disruptions, highlighting the stability created by our advance commitment strategy.&#8221;<\/p>\n<p>Commenting on spring season pass sales, Lynch continued, &#8220;Our attention is already turning to the 2023\/2024 season with spring pass sales underway. Guests continue to be attracted to the network of resorts available on our pass, the pass options and compelling value. To date, we have seen solid growth in pass product sales in both local markets and destination markets, particularly in the Northeast. We will be providing additional details on our spring pass sales in our third quarter earnings release in <span class=\"xn-chron\">June 2023<\/span>.&#8221;<\/p>\n<p><b><u>Basis of Presentation<\/u><\/b><\/p>\n<p>The reported ski season metrics include growth for season pass revenue based on estimated fiscal 2023 North American season pass revenue compared to fiscal 2022 North American season pass revenue. The metrics include all North American destination mountain resorts and regional ski areas, including Seven Springs, Hidden Valley and <span class=\"xn-person\">Laurel Mountain<\/span> as if they were owned in both periods, and are adjusted to eliminate the impact of foreign currency by applying current period exchange rates to the prior period for Whistler Blackcomb&#8217;s results. <span>&#8220;Eastern&#8221; U.S. resorts collectively refers to the 26 Midwest, Mid-Atlantic and Northeast resorts.<\/span> <\/p>\n<p><b><u>About Vail Resorts, Inc. (NYSE: <a rel=\"nofollow noopener\" target=\"_blank\" class=\"ticket-symbol\" data-toggle=\"modal\" href=\"#financial-modal\">MTN<\/a>)<\/u><\/b><\/p>\n<p>Vail Resorts is a network of the best destination and close-to-home ski resorts in the world including Vail Mountain, <span class=\"xn-location\">Breckenridge<\/span>, Park City Mountain, Whistler Blackcomb, Stowe, and 32 additional resorts across <span class=\"xn-location\">North America<\/span>; Andermatt-Sedrun in <span class=\"xn-location\">Switzerland<\/span>; and Perisher, Hotham, and Falls Creek in <span class=\"xn-location\">Australia<\/span>. We are passionate about providing an Experience of a Lifetime to our team members and guests, and our EpicPromise is to reach a zero net operating footprint by 2030, support our employees and communities, and broaden engagement in our sport. Our company owns and\/or manages a collection of elegant hotels under the RockResorts brand, a portfolio of vacation rentals, condominiums and branded hotels located in close proximity to our mountain destinations, as well as the Grand Teton Lodge Company in <span class=\"xn-location\">Jackson Hole, Wyo.<\/span> Vail Resorts Retail operates more than 250 retail and rental locations across <span class=\"xn-location\">North America<\/span>. Learn more about our company at <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.VailResorts.com\" data-wpel-link=\"external\">www.VailResorts.com<\/a>, or discover our resorts and pass options at <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.EpicPass.com\" data-wpel-link=\"external\">www.EpicPass.com<\/a>.<\/p>\n<p><b><u>Forward-Looking Statements<\/u><\/b><\/p>\n<p>Certain statements discussed in this press release other than statements of historical information are forward-looking statements within the meaning of the federal securities laws, including the statements regarding expected fiscal 2023 performance (including the assumptions related thereto) and, our operations; sales patterns and expectations related to our season pass products; our expectations regarding visitation for the 2022\/2023 ski season; and our expectations regarding our ancillary lines of business. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof. All forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from those projected. Such risks and uncertainties include but are not limited to the economy generally and our business and results of operations, including the ultimate amount of refunds that we would be required to refund to our pass product holders for qualifying circumstances under our Epic Coverage program; prolonged weakness in general economic conditions, including adverse effects on the overall travel and leisure related industries; the COVID-19 pandemic, and its impact on the travel and leisure industry generally, and our financial condition and operations; unfavorable weather conditions or the impact of natural disasters; the willingness of our guests to travel due to terrorism, the uncertainty of military conflicts or outbreaks of contagious diseases (such as the COVID-19 pandemic), and the cost and availability of travel options and changing consumer preferences or willingness to travel; risks related to interruptions or disruptions of our information technology systems, data security or cyberattacks; risks related to our reliance on information technology, including our failure to maintain the integrity of our customer or employee data and our ability to adapt to technological developments or industry trends; the seasonality of our business combined with adverse events that occur during our peak operating periods; competition in our mountain and lodging businesses or with other recreational and leisure activities; risks related to the high fixed cost structure of our business; our ability to fund resort capital expenditures; risks related to a disruption in our water supply that would impact our snowmaking capabilities and operations; our reliance on government permits or approvals for our use of public land or to make operational and capital improvements; risks related to federal, state, local and foreign government laws, rules and regulations; risks related to changes in security and privacy laws and regulations which could increase our operating costs and adversely affect our ability to market our products, properties and services effectively; potential failure to adapt to technological developments or industry trends regarding information technology; risks related to our workforce, including increased labor costs; loss of key personnel and our ability to hire and retain a sufficient seasonal workforce; a deterioration in the quality or reputation of our brands, including our ability to protect our intellectual property and the risk of accidents at our mountain resorts; our ability to successfully integrate acquired businesses, including their integration into our internal controls and infrastructure; our ability to successfully navigate new markets, including <span class=\"xn-location\">Europe<\/span>; or that acquired businesses may fail to perform in accordance with expectations, including the Seven Springs Resorts and Andermatt-Sedrun; risks associated with the effects of high or prolonged inflation; risks associated with international operations; fluctuations in foreign currency exchange rates where the Company has foreign currency exposure, primarily the Canadian and Australian dollars and the Swiss franc, as compared to the U.S. dollar; changes in tax laws, regulations, interpretations, or adverse determinations by taxing authorities; risks related to our indebtedness and our ability to satisfy our debt service requirements under our outstanding debt including our unsecured senior notes, which could reduce our ability to use our cash flow to fund our operations, capital expenditures, future business opportunities and other purposes; a materially adverse change in our financial condition; adverse consequences of current or future litigation and legal claims; changes in accounting judgments and estimates, accounting principles, policies or guidelines; and other risks detailed in the Company&#8217;s filings with the Securities and Exchange Commission, including the &#8220;Risk Factors&#8221; section of the Company&#8217;s Annual Report on Form 10-K for the fiscal year ended <span class=\"xn-chron\">July 31, 2022<\/span>, which was filed on <span class=\"xn-chron\">September 28, 2022<\/span>.<\/p>\n<p>All forward-looking statements attributable to us or any persons acting on our behalf are expressly qualified in their entirety by these cautionary statements. All guidance and forward-looking statements in this press release are made as of the date hereof and we do not undertake any obligation to update any forecast or forward-looking statements whether as a result of new information, future events or otherwise, except as may be required by law.<\/p>\n<p>SOURCE Vail Resorts, Inc.<\/p>\n<p><img decoding=\"async\" alt=\"\" src=\"https:\/\/rt.prnewswire.com\/rt.gif?NewsItemId=LA77210&amp;Transmission_Id=202304210800PR_NEWS_USPR_____LA77210&amp;DateId=20230421\" style=\"border:0px; width:1px; height:1px;\">\n<\/div>\n<\/div>\n<p>Originally published at <a href=\"https:\/\/www.prnewswire.com\/news-releases\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023-301803766.html\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">https:\/\/www.prnewswire.com\/news-releases\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023-301803766.html<\/a><br \/>\n<font size=\"-1\"><em>Images courtesy of <a href=\"https:\/\/pixabay.com\" target=\"_blank\" rel=\"noopener nofollow external noreferrer sponsored\" data-wpel-link=\"external\">https:\/\/pixabay.com<\/a><\/em><\/font><\/p>\n","protected":false},"excerpt":{"rendered":"<p>BROOMFIELD, Colo., April 21, 2023 \/PRNewswire\/ &#8212; Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics for the comparative periods from the beginning of the ski season through April 16, 2023, and for the prior year period through April 17, 2022. The reported ski season metrics are for the Company&#8217;s North American destination mountain [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":119469,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[564],"tags":[],"class_list":["post-119468","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-hotels"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"BROOMFIELD, Colo., April 21, 2023 \/PRNewswire\/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics for the comparative periods from the beginning of the ski season through April 16, 2023, and for the prior year period through April 17, 2022. The reported ski season metrics are for the Company&#039;s North American destination mountain\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023 - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"BROOMFIELD, Colo., April 21, 2023 \/PRNewswire\/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics for the comparative periods from the beginning of the ski season through April 16, 2023, and for the prior year period through April 17, 2022. The reported ski season metrics are for the Company&#039;s North American destination mountain\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/cdn.pixabay.com\/photo\/2017\/03\/09\/06\/30\/pool-2128578_960_720.jpg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/cdn.pixabay.com\/photo\/2017\/03\/09\/06\/30\/pool-2128578_960_720.jpg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2023-04-26T20:43:52+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2023-04-26T20:43:52+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023 - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"BROOMFIELD, Colo., April 21, 2023 \/PRNewswire\/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics for the comparative periods from the beginning of the ski season through April 16, 2023, and for the prior year period through April 17, 2022. The reported ski season metrics are for the Company&#039;s North American destination mountain\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/cdn.pixabay.com\/photo\/2017\/03\/09\/06\/30\/pool-2128578_960_720.jpg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/#blogposting\",\"name\":\"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023 - Beauty Ring Magazine\",\"headline\":\"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/cdn.pixabay.com\\\/photo\\\/2017\\\/03\\\/09\\\/06\\\/30\\\/pool-2128578_960_720.jpg\",\"caption\":\"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023\"},\"datePublished\":\"2023-04-26T16:43:52-04:00\",\"dateModified\":\"2023-04-26T16:43:52-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/#webpage\"},\"articleSection\":\"Hotels and Resorts\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/hotels\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/hotels\\\/#listItem\",\"position\":2,\"name\":\"Hotels and Resorts\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/hotels\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/#listItem\",\"position\":3,\"name\":\"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/hotels\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/\",\"name\":\"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023 - Beauty Ring Magazine\",\"description\":\"BROOMFIELD, Colo., April 21, 2023 \\\/PRNewswire\\\/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics for the comparative periods from the beginning of the ski season through April 16, 2023, and for the prior year period through April 17, 2022. The reported ski season metrics are for the Company's North American destination mountain\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/cdn.pixabay.com\\\/photo\\\/2017\\\/03\\\/09\\\/06\\\/30\\\/pool-2128578_960_720.jpg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/#mainImage\",\"caption\":\"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\\\/#mainImage\"},\"datePublished\":\"2023-04-26T16:43:52-04:00\",\"dateModified\":\"2023-04-26T16:43:52-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023 - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023 - Beauty Ring Magazine","description":"BROOMFIELD, Colo., April 21, 2023 \/PRNewswire\/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics for the comparative periods from the beginning of the ski season through April 16, 2023, and for the prior year period through April 17, 2022. The reported ski season metrics are for the Company's North American destination mountain","canonical_url":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023 - Beauty Ring Magazine","og:description":"BROOMFIELD, Colo., April 21, 2023 \/PRNewswire\/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics for the comparative periods from the beginning of the ski season through April 16, 2023, and for the prior year period through April 17, 2022. The reported ski season metrics are for the Company's North American destination mountain","og:url":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/","og:image":"https:\/\/cdn.pixabay.com\/photo\/2017\/03\/09\/06\/30\/pool-2128578_960_720.jpg","og:image:secure_url":"https:\/\/cdn.pixabay.com\/photo\/2017\/03\/09\/06\/30\/pool-2128578_960_720.jpg","article:published_time":"2023-04-26T20:43:52+00:00","article:modified_time":"2023-04-26T20:43:52+00:00","twitter:card":"summary_large_image","twitter:title":"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023 - Beauty Ring Magazine","twitter:description":"BROOMFIELD, Colo., April 21, 2023 \/PRNewswire\/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics for the comparative periods from the beginning of the ski season through April 16, 2023, and for the prior year period through April 17, 2022. The reported ski season metrics are for the Company's North American destination mountain","twitter:image":"https:\/\/cdn.pixabay.com\/photo\/2017\/03\/09\/06\/30\/pool-2128578_960_720.jpg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/#blogposting","name":"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023 - Beauty Ring Magazine","headline":"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/cdn.pixabay.com\/photo\/2017\/03\/09\/06\/30\/pool-2128578_960_720.jpg","caption":"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023"},"datePublished":"2023-04-26T16:43:52-04:00","dateModified":"2023-04-26T16:43:52-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/#webpage"},"articleSection":"Hotels and Resorts"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/hotels\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/hotels\/#listItem","position":2,"name":"Hotels and Resorts","item":"https:\/\/beautyring.info\/category\/hotels\/","nextItem":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/#listItem","position":3,"name":"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023","previousItem":"https:\/\/beautyring.info\/category\/hotels\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/#webpage","url":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/","name":"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023 - Beauty Ring Magazine","description":"BROOMFIELD, Colo., April 21, 2023 \/PRNewswire\/ -- Vail Resorts, Inc. (NYSE: MTN) today reported certain ski season metrics for the comparative periods from the beginning of the ski season through April 16, 2023, and for the prior year period through April 17, 2022. The reported ski season metrics are for the Company's North American destination mountain","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/cdn.pixabay.com\/photo\/2017\/03\/09\/06\/30\/pool-2128578_960_720.jpg","@id":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/#mainImage","caption":"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/#mainImage"},"datePublished":"2023-04-26T16:43:52-04:00","dateModified":"2023-04-26T16:43:52-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"119468","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-04-26 20:43:53","updated":"2023-04-26 20:59:09"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/hotels\/\" title=\"Hotels and Resorts\">Hotels and Resorts<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tVail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Hotels and Resorts","link":"https:\/\/beautyring.info\/category\/hotels\/"},{"label":"Vail Resorts Reports Certain Ski Season Metrics for the Season-to-Date Period Ended April 16, 2023","link":"https:\/\/beautyring.info\/hotels\/vail-resorts-reports-certain-ski-season-metrics-for-the-season-to-date-period-ended-april-16-2023\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/119468"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=119468"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/119468\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/119469"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=119468"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=119468"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=119468"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}