{"id":120712,"date":"2023-05-11T15:02:58","date_gmt":"2023-05-11T19:02:58","guid":{"rendered":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/"},"modified":"2023-05-11T15:02:58","modified_gmt":"2023-05-11T19:02:58","slug":"breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle","status":"publish","type":"post","link":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/","title":{"rendered":"Breast Reconstruction with Implants: Is it better to go above or under the muscle?"},"content":{"rendered":"<p><\/p>\n<div>\n<div class=\"pr_images_column\">\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/298738\/dr-constance-chen.jpeg#2112x3168\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/298738\/dr-constance-chen.jpeg\" width=\"200\" height=\"300\" style=\"display:none\"\/><\/a><\/p>\n<p>Dr. Constance Chen<\/p>\n<\/div>\n<\/div>\n<p style=\"margin-bottom:1em;font-size:115%;\"><i>Breast Reconstruction Specialist Dr. Constance M Chen on  advances in implant-based breast reconstruction &amp; the benefits of prepectoral breast implant placement<\/i><\/p>\n<div class=\"pr_quote\" style=\"clear:left;float:left;margin:20px 10px 20px 0px;max-width:300px;padding: 25px 10px 10px 25px; font-size: 1.1em; background: transparent url('\/\/www.einpresswire.com\/images\/quote_136.png') no-repeat left top;\"><b>To address problems caused by breast implants under the pectoralis muscle, recent innovations in implant-based breast reconstruction place breast implants over the pectoralis muscle.”<\/b><\/p>\n<p>— Dr. Constance M Chen<\/p>\n<\/div>\n<p>STAMFORD, CT, UNITED STATES, May 9, 2023\/<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.einpresswire.com\/\" dir=\"auto\" data-wpel-link=\"external\">EINPresswire.com<\/a>\/ &#8212; According to the American Society of Plastic Surgeons, 81% of women in the United States who undergo <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/constancechenmd.com\/about-breast-reconstruction\" data-wpel-link=\"external\">breast reconstruction<\/a> after mastectomy use <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/constancechenmd.com\/breast-implants\" data-wpel-link=\"external\">breast implants<\/a>. As opposed to natural tissue breast reconstruction, implant-based breast reconstruction does not involve surgery on any other part of the body outside of the breasts. Patients do not have to worry about scars elsewhere on the body or additional healing and drains. In addition, the actual operation is shorter and more straightforward and does not require complex microsurgical skills. Thus, implant-based breast reconstruction is an easier surgery for both the patient and the surgeon.<\/p>\n<p>One common problem with implant-based breast reconstruction, however, is that women often experience chronic pain and tightness after surgery. Usually, this is caused by breast implants placed under the pectoralis muscle &#8211; known as subpectoral breast implant placement. Since the pectoralis muscle lies flat against the chest wall, the muscle is routinely cut at its attachment to the sternum so that it can be lifted to make room for the tissue expander or breast implant. Despite this, the breast implant is a tight fit because there is no anatomical space for it under the pectoralis muscle. Additionally, when the pectoralis muscle is flexed, it pushes the implant down and out &#8211; both deforming the implant and pushing the breast implant into the armpits. Over time, the breast implants may move farther apart creating widened breasts. <\/p>\n<p>To address problems caused by breast implants under the pectoralis muscle, recent innovations in implant-based breast reconstruction place breast implants over the pectoralis muscle &#8211; known as prepectoral breast implant placement. In the human body, breast tissue is located above the pectoralis muscle, so placing the implant where the breast tissue was located prior to mastectomy is anatomically correct. No muscle needs to be divided, because the implant is replacing the breast tissue in the location where it belongs. Not only is placement of breast implants above the pectoralis muscle anatomically correct, however, but prepectoral breast implants are also significantly more comfortable for the patient. In fact, when patients who previously had subpectoral breast implants remove and replace their implants with prepectoral breast implants they are consistently amazed by how much more comfortable their prepectoral breast implants feel. Many patients describe feeling like they can finally “breathe” again as if a tight band around their chest was removed.<\/p>\n<p>If prepectoral breast implants are anatomically correct and more comfortable for the patient, the question may be why anyone ever had the idea to place subpectoral breast implants in the first place? In fact, breast implants were traditionally placed under the pectoralis muscle for both cosmetic and reconstructive patients, and most plastic surgeons still place breast implants under the pectoralis muscle &#8211; especially for breast reconstruction. The reasons given for subpectoral breast implants vary from the belief that it may allow the breast implants to appear more natural to reducing hard capsular contracture due to the massaging action of the pectoralis muscle to reducing rippling. The reality is that subpectoral breast implants do not necessarily appear more natural, nor do they eliminate capsular contracture or rippling. Given how common hard and painful capsular contracture and rippling is in subpectoral breast implants, it is not even clear that subpectoral breast implants offer any advantage in reducing the frequency of those problems over prepectoral breast implants. <\/p>\n<p>In breast reconstruction patients, however, there is a good reason for why subpectoral breast implants have been favored and considered standard of care. After mastectomy, breast skin is often very thin. In addition, many patients need to undergo radiation treatment. Finally, most patients still undergo traditional mastectomies that resect a large portion of breast skin and leave a straight line scar across the chest wall. The thinness of breast skin after aggressive mastectomies, radiation treatment that further damages breast skin, and the tightness resulting from missing breast skin when the nipple is not preserved can all combine to put a patient at risk of implant extrusion if the breast implant is placed above the muscle. Implant extrusion occurs when the breast implant erodes through the breast skin to become exposed. Placing a breast implant under the pectoralis muscle puts an extra layer of tissue between the breast implant, which is a foreign object, and the outside world so that if there is erosion or opening of the breast skin at the scar then the implant is still covered by pectoralis muscle and not exposed to the outside world.<\/p>\n<p>Despite good reasons to place implants under the pectoralis muscle, however, it is still possible for plastic surgeons to safely place breast implants above the pectoralis muscle even for breast reconstruction patients. The best way is to work with an advanced breast surgeon who preserves the breast skin and nipple without compromising oncologic safety. During the mastectomy, skillful breast surgeons can remove all of the breast tissue without compromising the blood supply to the skin. By preserving the subdermal plexus, which contains the small capillaries and nerves of the breast skin, the breast surgeon can also preserve breast skin sensation. In addition, a well-trained breast surgeon can perform a nipple-sparing mastectomy that preserves all of the breast skin envelope. Not only does a nipple-sparing mastectomy set up a patient for the best possible reconstructive outcome after mastectomy, but by keeping all of the breast skin there is no skin deficiency to cause tightness and a deformed reconstructive breast shape. The problem is that not all breast surgeons are up to date on the most state-of-the-art techniques, and it may be challenging to find innovative breast surgeons in some parts of the country.<\/p>\n<p>If a patient has already undergone an aggressive mastectomy with resulting thin deficient skin and her nipple has been resected in a traditional non-nipple-sparing mastectomy, and even if she has undergone radiation treatment or will need to undergo radiation treatment, an innovative plastic surgeon will still be able to find safe ways to place breast implants above the pectoralis muscle. In an immediate breast reconstruction in which the mastectomy occurs at the same surgery as the breast reconstruction, an unexpanded tissue expander can be placed above the muscle, and then the tissue expander can be expanded after surgery in the office to allow the thin and stretched skin to adjust gradually. If a patient already has a subpectoral breast implant, then a prepectoral breast implant can usually be placed immediately after removing the subpectoral breast implant because the skin has already been expanded. In addition, many plastic surgeons who place prepectoral breast implants will use acellular dermal matrix (ADM) to add an extra layer of protection over the breast implant for the same reason the pectoralis muscle is used except there is no damage to the body. ADM is harvested from the dermal layers of human skin, stripped of reactive cell components, while retaining the strength and flexibility of skin. The ADM can not only provide an extra layer of soft tissue over the implant to protect it, but it also serves to soften the edges of the implant to create a more natural appearance.<\/p>\n<p>At the end of the day, prepectoral breast implants offer significant advantages to subpectoral breast implants including exponentially improved comfort for the patient. Since prepectoral breast implants are anatomically correct, they are much less painful than subpectoral breast implants and prepectoral breast implants can also result in a more natural appearance. For breast reconstruction patients, a solid foundation for prepectoral breast implants begins with finding a breast surgeon who is capable of performing a good nipple-sparing mastectomy. Even if that is not possible and\/or if radiation treatment is involved, it is still possible to undergo prepectoral breast implant placement with an innovative plastic surgeon. For example, patients who suffer from chronic pain due to their subpectoral breast implants can usually still have them exchanged for prepectoral breast implants to alleviate their discomfort. For the overwhelming majority of women who choose to undergo breast reconstruction with breast implants, prepectoral breast implants will optimize their comfort and overall outcome so they can enjoy a long and healthy life.<\/p>\n<p><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/constancechenmd.com\/meet\" data-wpel-link=\"external\">Constance M Chen<\/a>, MD, is a board-certified plastic surgeon with a special expertise in the use of innovative natural techniques to optimize medical and cosmetic outcomes for women undergoing breast and body restoration. She is Clinical Assistant Professor of Surgery (Plastic Surgery) at Weill Cornell Medical College and Clinical Assistant Professor of Surgery (Plastic Surgery) at Tulane University School of Medicine. <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.constancechenmd.com\" data-wpel-link=\"external\">www.constancechenmd.com<\/a><\/p>\n<p>Contact: <br \/>&#13;<br \/>\n<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.mcprpublicrelations.com\" data-wpel-link=\"external\">www.mcprpublicrelations.com<\/a><\/p>\n<p class=\"contact\" dir=\"auto\" style=\"margin: 1em 0;\">Melissa Chefec<br \/>MCPR, LLC<br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/article\/632519972\/tel:+1 203-968-6625\" data-wpel-link=\"external\">+1 203-968-6625<\/a><br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/article\/632519972\/mailto:mchefec@gmail.com\" data-wpel-link=\"external\">mchefec@gmail.com<\/a><\/p>\n<p>    <img decoding=\"async\" alt=\"\" class=\"prtr\" src=\"https:\/\/www.einpresswire.com\/tracking\/article.gif?t=2&amp;a=DgCdP-OYyYCWP8Uy&amp;i=akWTtSZOi21hyjZX\"\/><\/p>\n<div class=\"article-footer\">\n<p class=\"text-center\">You just read:<\/p>\n<div class=\"share-vertical-bottom\">\n<div class=\"fleft pull-left\">\n<p>News Provided By<\/p>\n<p>\n      <span>MCPR, LLC<\/span>\n    <\/p>\n<p>\n      May 09, 2023, 13:15 GMT\n    <\/p>\n<\/p><\/div>\n<\/div>\n<p>      <input readonly=\"readonly\" type=\"text\" value=\"https:\/\/www.einpresswire.com\/article\/632519972\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\"\/><\/p>\n<p>\n        <br \/>EIN Presswire&#8217;s priority is source transparency. We do not allow opaque clients, and our editors try to be careful about weeding out false and misleading content.<br \/>\nAs a user, if you see something we have missed, please do bring it to our attention. Your help is welcome. EIN Presswire, Everyone&#8217;s Internet News Presswire,<br \/>\ntries to define some of the boundaries that are reasonable in today&#8217;s world. Please see our<br \/>\n<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/editorial-guidelines\" data-wpel-link=\"external\">Editorial Guidelines<\/a><br \/>\nfor more information.\n      <\/p>\n<\/p><\/div>\n<\/p><\/div>\n<p><script>\n  !function(f,b,e,v,n,t,s)\n  {if(f.fbq)return;n=f.fbq=function(){n.callMethod?\n  n.callMethod.apply(n,arguments):n.queue.push(arguments)};\n  if(!f._fbq)f._fbq=n;n.push=n;n.loaded=!0;n.version='2.0';\n  n.queue=[];t=b.createElement(e);t.async=!0;\n  t.src=v;s=b.getElementsByTagName(e)[0];\n  s.parentNode.insertBefore(t,s)}(window, document,'script',\n  'https:\/\/connect.facebook.net\/en_US\/fbevents.js');\n  fbq('init', '251889322717210');\n  fbq('track', 'PageView');\n<\/script><br \/>\n<br \/>Originally published at <a href=\"https:\/\/www.einpresswire.com\/article\/632519972\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">https:\/\/www.einpresswire.com\/article\/632519972\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dr. Constance Chen Breast Reconstruction Specialist Dr. Constance M Chen on advances in implant-based breast reconstruction &amp; the benefits of prepectoral breast implant placement To address problems caused by breast implants under the pectoralis muscle, recent innovations in implant-based breast reconstruction place breast implants over the pectoralis muscle.” — Dr. Constance M Chen STAMFORD, CT, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":120713,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[558],"tags":[],"class_list":["post-120712","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-beauty"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"Dr. Constance Chen Breast Reconstruction Specialist Dr. Constance M Chen on advances in implant-based breast reconstruction &amp; the benefits of prepectoral breast implant placement To address problems caused by breast implants under the pectoralis muscle, recent innovations in implant-based breast reconstruction place breast implants over the pectoralis muscle.”— Dr. Constance M ChenSTAMFORD, CT, UNITED STATES,\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"Breast Reconstruction with Implants: Is it better to go above or under the muscle? - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"Dr. Constance Chen Breast Reconstruction Specialist Dr. Constance M Chen on advances in implant-based breast reconstruction &amp; the benefits of prepectoral breast implant placement To address problems caused by breast implants under the pectoralis muscle, recent innovations in implant-based breast reconstruction place breast implants over the pectoralis muscle.”— Dr. Constance M ChenSTAMFORD, CT, UNITED STATES,\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/img.einpresswire.com\/medium\/298738\/dr-constance-chen.jpeg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/img.einpresswire.com\/medium\/298738\/dr-constance-chen.jpeg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2023-05-11T19:02:58+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2023-05-11T19:02:58+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"Breast Reconstruction with Implants: Is it better to go above or under the muscle? - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"Dr. Constance Chen Breast Reconstruction Specialist Dr. Constance M Chen on advances in implant-based breast reconstruction &amp; the benefits of prepectoral breast implant placement To address problems caused by breast implants under the pectoralis muscle, recent innovations in implant-based breast reconstruction place breast implants over the pectoralis muscle.”— Dr. Constance M ChenSTAMFORD, CT, UNITED STATES,\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/img.einpresswire.com\/medium\/298738\/dr-constance-chen.jpeg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/#blogposting\",\"name\":\"Breast Reconstruction with Implants: Is it better to go above or under the muscle? - Beauty Ring Magazine\",\"headline\":\"Breast Reconstruction with Implants: Is it better to go above or under the muscle?\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/298738\\\/dr-constance-chen.jpeg\",\"caption\":\"Breast Reconstruction with Implants: Is it better to go above or under the muscle?\"},\"datePublished\":\"2023-05-11T15:02:58-04:00\",\"dateModified\":\"2023-05-11T15:02:58-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/#webpage\"},\"articleSection\":\"Beauty\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/beauty\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/beauty\\\/#listItem\",\"position\":2,\"name\":\"Beauty\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/beauty\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/#listItem\",\"position\":3,\"name\":\"Breast Reconstruction with Implants: Is it better to go above or under the muscle?\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/beauty\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/\",\"name\":\"Breast Reconstruction with Implants: Is it better to go above or under the muscle? - Beauty Ring Magazine\",\"description\":\"Dr. Constance Chen Breast Reconstruction Specialist Dr. Constance M Chen on advances in implant-based breast reconstruction & the benefits of prepectoral breast implant placement To address problems caused by breast implants under the pectoralis muscle, recent innovations in implant-based breast reconstruction place breast implants over the pectoralis muscle.\\u201d\\u2014 Dr. Constance M ChenSTAMFORD, CT, UNITED STATES,\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/298738\\\/dr-constance-chen.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/#mainImage\",\"caption\":\"Breast Reconstruction with Implants: Is it better to go above or under the muscle?\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/beauty\\\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\\\/#mainImage\"},\"datePublished\":\"2023-05-11T15:02:58-04:00\",\"dateModified\":\"2023-05-11T15:02:58-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>Breast Reconstruction with Implants: Is it better to go above or under the muscle? - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"Breast Reconstruction with Implants: Is it better to go above or under the muscle? - Beauty Ring Magazine","description":"Dr. Constance Chen Breast Reconstruction Specialist Dr. Constance M Chen on advances in implant-based breast reconstruction & the benefits of prepectoral breast implant placement To address problems caused by breast implants under the pectoralis muscle, recent innovations in implant-based breast reconstruction place breast implants over the pectoralis muscle.”— Dr. Constance M ChenSTAMFORD, CT, UNITED STATES,","canonical_url":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"Breast Reconstruction with Implants: Is it better to go above or under the muscle? - Beauty Ring Magazine","og:description":"Dr. Constance Chen Breast Reconstruction Specialist Dr. Constance M Chen on advances in implant-based breast reconstruction &amp; the benefits of prepectoral breast implant placement To address problems caused by breast implants under the pectoralis muscle, recent innovations in implant-based breast reconstruction place breast implants over the pectoralis muscle.”— Dr. Constance M ChenSTAMFORD, CT, UNITED STATES,","og:url":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/","og:image":"https:\/\/img.einpresswire.com\/medium\/298738\/dr-constance-chen.jpeg","og:image:secure_url":"https:\/\/img.einpresswire.com\/medium\/298738\/dr-constance-chen.jpeg","article:published_time":"2023-05-11T19:02:58+00:00","article:modified_time":"2023-05-11T19:02:58+00:00","twitter:card":"summary_large_image","twitter:title":"Breast Reconstruction with Implants: Is it better to go above or under the muscle? - Beauty Ring Magazine","twitter:description":"Dr. Constance Chen Breast Reconstruction Specialist Dr. Constance M Chen on advances in implant-based breast reconstruction &amp; the benefits of prepectoral breast implant placement To address problems caused by breast implants under the pectoralis muscle, recent innovations in implant-based breast reconstruction place breast implants over the pectoralis muscle.”— Dr. Constance M ChenSTAMFORD, CT, UNITED STATES,","twitter:image":"https:\/\/img.einpresswire.com\/medium\/298738\/dr-constance-chen.jpeg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/#blogposting","name":"Breast Reconstruction with Implants: Is it better to go above or under the muscle? - Beauty Ring Magazine","headline":"Breast Reconstruction with Implants: Is it better to go above or under the muscle?","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/298738\/dr-constance-chen.jpeg","caption":"Breast Reconstruction with Implants: Is it better to go above or under the muscle?"},"datePublished":"2023-05-11T15:02:58-04:00","dateModified":"2023-05-11T15:02:58-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/#webpage"},"articleSection":"Beauty"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/beauty\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/beauty\/#listItem","position":2,"name":"Beauty","item":"https:\/\/beautyring.info\/category\/beauty\/","nextItem":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/#listItem","position":3,"name":"Breast Reconstruction with Implants: Is it better to go above or under the muscle?","previousItem":"https:\/\/beautyring.info\/category\/beauty\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/#webpage","url":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/","name":"Breast Reconstruction with Implants: Is it better to go above or under the muscle? - Beauty Ring Magazine","description":"Dr. Constance Chen Breast Reconstruction Specialist Dr. Constance M Chen on advances in implant-based breast reconstruction & the benefits of prepectoral breast implant placement To address problems caused by breast implants under the pectoralis muscle, recent innovations in implant-based breast reconstruction place breast implants over the pectoralis muscle.”— Dr. Constance M ChenSTAMFORD, CT, UNITED STATES,","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/298738\/dr-constance-chen.jpeg","@id":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/#mainImage","caption":"Breast Reconstruction with Implants: Is it better to go above or under the muscle?"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/#mainImage"},"datePublished":"2023-05-11T15:02:58-04:00","dateModified":"2023-05-11T15:02:58-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"120712","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-05-11 19:02:59","updated":"2023-05-11 19:06:21"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/beauty\/\" title=\"Beauty\">Beauty<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tBreast Reconstruction with Implants: Is it better to go above or under the muscle?\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Beauty","link":"https:\/\/beautyring.info\/category\/beauty\/"},{"label":"Breast Reconstruction with Implants: Is it better to go above or under the muscle?","link":"https:\/\/beautyring.info\/beauty\/breast-reconstruction-with-implants-is-it-better-to-go-above-or-under-the-muscle\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/120712"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=120712"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/120712\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/120713"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=120712"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=120712"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=120712"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}