{"id":134675,"date":"2023-10-22T01:59:30","date_gmt":"2023-10-22T05:59:30","guid":{"rendered":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/"},"modified":"2023-10-22T01:59:30","modified_gmt":"2023-10-22T05:59:30","slug":"2023-world-leader-summit-of-love-and-peace-in-pasadena","status":"publish","type":"post","link":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/","title":{"rendered":"2023 World Leader Summit of Love and Peace in Pasadena"},"content":{"rendered":"<p><\/p>\n<div>\n<div class=\"pr_images_column\">\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/556331\/1013-p1.jpeg#3200x2133\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/556331\/1013-p1.jpeg\" width=\"300\" height=\"199\" style=\"display:none\"\/><\/a><\/p>\n<p>On behalf of California State Assemblyman Phillip Chen, Newton Viengkhou presented a certificate of recognition to Tai Ji Men for making a significant contribution to the community and making a difference in the lives of many.<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/556332\/1013-p2.jpeg#3200x2133\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/556332\/1013-p2.jpeg\" width=\"300\" height=\"199\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Council member Tyron Hampton, on behalf of the Pasadena City Council, California, congratulated Tai Ji Men for its commitment to promoting love and peace, which will benefit the city, and wished its weekend performances a great success.<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/556336\/1013-p3.jpeg#3200x2131\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/556336\/1013-p3.jpeg\" width=\"300\" height=\"199\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Willy Fautré, director of Human Rights Without Frontiers, rang the Bell of World Peace and Love and made a wish for peace. He was presented with the Key to the Heart, symbolizing that the key to a sustainable future lies in the heart.<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/556337\/1013-p4.jpeg#3200x2276\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/556337\/1013-p4.jpeg\" width=\"300\" height=\"213\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Jane Olson, former chair of the Board of Trustees of Human Rights Watch, rang the Bell of World Peace and Love and wished for love and peace to rule the world now and forever.<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/556338\/1013-p5.jpeg#2500x1829\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/556338\/1013-p5.jpeg\" width=\"300\" height=\"219\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>In support of the World Prayer Day (October 16), all VIPs were invited to write down their prayers for the world and hang them on the Conscience Tree, in the hope that everyone will apply their conscience for a better world of love and peace.<\/p>\n<\/div>\n<\/div>\n<p style=\"margin-bottom:1em;font-size:115%;\"><i>Former Heads of State and Nobel Peace Prize Laureates Call for Love and Conscience to Change the World<\/i><\/p>\n<div class=\"pr_quote\" style=\"clear:left;float:left;margin:20px 10px 20px 0px;max-width:300px;padding: 25px 10px 10px 25px; font-size: 1.1em; background: transparent url('\/\/www.einpresswire.com\/images\/quote_136.png') no-repeat left top;\"><b>In the face of the complex and ever-changing external environment, conscience is the key to changing the world for the better.”<\/b><\/p>\n<p>— Dr. Hong, Tao-Tze, president of FOWPAL<\/p>\n<\/div>\n<p>CALIFORNIA, UNITED STATES, October 20, 2023 \/<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/\" dir=\"auto\" data-wpel-link=\"external\">EINPresswire.com<\/a>\/ &#8212; Contacts of Tai Ji Men Qigong Academy<br \/>\nJennifer Hong (408) 896-8985<br \/>\nLily Chen (626)202-5268<br \/>\nEvents@taijimen.org<br \/>\n2023pressrelease@gmail.com<\/p>\n<p>The 2023 World Leader Summit of Love and Peace was held at the Le Méridien Pasadena Arcadia on October 13, 2023, by the Federation of World Peace and Love (FOWPAL), an international organization dedicated to advocating love and peace. At the event, under the theme of &#8220;A Promising Tomorrow with Love and Conscience for Sustainability,” three former heads of state, two Nobel Peace Prize winners, and four additional influential leaders in the fields of education, faith, religion, and human rights delivered speeches, expressing their ideas and expectations for peace.<\/p>\n<p>During the conference, FOWPAL presented cultural performances conveying the message that courage is needed to change the world, and that adherence to goodness requires selflessness. People are encouraged to overcome all difficulties and create new opportunities for world peace with the wisdom of balancing the yin and yang. <\/p>\n<p>Dr. Hong, Tao-Tze calls for a collective awakening of conscience and global solidarity to transform the world<\/p>\n<p>The event organizer, Dr. Hong, Tao-Tze, president of FOWPAL and leader of Tai Ji Men, delivered welcome remarks, saying, &#8220;I thank all of you for joining hands on this journey of love and peace. Through the influence of everyone here in their respective fields and through global cooperation, we will continuously awaken the conscience of people worldwide, forming a protective net of conscience to safeguard Mother Earth.&#8221; <\/p>\n<p>Dr. Hong also stated, “In the face of the complex and ever-changing external environment, conscience is the key to changing the world for the better. Only when everyone acts with love and conscience, tirelessly striving for the well-being of future generations, will there be hope for global sustainable development.”<\/p>\n<p>This event was part of the festivities celebrating the grand opening of the Tai Ji Men Qigong Academy in Pasadena. In honor of this momentous occasion, Newton Viengkhou, on behalf of California State Assemblyman Phillip Chen, presented a certificate of recognition to Tai Ji Men for its dedication to the community. Pasadena Councilmember Tyron Hampton presented a certificate of recognition on behalf of the City Council, commending Tai Ji Men for promoting love and peace.<\/p>\n<p>The Bell of World Peace and Love Brings Hope for Peace<\/p>\n<p>At the summit, a ceremony of ringing the Bell of World Peace and Love was hosted, with two influential leaders ringing the Bell. Willy Fautré, director of Human Rights Without Frontiers, rang the Bell and stated, “My wish goes to the people who have the noble but dangerous mission to teach like Dr. Hong. My wish is that they enjoy special protection.” Jane Olson, former Chair of the Board of Trustees of Human Rights Watch, rang the Bell and wished that “all world citizens recognize and celebrate that they are all one human family, each one deserving of love and respect. May love and peace rule the world now and forever.”<\/p>\n<p>Ivo Josipović, former President of Croatia (2010-2015), reflected on his experiences of conferences, noting that most were filled with somber discussions about impending disasters and pessimistic predictions. However, at this summit and within Dr. Hong’s organization, he found a stark contrast&#8211;smiling faces, friends spreading love, and an atmosphere of optimism. He described it as a &#8220;miracle&#8221; and saw the organization as one of love, peace, and most importantly, optimism, emphasizing the crucial role of optimism in creating a better world.<\/p>\n<p>Former President of Trinidad and Tobago (2013-2018), Anthony Thomas Aquinas Carmona said that “We have crossed the threshold. It’s five minutes to midnight on the doomsday clock, and we owe it to future generations that we must virulently get involved in real terms and be in the palliative business of saving us from ourselves.” “We need to be therefore honest with ourselves. By adhering to the rigor of conscience, the voice of conscience, we can be disciples of right and contender of wrongs,” he added.<\/p>\n<p>Pakalitha Bethuel Mosisili, former Prime Minister of Lesotho (1998-2012 and 2015-2017), spoke on the topic of love and conscience for sustainable development, emphasizing, “By acting with conscience, we can ensure that our actions align with the principles of sustainability and contribute to a better world for all. To achieve a promising tomorrow with love and conscience for sustainability, we must adopt a multi-faceted approach. This includes transitioning to renewable energy sources, reducing waste and pollution, promoting social equity and justice, and fostering innovation and collaboration.”<\/p>\n<p>Follow the call of your conscience <br \/>&#13;<br \/>\nTrue love can do wonders<\/p>\n<p>Abdessattar Ben Moussa, winner of the 2015 Nobel Peace Prize, encouraged everyone to take constructive steps to promote peace, including: 1. Promoting a culture of love and peace to foster peace while strengthening one&#8217;s sense of morality and drive. 2. Cultivating a daily commitment to universal love and equitable peace to infuse positivity. Spreading the culture of love for peace, reinforcing conscience and motivation. 3. Establishing an environment that upholds freedom, democracy, and social justice to safeguard the love for peace. 4. Nurturing the well-being of children and the next generation, imparting the values of love and peace.<\/p>\n<p>Jerry White, a co-recipient of the 1997 Nobel Peace Prize, shared his experience of losing a calf due to a landmine accident. He reflected on the nature of conscience, likening it to a Holy Spirit that resides within all individuals. He pondered the choice between seeking revenge, succumbing to temptation, or embracing one&#8217;s pain and refusing to perpetuate violence. Ultimately, he believed that the best form of justice and healing was preventing others from enduring the same suffering. <\/p>\n<p>Bobby Hunter, retired Harlem Globetrotter and chairman of United Churches, emphasized the vital significance of instilling love and peace in young children. He mentioned the involvement of athletes and ambassadors nationwide who engage with kids, both speaking to them and listening to their perspectives on these values. He suggested that this interaction is a fundamental starting point for supporting youth.<\/p>\n<p>Agorom C. Dike, founder and president of the Caribbean and African Faith-Based Leadership Conference, expressed his appreciation for Dr. Hong&#8217;s unique approach to promoting peace and love. He acknowledged that Dr. Hong&#8217;s perspective has revealed to him a diverse and previously unseen world of individuals from various parts of the globe, emphasizing the interconnectedness of peace, love, and conscience. <\/p>\n<p>Sadguru Brahmeshanand Acharya Swamiji, founder and chairman of International Saguru Foundation, asserted that education is a crucial component in achieving global peace as it equips individuals with the necessary knowledge, skills, and values to interact with the world positively. He also highlighted the significance of cultural education in promoting sustainability. He commended Dr. Hong for setting a notable example of leadership, illustrating how leaders should take a proactive role in guiding others. He likens Dr. Hong to a beacon, standing at the forefront of the world.<\/p>\n<p>Bhai Sahib Satpal Singh Khalsa, ambassador of Sikh Dharma and chairman of Guru Ram Das Sikh Mission of America, emphasized the need for humanity to awaken their conscience and promote tolerance and respect for various religions to coexist harmoniously. He asserted that genuine peace can only be achieved when people awaken their conscience, reduce desire and greed, and cease harming the environment in the pursuit of material gain. He expressed his gratitude towards Dr. Hong and the entire Tai Ji Men team for their altruistic efforts in enhancing the spiritual and physical well-being of modern society.<\/p>\n<p>World Prayer Day: Tree of Conscience Showcasing People’s Well Wishes for the World<\/p>\n<p>As October 16, 2023 marks the second World Prayer Day, the summit featured an activity, inviting all VIPs and attendees to write down their prayers for the world and hang them on the Conscience Tree, with the expectation that the world will practice conscientious actions together to achieve a better world of love and peace.<\/p>\n<p>About FOWPAL<\/p>\n<p>The Federation of World Peace and Love (FOWPAL), established in the United States in 2000 by Dr. Hong, Tao-Tze, has actively spread the idea of love and peace and promoted world peace through various means such as cultural exchanges and solemn ceremonies of ringing the Bell of World Peace and Love. To unite more people sharing the same vision, FOWPAL has held world summits of love and peace and invited leaders from various fields to ring the bell. The consolidated positive energy has inspired more people to work together for world peace for future generations.<\/p>\n<p>FOWPAL members come from 137 countries; presently 524 prominent figures from 137 countries have rung the bell, made their wishes for love and peace, and pledged to work for the world’s sustainable future. Among them are 59 heads of state and government, 9 Nobel Peace Prize Laureates, UN ambassadors and officers, and other visionary leaders.<\/p>\n<p class=\"contact\" dir=\"auto\" style=\"margin: 1em 0;\">JENNY HSIUNG<br \/>Tai Ji Men Qigong Academy <br \/>chsiung@pausd.org<\/p>\n<p class=\"pr_video_title\">Tai Ji Men &#8211; Love of the World (Music Video)<\/p>\n<p class=\"pr_video\" style=\"margin: 20px 0 10px 0;\">\n<div class=\"youtube-embed\" data-video_id=\"djn4WZyJuL4\"><iframe loading=\"lazy\" title=\"Tai Ji Men - Love of the World (Music Video)\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/djn4WZyJuL4?feature=oembed&#038;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe><\/div>\n<\/p>\n<p>    <img decoding=\"async\" alt=\"\" class=\"prtr\" src=\"https:\/\/www.einpresswire.com\/tracking\/article.gif?t=2&amp;a=oX6eG6FOW614lUFv&amp;i=akWTtSZOi21hyjZX\"\/><\/p>\n<div class=\"article-footer\">\n<p class=\"text-center\">You just read:<\/p>\n<div class=\"share-vertical-bottom\">\n<div class=\"fleft pull-left\">\n<p>News Provided By<\/p>\n<p>\n      <span>Tai Ji Men Qigong Academy<\/span>\n    <\/p>\n<p>\n      October 20, 2023, 15:25 GMT\n    <\/p>\n<\/p><\/div>\n<\/div>\n<p>      <input readonly=\"readonly\" type=\"text\" value=\"https:\/\/www.einpresswire.com\/article\/663053585\/2023-world-leader-summit-of-love-and-peace-in-pasadena\"\/><\/p>\n<p>\n        <br \/>EIN Presswire&#8217;s priority is source transparency. We do not allow opaque clients, and our editors try to be careful about weeding out false and misleading content.<br \/>\nAs a user, if you see something we have missed, please do bring it to our attention. Your help is welcome. EIN Presswire, Everyone&#8217;s Internet News Presswire,<br \/>\ntries to define some of the boundaries that are reasonable in today&#8217;s world. Please see our<br \/>\n<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/editorial-guidelines\" data-wpel-link=\"external\">Editorial Guidelines<\/a><br \/>\nfor more information.\n      <\/p>\n<\/p><\/div>\n<\/p><\/div>\n<p>Originally published at <a href=\"https:\/\/www.einpresswire.com\/article\/663053585\/2023-world-leader-summit-of-love-and-peace-in-pasadena\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">https:\/\/www.einpresswire.com\/article\/663053585\/2023-world-leader-summit-of-love-and-peace-in-pasadena<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>On behalf of California State Assemblyman Phillip Chen, Newton Viengkhou presented a certificate of recognition to Tai Ji Men for making a significant contribution to the community and making a difference in the lives of many. Council member Tyron Hampton, on behalf of the Pasadena City Council, California, congratulated Tai Ji Men for its commitment [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":134676,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[553],"tags":[],"class_list":["post-134675","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-books"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"On behalf of California State Assemblyman Phillip Chen, Newton Viengkhou presented a certificate of recognition to Tai Ji Men for making a significant contribution to the community and making a difference in the lives of many. Council member Tyron Hampton, on behalf of the Pasadena City Council, California, congratulated Tai Ji Men for its commitment\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"2023 World Leader Summit of Love and Peace in Pasadena - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"On behalf of California State Assemblyman Phillip Chen, Newton Viengkhou presented a certificate of recognition to Tai Ji Men for making a significant contribution to the community and making a difference in the lives of many. Council member Tyron Hampton, on behalf of the Pasadena City Council, California, congratulated Tai Ji Men for its commitment\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/img.einpresswire.com\/medium\/556331\/1013-p1.jpeg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/img.einpresswire.com\/medium\/556331\/1013-p1.jpeg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2023-10-22T05:59:30+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2023-10-22T05:59:30+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"2023 World Leader Summit of Love and Peace in Pasadena - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"On behalf of California State Assemblyman Phillip Chen, Newton Viengkhou presented a certificate of recognition to Tai Ji Men for making a significant contribution to the community and making a difference in the lives of many. Council member Tyron Hampton, on behalf of the Pasadena City Council, California, congratulated Tai Ji Men for its commitment\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/img.einpresswire.com\/medium\/556331\/1013-p1.jpeg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/#blogposting\",\"name\":\"2023 World Leader Summit of Love and Peace in Pasadena - Beauty Ring Magazine\",\"headline\":\"2023 World Leader Summit of Love and Peace in Pasadena\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/556331\\\/1013-p1.jpeg\",\"caption\":\"2023 World Leader Summit of Love and Peace in Pasadena\"},\"datePublished\":\"2023-10-22T01:59:30-04:00\",\"dateModified\":\"2023-10-22T01:59:30-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/#webpage\"},\"articleSection\":\"Books\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/#listItem\",\"position\":2,\"name\":\"Books\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/#listItem\",\"position\":3,\"name\":\"2023 World Leader Summit of Love and Peace in Pasadena\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/\",\"name\":\"2023 World Leader Summit of Love and Peace in Pasadena - Beauty Ring Magazine\",\"description\":\"On behalf of California State Assemblyman Phillip Chen, Newton Viengkhou presented a certificate of recognition to Tai Ji Men for making a significant contribution to the community and making a difference in the lives of many. Council member Tyron Hampton, on behalf of the Pasadena City Council, California, congratulated Tai Ji Men for its commitment\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/556331\\\/1013-p1.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/#mainImage\",\"caption\":\"2023 World Leader Summit of Love and Peace in Pasadena\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/2023-world-leader-summit-of-love-and-peace-in-pasadena\\\/#mainImage\"},\"datePublished\":\"2023-10-22T01:59:30-04:00\",\"dateModified\":\"2023-10-22T01:59:30-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>2023 World Leader Summit of Love and Peace in Pasadena - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"2023 World Leader Summit of Love and Peace in Pasadena - Beauty Ring Magazine","description":"On behalf of California State Assemblyman Phillip Chen, Newton Viengkhou presented a certificate of recognition to Tai Ji Men for making a significant contribution to the community and making a difference in the lives of many. Council member Tyron Hampton, on behalf of the Pasadena City Council, California, congratulated Tai Ji Men for its commitment","canonical_url":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"2023 World Leader Summit of Love and Peace in Pasadena - Beauty Ring Magazine","og:description":"On behalf of California State Assemblyman Phillip Chen, Newton Viengkhou presented a certificate of recognition to Tai Ji Men for making a significant contribution to the community and making a difference in the lives of many. Council member Tyron Hampton, on behalf of the Pasadena City Council, California, congratulated Tai Ji Men for its commitment","og:url":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/","og:image":"https:\/\/img.einpresswire.com\/medium\/556331\/1013-p1.jpeg","og:image:secure_url":"https:\/\/img.einpresswire.com\/medium\/556331\/1013-p1.jpeg","article:published_time":"2023-10-22T05:59:30+00:00","article:modified_time":"2023-10-22T05:59:30+00:00","twitter:card":"summary_large_image","twitter:title":"2023 World Leader Summit of Love and Peace in Pasadena - Beauty Ring Magazine","twitter:description":"On behalf of California State Assemblyman Phillip Chen, Newton Viengkhou presented a certificate of recognition to Tai Ji Men for making a significant contribution to the community and making a difference in the lives of many. Council member Tyron Hampton, on behalf of the Pasadena City Council, California, congratulated Tai Ji Men for its commitment","twitter:image":"https:\/\/img.einpresswire.com\/medium\/556331\/1013-p1.jpeg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/#blogposting","name":"2023 World Leader Summit of Love and Peace in Pasadena - Beauty Ring Magazine","headline":"2023 World Leader Summit of Love and Peace in Pasadena","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/556331\/1013-p1.jpeg","caption":"2023 World Leader Summit of Love and Peace in Pasadena"},"datePublished":"2023-10-22T01:59:30-04:00","dateModified":"2023-10-22T01:59:30-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/#webpage"},"articleSection":"Books"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/books\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/books\/#listItem","position":2,"name":"Books","item":"https:\/\/beautyring.info\/category\/books\/","nextItem":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/#listItem","position":3,"name":"2023 World Leader Summit of Love and Peace in Pasadena","previousItem":"https:\/\/beautyring.info\/category\/books\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/#webpage","url":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/","name":"2023 World Leader Summit of Love and Peace in Pasadena - Beauty Ring Magazine","description":"On behalf of California State Assemblyman Phillip Chen, Newton Viengkhou presented a certificate of recognition to Tai Ji Men for making a significant contribution to the community and making a difference in the lives of many. Council member Tyron Hampton, on behalf of the Pasadena City Council, California, congratulated Tai Ji Men for its commitment","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/556331\/1013-p1.jpeg","@id":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/#mainImage","caption":"2023 World Leader Summit of Love and Peace in Pasadena"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/#mainImage"},"datePublished":"2023-10-22T01:59:30-04:00","dateModified":"2023-10-22T01:59:30-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"134675","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-10-22 05:59:31","updated":"2023-10-22 06:10:02"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/books\/\" title=\"Books\">Books<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t2023 World Leader Summit of Love and Peace in Pasadena\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Books","link":"https:\/\/beautyring.info\/category\/books\/"},{"label":"2023 World Leader Summit of Love and Peace in Pasadena","link":"https:\/\/beautyring.info\/books\/2023-world-leader-summit-of-love-and-peace-in-pasadena\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/134675"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=134675"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/134675\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/134676"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=134675"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=134675"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=134675"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}