{"id":135503,"date":"2023-11-01T16:11:33","date_gmt":"2023-11-01T20:11:33","guid":{"rendered":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/"},"modified":"2023-11-01T16:11:33","modified_gmt":"2023-11-01T20:11:33","slug":"sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza","status":"publish","type":"post","link":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/","title":{"rendered":"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA"},"content":{"rendered":"<p><\/p>\n<div class=\"row\">\n<div class=\"col-lg-10 col-lg-offset-1\">\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">ALISO VIEJO, Calif.<\/span><\/span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Oct. 26, 2023<\/span><\/span> \/PRNewswire\/ &#8212; Sunstone Hotel Investors, Inc. (the &#8220;Company&#8221; or &#8220;Sunstone&#8221;) (NYSE: <a rel=\"nofollow noopener\" target=\"_blank\" class=\"ticket-symbol\" data-toggle=\"modal\" href=\"#financial-modal\">SHO<\/a>) today announced that it has completed the sale of the 1,060-room Boston Park Plaza (the &#8220;Hotel&#8221;) for a gross sale price of <span class=\"xn-money\">$370 million<\/span>, or approximately <span class=\"xn-money\">$350,000<\/span> per key. The sale price represents a 12.1x multiple on Hotel Adjusted EBITDA<i>re<\/i> and a 7.1% cap rate on Hotel Net Operating Income for the trailing four quarter period ended <span class=\"xn-chron\">June 30, 2023<\/span>. The Company acquired the Hotel in 2013 and successfully executed a business plan to reinvigorate the well-located historic hotel. Over the course of the Company&#8217;s ownership period, the Hotel&#8217;s annual earnings nearly doubled and the Hotel generated cumulative Hotel Adjusted EBITDA<i>re<\/i> of approximately <span class=\"xn-money\">$210 million<\/span>. Based on the timing of the prior renovation, the Company anticipates that the Hotel will require significant additional investment to maintain its competitive position and sustain its current level of earnings. Inclusive of the Company&#8217;s estimate of required near-term capital expenditures, the gross sale price presents a 14.1x multiple on Hotel Adjusted EBITDA<i>re<\/i> and a 6.1% cap rate on Hotel Net Operating Income for the trailing four quarter period ended <span class=\"xn-chron\">June 30, 2023<\/span>. The Company is evaluating opportunities to reinvest the net proceeds from the sale through a tax deferred exchange. If an exchange is not completed, the Company can utilize existing tax attributes to offset the gain resulting from the sale and retain the net proceeds for future investment. The Company will provide additional details regarding the disposition, including the expected impact on the Company&#8217;s fourth quarter operating results, as part of its upcoming quarterly earnings release in early November.<\/p>\n<p><span class=\"xn-person\">Bryan Giglia<\/span>, Chief Executive Officer, stated, &#8220;We are pleased to announce the disposition of Boston Park Plaza. This has been a successful allocation of capital for Sunstone and the sale is consistent with our strategy to actively harvest value and recycle proceeds into new opportunities that will provide superior risk-adjusted returns. Our completed investment in Boston Park Plaza further demonstrates our ability to create value from repositioning and to realize that value through the disposition and ultimately, the redeployment of those proceeds. <span class=\"xn-location\">Boston<\/span> remains a dynamic and attractive lodging market and we will continue to benefit from exposure to the city through our ownership of the Marriott Boston Long Wharf. Consistent with our strategy to actively recycle capital based on our investment lifecycle approach, we are currently evaluating opportunities to reinvest the sales proceeds into assets that will provide our investors with higher growth, superior returns, and greater per-share NAV growth.&#8221;<\/p>\n<p><b>About Sunstone Hotel Investors<\/b><\/p>\n<p>Sunstone Hotel Investors, Inc. is a lodging real estate investment trust (&#8220;REIT&#8221;). Sunstone&#8217;s strategy is to create long-term stakeholder value through the acquisition, active ownership, and disposition of hotels considered to be Long-Term Relevant Real Estate®. For further information, please visit Sunstone&#8217;s website at <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.sunstonehotels.com\" data-wpel-link=\"external\">www.sunstonehotels.com<\/a>. The Company&#8217;s website is provided as a reference only and any information on the website is not incorporated by reference in this release.<\/p>\n<p><b>For Additional Information<\/b><\/p>\n<p><span class=\"xn-person\">Aaron Reyes<\/span><br class=\"dnr\">Chief Financial Officer<br class=\"dnr\">Sunstone Hotel Investors, Inc.<br class=\"dnr\">(949) 382-3018<\/p>\n<p><b>Forward-Looking Statements<\/b><\/p>\n<p>This press release contains forward-looking statements within the meaning of federal securities laws and regulations. These forward-looking statements are identified by their use of terms and phrases such as &#8220;anticipate,&#8221; &#8220;believe,&#8221; &#8220;continue,&#8221; &#8220;could,&#8221; &#8220;estimate,&#8221; &#8220;expect,&#8221; &#8220;intend,&#8221; &#8220;may,&#8221; &#8220;plan,&#8221; &#8220;predict,&#8221; &#8220;project,&#8221; &#8220;should,&#8221; &#8220;will&#8221; and other similar terms and phrases, including opinions, references to assumptions and forecasts of future results. Forward-looking statements are not guarantees of future performance and involve known and unknown risks, uncertainties and other factors that may cause the actual results to differ materially from those anticipated at the time the forward-looking statements are made. These risks include, but are not limited to: we own upper upscale and luxury hotels in an industry that is highly competitive; events beyond our control, including economic slowdowns or recessions, pandemics such as those caused by COVID-19 and its variants, natural disasters, civil unrest and terrorism; rising hotel operating costs, including wages, employee-related benefits, food costs, commodity costs, including those used to renovate or reposition our hotels, property taxes, property and liability insurance and utilities may not be offset by increased room rates; system security risks, data protection breaches, cyber-attacks and systems integration issues, including those impacting the Company&#8217;s suppliers, hotel managers or franchisors; a significant portion of our hotels are geographically concentrated so we may be harmed by economic downturns or natural disasters in these areas of the country; we face possible risks associated with the physical and transitional effects of climate change; uninsured or underinsured losses could harm our financial condition; the operating results of some of our hotels are significantly reliant upon group and transient business generated by large corporate customers, and the loss of such customers for any reason could harm our operating results; the increased use of virtual meetings and other similar technologies could lessen the need for business-related travel, and, therefore, demand for rooms in our hotels may be adversely affected; our hotels have an ongoing need for capital investment and we may incur significant capital expenditures in connection with acquisitions, repositionings and other improvements, some of which are mandated by applicable laws or regulations or agreements with third parties, and the costs of such renovations, repositionings or improvements may exceed our expectations or cause other problems; delays in the acquisition, renovation or repositioning of hotel properties may have adverse effects on our results of operations and returns to our stockholders; accounting for the acquisition of a hotel property or other entity involves assumptions and estimations to determine fair value that could differ materially from the actual results achieved in future periods; volatility in the debt and equity markets may adversely affect our ability to acquire, renovate, refinance or sell our hotels; we may pursue joint venture investments that could be adversely affected by our lack of sole decision-making authority, our reliance on a co-venturer&#8217;s financial condition and disputes between us and our co-venturer; we may be subject to unknown or contingent liabilities related to recently sold or acquired hotels, as well as hotels we may sell or acquire in the future; we may seek to acquire a portfolio of hotels or a company, which could present more risks to our business and financial results than the acquisition of a single hotel; the sale of a hotel or portfolio of hotels is typically subject to contingencies, risks and uncertainties, any of which may cause us to be unsuccessful in completing the disposition; the illiquidity of real estate investments and the lack of alternative uses of hotel properties could significantly limit our ability to respond to adverse changes in the performance of our hotels; we may issue or invest in hotel loans, including subordinated or mezzanine loans, which could involve greater risks of loss than senior loans secured by income-producing real properties; if we make or invest in mortgage loans with the intent of gaining ownership of the hotel secured by or pledged to the loan, our ability to perfect an ownership interest in the hotel is subject to the sponsor&#8217;s willingness to forfeit the property in lieu of the debt; one of our hotels is subject to a ground lease with an unaffiliated party, the termination of which by the lessor for any reason, including due to our default on the lease, could cause us to lose the ability to operate the hotel altogether and may adversely affect our results of operations; because we are a REIT, we depend on third-parties to operate our hotels; we are subject to risks associated with our operators&#8217; employment of hotel personnel; most of our hotels operate under a brand owned by Marriott, Hilton, Hyatt, Four Seasons or Montage. Should any of these brands experience a negative event, or receive negative publicity, our operating results may be harmed; our franchisors and brand managers may adopt new policies or change existing policies which could result in increased costs that could negatively impact our hotels; future adverse litigation judgments or settlements resulting from legal proceedings could have an adverse effect on our financial condition; claims by persons regarding our properties could affect the attractiveness of our hotels or cause us to incur additional expenses; the hotel business is seasonal and seasonal variations in business volume at our hotels will cause quarterly fluctuations in our revenue; changes in the debt and equity markets may adversely affect the value of our hotels; certain of our hotels have in the past become impaired and additional hotels may become impaired in the future; laws and governmental regulations may restrict the ways in which we use our hotel properties and increase the cost of compliance with such regulations. Noncompliance with such regulations could subject us to penalties, loss of value of our properties or civil damages; corporate responsibility, specifically related to <i>ESG <\/i>factors and commitments, may impose additional costs and expose us to new risks that could adversely affect our results of operations, financial condition and cash flows; our franchisors and brand managers may require us to make capital expenditures pursuant to property improvement plans or to comply with brand standards; termination of any of our franchise, management or operating lease agreements could cause us to lose business or lead to a default or acceleration of our obligations under certain of our debt instruments; the growth of alternative reservation channels could adversely affect our business and profitability; the failure of tenants in our hotels to make rent payments under our retail and restaurant leases may adversely affect our results of operations; we rely on our corporate and hotel senior management teams, the loss of whom may cause us to incur costs and harm our business; if we fail to maintain effective internal control over financial reporting and disclosure controls and procedures, we may not be able to accurately report our financial results; we have outstanding debt which may restrict our financial flexibility; certain of our debt is subject to variable interest rates, which can create uncertainty in forecasting our interest expense and may negatively impact our operating results; and other risks and uncertainties associated with the Company&#8217;s business described in its filings with the Securities and Exchange Commission. Although the Company believes the expectations reflected in such forward-looking statements are based upon reasonable assumptions, it can give no assurance that the expectations will be attained or that any deviation will not be material. All forward-looking information provided herein is as of the date of this release, and the Company undertakes no obligation to update any forward-looking statement to conform the statement to actual results or changes in the Company&#8217;s expectations.<\/p>\n<p>This release should be read together with the consolidated financial statements and notes thereto included in our most recent reports on Form 10-K and Form 10-Q. Copies of these reports are available on our website at <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.sunstonehotels.com\" data-wpel-link=\"external\">www.sunstonehotels.com<\/a> and through the SEC&#8217;s Electronic Data Gathering Analysis and Retrieval System (&#8220;EDGAR&#8221;) at <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.sec.gov\" data-wpel-link=\"external\">www.sec.gov<\/a>.<\/p>\n<p><b>Non-GAAP Financial Measures<\/b><\/p>\n<p>In presenting Hotel Adjusted EBITDA<i>re<\/i> and Hotel Net Operating Income, miscellaneous non-hotel items have been excluded. In addition, Hotel Net Operating Income includes a deduction for the hotel&#8217;s contribution to its reserve for capital expenditures. We believe the calculation of these non-GAAP financial measures provides useful information to investors in determining the value of hotel dispositions.<\/p>\n<p>SOURCE Sunstone Hotel Investors, Inc.<\/p>\n<p><img decoding=\"async\" alt src=\"https:\/\/rt.prnewswire.com\/rt.gif?NewsItemId=LA48962&amp;Transmission_Id=202310261610PR_NEWS_USPR_____LA48962&amp;DateId=20231026\" style=\"display:none\">\n<\/div>\n<\/div>\n<p>Originally published at <a href=\"https:\/\/www.prnewswire.com\/news-releases\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza-301969320.html\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">https:\/\/www.prnewswire.com\/news-releases\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza-301969320.html<\/a><br \/>\n<font size=\"-1\"><em>Images courtesy of <a href=\"https:\/\/pixabay.com\" target=\"_blank\" rel=\"noopener nofollow external noreferrer sponsored\" data-wpel-link=\"external\">https:\/\/pixabay.com<\/a><\/em><\/font><\/p>\n","protected":false},"excerpt":{"rendered":"<p>ALISO VIEJO, Calif., Oct. 26, 2023 \/PRNewswire\/ &#8212; Sunstone Hotel Investors, Inc. (the &#8220;Company&#8221; or &#8220;Sunstone&#8221;) (NYSE: SHO) today announced that it has completed the sale of the 1,060-room Boston Park Plaza (the &#8220;Hotel&#8221;) for a gross sale price of $370 million, or approximately $350,000 per key. The sale price represents a 12.1x multiple on [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":135504,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[564],"tags":[],"class_list":["post-135503","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-hotels"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"ALISO VIEJO, Calif., Oct. 26, 2023 \/PRNewswire\/ -- Sunstone Hotel Investors, Inc. (the &quot;Company&quot; or &quot;Sunstone&quot;) (NYSE: SHO) today announced that it has completed the sale of the 1,060-room Boston Park Plaza (the &quot;Hotel&quot;) for a gross sale price of $370 million, or approximately $350,000 per key. The sale price represents a 12.1x multiple on\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"ALISO VIEJO, Calif., Oct. 26, 2023 \/PRNewswire\/ -- Sunstone Hotel Investors, Inc. (the &quot;Company&quot; or &quot;Sunstone&quot;) (NYSE: SHO) today announced that it has completed the sale of the 1,060-room Boston Park Plaza (the &quot;Hotel&quot;) for a gross sale price of $370 million, or approximately $350,000 per key. The sale price represents a 12.1x multiple on\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/cdn.pixabay.com\/photo\/2020\/03\/13\/10\/36\/stairs-4927569_960_720.jpg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/cdn.pixabay.com\/photo\/2020\/03\/13\/10\/36\/stairs-4927569_960_720.jpg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2023-11-01T20:11:33+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2023-11-01T20:11:33+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"ALISO VIEJO, Calif., Oct. 26, 2023 \/PRNewswire\/ -- Sunstone Hotel Investors, Inc. (the &quot;Company&quot; or &quot;Sunstone&quot;) (NYSE: SHO) today announced that it has completed the sale of the 1,060-room Boston Park Plaza (the &quot;Hotel&quot;) for a gross sale price of $370 million, or approximately $350,000 per key. The sale price represents a 12.1x multiple on\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/cdn.pixabay.com\/photo\/2020\/03\/13\/10\/36\/stairs-4927569_960_720.jpg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/#blogposting\",\"name\":\"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA - Beauty Ring Magazine\",\"headline\":\"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/cdn.pixabay.com\\\/photo\\\/2020\\\/03\\\/13\\\/10\\\/36\\\/stairs-4927569_960_720.jpg\",\"caption\":\"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA\"},\"datePublished\":\"2023-11-01T16:11:33-04:00\",\"dateModified\":\"2023-11-01T16:11:33-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/#webpage\"},\"articleSection\":\"Hotels and Resorts\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/hotels\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/hotels\\\/#listItem\",\"position\":2,\"name\":\"Hotels and Resorts\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/hotels\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/#listItem\",\"position\":3,\"name\":\"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/hotels\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/\",\"name\":\"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA - Beauty Ring Magazine\",\"description\":\"ALISO VIEJO, Calif., Oct. 26, 2023 \\\/PRNewswire\\\/ -- Sunstone Hotel Investors, Inc. (the \\\"Company\\\" or \\\"Sunstone\\\") (NYSE: SHO) today announced that it has completed the sale of the 1,060-room Boston Park Plaza (the \\\"Hotel\\\") for a gross sale price of $370 million, or approximately $350,000 per key. The sale price represents a 12.1x multiple on\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/cdn.pixabay.com\\\/photo\\\/2020\\\/03\\\/13\\\/10\\\/36\\\/stairs-4927569_960_720.jpg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/#mainImage\",\"caption\":\"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\\\/#mainImage\"},\"datePublished\":\"2023-11-01T16:11:33-04:00\",\"dateModified\":\"2023-11-01T16:11:33-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA - Beauty Ring Magazine","description":"ALISO VIEJO, Calif., Oct. 26, 2023 \/PRNewswire\/ -- Sunstone Hotel Investors, Inc. (the \"Company\" or \"Sunstone\") (NYSE: SHO) today announced that it has completed the sale of the 1,060-room Boston Park Plaza (the \"Hotel\") for a gross sale price of $370 million, or approximately $350,000 per key. The sale price represents a 12.1x multiple on","canonical_url":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA - Beauty Ring Magazine","og:description":"ALISO VIEJO, Calif., Oct. 26, 2023 \/PRNewswire\/ -- Sunstone Hotel Investors, Inc. (the &quot;Company&quot; or &quot;Sunstone&quot;) (NYSE: SHO) today announced that it has completed the sale of the 1,060-room Boston Park Plaza (the &quot;Hotel&quot;) for a gross sale price of $370 million, or approximately $350,000 per key. The sale price represents a 12.1x multiple on","og:url":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/","og:image":"https:\/\/cdn.pixabay.com\/photo\/2020\/03\/13\/10\/36\/stairs-4927569_960_720.jpg","og:image:secure_url":"https:\/\/cdn.pixabay.com\/photo\/2020\/03\/13\/10\/36\/stairs-4927569_960_720.jpg","article:published_time":"2023-11-01T20:11:33+00:00","article:modified_time":"2023-11-01T20:11:33+00:00","twitter:card":"summary_large_image","twitter:title":"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA - Beauty Ring Magazine","twitter:description":"ALISO VIEJO, Calif., Oct. 26, 2023 \/PRNewswire\/ -- Sunstone Hotel Investors, Inc. (the &quot;Company&quot; or &quot;Sunstone&quot;) (NYSE: SHO) today announced that it has completed the sale of the 1,060-room Boston Park Plaza (the &quot;Hotel&quot;) for a gross sale price of $370 million, or approximately $350,000 per key. The sale price represents a 12.1x multiple on","twitter:image":"https:\/\/cdn.pixabay.com\/photo\/2020\/03\/13\/10\/36\/stairs-4927569_960_720.jpg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/#blogposting","name":"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA - Beauty Ring Magazine","headline":"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/cdn.pixabay.com\/photo\/2020\/03\/13\/10\/36\/stairs-4927569_960_720.jpg","caption":"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA"},"datePublished":"2023-11-01T16:11:33-04:00","dateModified":"2023-11-01T16:11:33-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/#webpage"},"articleSection":"Hotels and Resorts"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/hotels\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/hotels\/#listItem","position":2,"name":"Hotels and Resorts","item":"https:\/\/beautyring.info\/category\/hotels\/","nextItem":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/#listItem","position":3,"name":"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA","previousItem":"https:\/\/beautyring.info\/category\/hotels\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/#webpage","url":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/","name":"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA - Beauty Ring Magazine","description":"ALISO VIEJO, Calif., Oct. 26, 2023 \/PRNewswire\/ -- Sunstone Hotel Investors, Inc. (the \"Company\" or \"Sunstone\") (NYSE: SHO) today announced that it has completed the sale of the 1,060-room Boston Park Plaza (the \"Hotel\") for a gross sale price of $370 million, or approximately $350,000 per key. The sale price represents a 12.1x multiple on","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/cdn.pixabay.com\/photo\/2020\/03\/13\/10\/36\/stairs-4927569_960_720.jpg","@id":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/#mainImage","caption":"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/#mainImage"},"datePublished":"2023-11-01T16:11:33-04:00","dateModified":"2023-11-01T16:11:33-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"135503","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2023-11-01 20:11:34","updated":"2023-11-01 20:18:37"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/hotels\/\" title=\"Hotels and Resorts\">Hotels and Resorts<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tSUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Hotels and Resorts","link":"https:\/\/beautyring.info\/category\/hotels\/"},{"label":"SUNSTONE HOTEL INVESTORS ANNOUNCES THE DISPOSITION OF BOSTON PARK PLAZA","link":"https:\/\/beautyring.info\/hotels\/sunstone-hotel-investors-announces-the-disposition-of-boston-park-plaza\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/135503"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=135503"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/135503\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/135504"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=135503"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=135503"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=135503"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}