{"id":144470,"date":"2024-02-23T09:14:32","date_gmt":"2024-02-23T14:14:32","guid":{"rendered":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/"},"modified":"2024-02-23T09:14:32","modified_gmt":"2024-02-23T14:14:32","slug":"royal-caribbean-group-increases-2024-guidance-on-accelerating-demand","status":"publish","type":"post","link":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/","title":{"rendered":"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND"},"content":{"rendered":"<p><img class=\"img-responsive\" title=\"(PRNewsfoto\/Royal Caribbean Group)\" data-getimg=\"https:\/\/mma.prnewswire.com\/media\/1213007\/RCG_Logo.jpg?w=200\" alt=\"(PRNewsfoto\/Royal Caribbean Group)\" loading=\"lazy\" style=\"display:none\"><\/p>\n<div class=\"row\">\n<div class=\"col-lg-10 col-lg-offset-1\">\n<p class=\"prntac\"><b><i>Since last earnings call, demand and bookings have exceeded expectations <\/i><\/b><\/p>\n<p class=\"prntac\"><b><i>Adjusted EPS in 2024 is now expected to be <span class=\"xn-money\">$9.90<\/span> &#8211; <span class=\"xn-money\">$10<\/span>.10  <\/i><\/b><\/p>\n<p class=\"prntac\"><b><i>The company expects to achieve all Trifecta goals in 2024<\/i><\/b><\/p>\n<p><span class=\"legendSpanClass\"><span class=\"xn-location\">MIAMI<\/span><\/span>, <span class=\"legendSpanClass\"><span class=\"xn-chron\">Feb. 21, 2024<\/span><\/span> \/PRNewswire\/ &#8212; Royal Caribbean Group (NYSE: <a rel=\"nofollow noopener\" target=\"_blank\" class=\"ticket-symbol\" data-toggle=\"modal\" href=\"#financial-modal\">RCL<\/a>) today provided an update on demand and updated its 2024 guidance.<\/p>\n<p>The company continues to be very encouraged about the demand and pricing environment for 2024. Since its most recent update on its Q4 2023 earnings call, the WAVE booking season has exceeded the company&#8217;s initial expectations, with the first 5 weeks of the year resulting in the best WAVE booking weeks in the company&#8217;s history. Bookings have been significantly higher than during the same period last year, with the back half of the year up by more than the front half. For 2024, all four quarters and all key products are booked ahead of the same time last year in both rate and volume. Consumer spending for onboard purchases continue to exceed prior years driven by greater participation at higher prices, indicating quality and healthy future demand.<\/p>\n<p>&#8220;Since our last earnings call, robust demand for our vacation experiences has significantly exceeded our initial expectations,&#8221; said <span class=\"xn-person\">Jason Liberty<\/span>, president and CEO of Royal Caribbean. &#8220;As a result, we are increasing our 2024 guidance on stronger revenue outlook, and we expect to achieve all <b><i>Trifecta<\/i><\/b> goals in 2024. <b><i>Trifecta<\/i><\/b> marks an important milestone as we remain intensely focused on delivering a lifetime of vacations and priceless memories for our guests while delivering exceptional long-term shareholder value.&#8221;<\/p>\n<p>As a result of the strong WAVE season, the company is increasing its 2024 Adjusted EPS guidance by <span class=\"xn-money\">$0.40<\/span> compared to its February guidance. For the full year, Adjusted EPS is now expected to be <span class=\"xn-money\">$9.90<\/span> to <span class=\"xn-money\">$10.10<\/span> driven by an increase in constant currency net yield growth of approximately 100 bps compared to the February guidance. Approximately <span class=\"xn-money\">$0.15<\/span> of the full year increase in adjusted EPS is driven by an improved revenue outlook for the first quarter of 2024. The company now expects to achieve all <b><i>Trifecta<\/i><\/b> goals in 2024.<\/p>\n<p><b><u>About Royal Caribbean Group<br class=\"dnr\"><\/u><\/b>Royal Caribbean Group (NYSE: <a rel=\"nofollow noopener\" target=\"_blank\" class=\"ticket-symbol\" data-toggle=\"modal\" href=\"#financial-modal\">RCL<\/a>) is one of the leading cruise companies in the world with a global fleet of 65 ships traveling to approximately 1,000 destinations around the world. Royal Caribbean Group is the owner and operator of three award winning cruise brands: Royal Caribbean International, Celebrity Cruises, and Silversea Cruises and it is also a 50% owner of a joint venture that operates TUI Cruises and Hapag-Lloyd Cruises. Together, the brands have an additional 8 ships on order as of <span class=\"xn-chron\">December 31, 2023<\/span>. Learn more at <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.royalcaribbeangroup.com\" data-wpel-link=\"external\">www.royalcaribbeangroup.com<\/a> or <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.rclinvestor.com\" data-wpel-link=\"external\">www.rclinvestor.com<\/a>.<\/p>\n<p><b><u>Cautionary Statement Concerning Forward-Looking Statements<br class=\"dnr\"><\/u><\/b>Certain statements in this press release relating to, among other things, our future performance estimates, forecasts and projections constitute forward-looking statements under the Private Securities Litigation Reform Act of 1995. These statements include, but are not limited to: statements regarding financial results for 2024; demand for our brands; and our progress towards achievement of our Trifecta goals. Words such as &#8220;anticipate,&#8221; &#8220;believe,&#8221; &#8220;could,&#8221; &#8220;driving,&#8221; &#8220;estimate,&#8221; &#8220;expect,&#8221; &#8220;goal,&#8221; &#8220;intend,&#8221; &#8220;may,&#8221; &#8220;plan,&#8221; &#8220;project,&#8221; &#8220;seek,&#8221; &#8220;should,&#8221; &#8220;will,&#8221; &#8220;would,&#8221; &#8220;considering,&#8221; and similar expressions are intended to help identify forward-looking statements. Forward-looking statements reflect management&#8217;s current expectations, are based on judgments, are inherently uncertain and are subject to risks, uncertainties and other factors, which could cause our actual results, performance or achievements to differ materially from the future results, performance or achievements expressed or implied in those forward-looking statements. Examples of these risks, uncertainties and other factors include, but are not limited to, the following: the impact of contagious illnesses on economic conditions and the travel industry in general and the financial position and operating results of our Company in particular, such as: governmental and self-imposed travel restrictions and guest cancellations; our ability to obtain sufficient financing, capital or revenues to satisfy liquidity needs, capital expenditures, debt repayments and other financing needs; the impact of the economic and geopolitical environment on key aspects of our business, such as the demand for cruises, passenger spending, and operating costs; incidents or adverse publicity concerning our ships, port facilities, land destinations and\/or passengers or the cruise vacation industry in general; concerns over safety, health and security of guests and crew; further impairments of our goodwill, long-lived assets, equity investments and notes receivable; an inability to source our crew or our provisions and supplies from certain places; an increase in concern about the risk of illness on our ships or when traveling to or from our ships, all of which reduces demand; unavailability of ports of call; growing anti-tourism sentiments and environmental concerns; changes in U.S. foreign travel policy; the uncertainties of conducting business internationally and expanding into new markets and new ventures; our ability to recruit, develop and retain high quality personnel; changes in operating and financing costs; our indebtedness, any additional indebtedness we may incur and restrictions in the agreements governing our indebtedness that limit our flexibility in operating our business; the impact of foreign currency exchange rates, the impact of higher interest rate and food and fuel prices; vacation industry competition and changes in industry capacity and overcapacity; the risks and costs related to cyber security attacks, data breaches, protecting our systems and maintaining integrity and security of our business information, as well as personal data of our guests, employees and others; the impact of new or changing legislation and regulations (including environmental regulations) or governmental orders on our business; pending or threatened litigation, investigations and enforcement actions; the effects of weather, natural disasters and seasonality on our business; the impact of issues at shipyards, including ship delivery delays, ship cancellations or ship construction cost increases; shipyard unavailability; the unavailability or cost of air service; and uncertainties of a foreign legal system as we are not incorporated in <span class=\"xn-location\">the United States<\/span>.<\/p>\n<p>More information about factors that could affect our operating results is included under the caption &#8220;Risk Factors&#8221; in our most recent quarterly report on Form 10-K, as well as our other filings with the SEC, copies of which may be obtained by visiting our Investor Relations website at <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.rclinvestor.com\" data-wpel-link=\"external\">www.rclinvestor.com<\/a> or the SEC&#8217;s website at <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.sec.gov\" data-wpel-link=\"external\">www.sec.gov<\/a>. Undue reliance should not be placed on the forward-looking statements in this release, which are based on information available to us on the date hereof. We undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.<\/p>\n<p><b>Selected Operational and Financial Metrics<\/b><\/p>\n<p><i>Adjusted EBITDA <\/i>is a non-GAAP measure that represents EBITDA (as defined below) excluding certain items that we believe adjusting for is meaningful when assessing our profitability on a comparative basis.<\/p>\n<p><i>Adjusted Earnings (Loss) per Share (&#8220;Adjusted EPS&#8221;) <\/i>is a non-GAAP measure that represents Adjusted Net Income (Loss) attributable to Royal Caribbean Cruises Ltd. (as defined below) divided by weighted average shares outstanding or by diluted weighted average shares outstanding, as applicable. We believe that this non-GAAP measure is meaningful when assessing our performance on a comparative basis.<\/p>\n<p><i>Adjusted Net Income (Loss) attributable to Royal Caribbean Cruises Ltd.<\/i> is a non-GAAP measure that represents net income (loss) less net income attributable to noncontrolling interest, excluding certain items that we believe adjusting for is meaningful when assessing our performance on a comparative basis.<\/p>\n<p><i>Constant Currency<\/i> is a significant measure for our revenues and expenses, which are denominated in currencies other than the U.S. Dollar. Because our reporting currency is the U.S. Dollar, the value of these revenues and expenses in U.S. Dollar will be affected by changes in currency exchange rates. Although such changes in local currency prices are just one of many elements impacting our revenues and expenses, it can be an important element. For this reason, we also monitor our revenues and expenses in &#8220;Constant Currency&#8221; &#8211; i.e., as if the current period&#8217;s currency exchange rates had remained constant with the comparable prior period&#8217;s rates. We do not make predictions about future exchange rates and use current exchange rates for calculations of future periods. It should be emphasized that the use of Constant Currency is primarily used by us for comparing short-term changes and\/or projections. Over the longer term, changes in guest sourcing and shifting the amount of purchases between currencies can significantly change the impact of the purely currency-based fluctuations.<\/p>\n<p><i>EBITDA<\/i> is a non-GAAP measure that represents of Net Income (Loss) attributable to Royal Caribbean Cruises Ltd. excluding (i) interest income; (ii) interest expense, net of interest capitalized; (iii) depreciation and amortization expenses; and (iv) income tax expense. We believe that this non-GAAP measure is meaning when assessing our operating performance on a comparative basis.<\/p>\n<p><i>Invested Capital<\/i> represents the most recent five-quarter average of total debt (i.e., Current portion of long-term debt plus Long-term debt) plus the most recent five-quarter average of Total shareholders&#8217; equity. We use this measure to calculate ROIC (as defined below).<\/p>\n<p><i>Return on Invested Capital (&#8220;ROIC&#8221;)<\/i> represents Adjusted Operating Income (Loss) divided by Invested Capital. We believe ROIC is a meaningful measure because it quantifies how efficiently we generated operating income relative to the capital we have invested in the business. ROIC is also used as a key metric in our long-term incentive compensation program for our executive officers.<\/p>\n<p><i>Adjusted Gross Margin <\/i>represent Gross Margin, adjusted for payroll and related, food, fuel, other operating, and depreciation and amortization expenses. Gross Margin is calculated pursuant to GAAP as total revenues less total cruise operating expenses, and depreciation and amortization.<\/p>\n<p><i>Net Yields<\/i> represent Adjusted Gross Margin per APCD. We utilize Adjusted Gross Margin and Net Yields to manage our business on a day-to-day basis as we believe that they are the most relevant measures of our pricing performance because they reflect the cruise revenues earned by us net of our most significant variable costs, which are commissions, transportation and other expenses, and onboard and other expenses.<\/p>\n<p><i>Trifecta<\/i> refers to the multi-year Adjusted EBITDA per APCD, Adjusted EPS and ROIC goals we publicly announced in <span class=\"xn-chron\">November 2022<\/span> and seeking to achieve by the end of 2025. We designed this program to help us better execute and achieve our business goals by clearly articulating longer-term financial objectives. Under the Trifecta Program, we are targeting Adjusted EBITDA per APCD of at lease <span class=\"xn-money\">$100<\/span>, Adjusted EPS of at least <span class=\"xn-money\">$10<\/span>, and ROIC of 13% or higher by the end of 2025.<\/p>\n<p><b>Adjusted Measures of Financial Performance<\/b><\/p>\n<p>We have not provided in this press release a quantitative reconciliation of the projected non-GAAP financial measures to the most comparable GAAP financial measures because preparation of meaningful U.S. GAAP projections would require unreasonable effort. Due to significant uncertainty, we are unable to predict, without unreasonable effort, the future movement of foreign exchange rates, fuel prices and interest rates inclusive of our related hedging programs. In addition, we are unable to determine the future impact of non-core business related gains and losses which may result from strategic initiatives. These items are uncertain and could be material to our results of operations in accordance with U.S. GAAP. Due to this uncertainty, we do not believe that reconciling information for such projected figures would be meaningful.<\/p>\n<p>SOURCE Royal Caribbean Group<\/p>\n<p><img decoding=\"async\" alt src=\"https:\/\/rt.prnewswire.com\/rt.gif?NewsItemId=FL42252&amp;Transmission_Id=202402211719PR_NEWS_USPR_____FL42252&amp;DateId=20240221\" style=\"border:0px; width:1px; height:1px;\">\n<\/div>\n<\/div>\n<p>Originally published at <a href=\"https:\/\/www.prnewswire.com\/news-releases\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand-302068076.html\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">https:\/\/www.prnewswire.com\/news-releases\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand-302068076.html<\/a><br \/>\n<font size=\"-1\"><em>Images courtesy of <a href=\"https:\/\/pixabay.com\" target=\"_blank\" rel=\"noopener nofollow external noreferrer sponsored\" data-wpel-link=\"external\">https:\/\/pixabay.com<\/a><\/em><\/font><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Since last earnings call, demand and bookings have exceeded expectations  Adjusted EPS in 2024 is now expected to be $9.90 &#8211; $10.10  The company expects to achieve all Trifecta goals in 2024 MIAMI, Feb. 21, 2024 \/PRNewswire\/ &#8212; Royal Caribbean Group (NYSE: RCL) today provided an update on demand and updated its 2024 guidance. The [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":144471,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[564],"tags":[],"class_list":["post-144470","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-hotels"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"Since last earnings call, demand and bookings have exceeded expectations Adjusted EPS in 2024 is now expected to be $9.90 - $10.10 The company expects to achieve all Trifecta goals in 2024 MIAMI, Feb. 21, 2024 \/PRNewswire\/ -- Royal Caribbean Group (NYSE: RCL) today provided an update on demand and updated its 2024 guidance. The\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"Since last earnings call, demand and bookings have exceeded expectations Adjusted EPS in 2024 is now expected to be $9.90 - $10.10 The company expects to achieve all Trifecta goals in 2024 MIAMI, Feb. 21, 2024 \/PRNewswire\/ -- Royal Caribbean Group (NYSE: RCL) today provided an update on demand and updated its 2024 guidance. The\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/cdn.pixabay.com\/photo\/2015\/01\/10\/18\/36\/hotel-595587_960_720.jpg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/cdn.pixabay.com\/photo\/2015\/01\/10\/18\/36\/hotel-595587_960_720.jpg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2024-02-23T14:14:32+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2024-02-23T14:14:32+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"Since last earnings call, demand and bookings have exceeded expectations Adjusted EPS in 2024 is now expected to be $9.90 - $10.10 The company expects to achieve all Trifecta goals in 2024 MIAMI, Feb. 21, 2024 \/PRNewswire\/ -- Royal Caribbean Group (NYSE: RCL) today provided an update on demand and updated its 2024 guidance. The\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/cdn.pixabay.com\/photo\/2015\/01\/10\/18\/36\/hotel-595587_960_720.jpg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/#blogposting\",\"name\":\"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND - Beauty Ring Magazine\",\"headline\":\"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/cdn.pixabay.com\\\/photo\\\/2015\\\/01\\\/10\\\/18\\\/36\\\/hotel-595587_960_720.jpg\",\"caption\":\"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND\"},\"datePublished\":\"2024-02-23T09:14:32-05:00\",\"dateModified\":\"2024-02-23T09:14:32-05:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/#webpage\"},\"articleSection\":\"Hotels and Resorts\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/hotels\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/hotels\\\/#listItem\",\"position\":2,\"name\":\"Hotels and Resorts\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/hotels\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/#listItem\",\"position\":3,\"name\":\"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/hotels\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/\",\"name\":\"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND - Beauty Ring Magazine\",\"description\":\"Since last earnings call, demand and bookings have exceeded expectations Adjusted EPS in 2024 is now expected to be $9.90 - $10.10 The company expects to achieve all Trifecta goals in 2024 MIAMI, Feb. 21, 2024 \\\/PRNewswire\\\/ -- Royal Caribbean Group (NYSE: RCL) today provided an update on demand and updated its 2024 guidance. The\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/cdn.pixabay.com\\\/photo\\\/2015\\\/01\\\/10\\\/18\\\/36\\\/hotel-595587_960_720.jpg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/#mainImage\",\"caption\":\"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/hotels\\\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\\\/#mainImage\"},\"datePublished\":\"2024-02-23T09:14:32-05:00\",\"dateModified\":\"2024-02-23T09:14:32-05:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND - Beauty Ring Magazine","description":"Since last earnings call, demand and bookings have exceeded expectations Adjusted EPS in 2024 is now expected to be $9.90 - $10.10 The company expects to achieve all Trifecta goals in 2024 MIAMI, Feb. 21, 2024 \/PRNewswire\/ -- Royal Caribbean Group (NYSE: RCL) today provided an update on demand and updated its 2024 guidance. The","canonical_url":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND - Beauty Ring Magazine","og:description":"Since last earnings call, demand and bookings have exceeded expectations Adjusted EPS in 2024 is now expected to be $9.90 - $10.10 The company expects to achieve all Trifecta goals in 2024 MIAMI, Feb. 21, 2024 \/PRNewswire\/ -- Royal Caribbean Group (NYSE: RCL) today provided an update on demand and updated its 2024 guidance. The","og:url":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/","og:image":"https:\/\/cdn.pixabay.com\/photo\/2015\/01\/10\/18\/36\/hotel-595587_960_720.jpg","og:image:secure_url":"https:\/\/cdn.pixabay.com\/photo\/2015\/01\/10\/18\/36\/hotel-595587_960_720.jpg","article:published_time":"2024-02-23T14:14:32+00:00","article:modified_time":"2024-02-23T14:14:32+00:00","twitter:card":"summary_large_image","twitter:title":"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND - Beauty Ring Magazine","twitter:description":"Since last earnings call, demand and bookings have exceeded expectations Adjusted EPS in 2024 is now expected to be $9.90 - $10.10 The company expects to achieve all Trifecta goals in 2024 MIAMI, Feb. 21, 2024 \/PRNewswire\/ -- Royal Caribbean Group (NYSE: RCL) today provided an update on demand and updated its 2024 guidance. The","twitter:image":"https:\/\/cdn.pixabay.com\/photo\/2015\/01\/10\/18\/36\/hotel-595587_960_720.jpg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/#blogposting","name":"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND - Beauty Ring Magazine","headline":"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/cdn.pixabay.com\/photo\/2015\/01\/10\/18\/36\/hotel-595587_960_720.jpg","caption":"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND"},"datePublished":"2024-02-23T09:14:32-05:00","dateModified":"2024-02-23T09:14:32-05:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/#webpage"},"articleSection":"Hotels and Resorts"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/hotels\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/hotels\/#listItem","position":2,"name":"Hotels and Resorts","item":"https:\/\/beautyring.info\/category\/hotels\/","nextItem":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/#listItem","position":3,"name":"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND","previousItem":"https:\/\/beautyring.info\/category\/hotels\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/#webpage","url":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/","name":"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND - Beauty Ring Magazine","description":"Since last earnings call, demand and bookings have exceeded expectations Adjusted EPS in 2024 is now expected to be $9.90 - $10.10 The company expects to achieve all Trifecta goals in 2024 MIAMI, Feb. 21, 2024 \/PRNewswire\/ -- Royal Caribbean Group (NYSE: RCL) today provided an update on demand and updated its 2024 guidance. The","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/cdn.pixabay.com\/photo\/2015\/01\/10\/18\/36\/hotel-595587_960_720.jpg","@id":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/#mainImage","caption":"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/#mainImage"},"datePublished":"2024-02-23T09:14:32-05:00","dateModified":"2024-02-23T09:14:32-05:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"144470","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2024-02-23 14:14:33","updated":"2024-02-23 14:24:40"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/hotels\/\" title=\"Hotels and Resorts\">Hotels and Resorts<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Hotels and Resorts","link":"https:\/\/beautyring.info\/category\/hotels\/"},{"label":"ROYAL CARIBBEAN GROUP INCREASES 2024 GUIDANCE ON ACCELERATING DEMAND","link":"https:\/\/beautyring.info\/hotels\/royal-caribbean-group-increases-2024-guidance-on-accelerating-demand\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/144470"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=144470"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/144470\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/144471"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=144470"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=144470"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=144470"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}