{"id":148524,"date":"2024-04-13T17:12:38","date_gmt":"2024-04-13T21:12:38","guid":{"rendered":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/"},"modified":"2024-04-13T17:12:38","modified_gmt":"2024-04-13T21:12:38","slug":"fowpal-hosts-celebration-of-un-designated-international-day-of-conscience","status":"publish","type":"post","link":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/","title":{"rendered":"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience"},"content":{"rendered":"<p><\/p>\n<div>\n<div class=\"pr_images_column\">\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/651796\/20240405-hao-6998.jpeg#3947x2631\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/651796\/20240405-hao-6998.jpeg\" width=\"300\" height=\"199\" style=\"display:none\"\/><\/a><\/p>\n<p>On April 5th, the Federation of World Peace and Love (FOWPAL) hosts the World Leader Summit of Love and Peace to celebrate the 5th International Day of Conscience.<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/651913\/20240405-hao-6931.jpeg#3984x2656\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/651913\/20240405-hao-6931.jpeg\" width=\"300\" height=\"200\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Deputy Prime Minister of Kosovo Emilija Redzepi, left, receives the FOWPAL Peace Bell Award from Dr. Hong, Tao-Tze, president of FOWPAL.<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/651798\/20240405-hao-6465-copy.jpeg#2953x2327\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/651798\/20240405-hao-6465-copy.jpeg\" width=\"300\" height=\"236\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Former Prime Minister of Lesotho Pakalitha Bethuel Mosisili delivers remarks, stating that conscience is a moral compass, and that hope is the driving force behind every act of courage, every resilient moment, and every triumph over despair.<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/651799\/20240405-hao-6385.jpeg#3108x1872\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/651799\/20240405-hao-6385.jpeg\" width=\"300\" height=\"180\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Arcadia City Mayor April Verlato, left, presents a certificate of recognition to FOWPAL and Madam Yu, Mei-Jung, vice president of FOWPAL and the wife of the leader of Tai Ji Men, for her contributions to world peace.<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/651801\/20240405-dsc-7832-copy.jpeg#2953x2233\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/651801\/20240405-dsc-7832-copy.jpeg\" width=\"300\" height=\"226\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Former President of Ecuador Rosalia Arteaga Serrano, left, receives the FOWPAL Peace Bell Award from Dr. Hong, Tao-Tze, president of FOWPAL.<\/p>\n<\/div>\n<\/div>\n<p style=\"margin-bottom:1em;font-size:115%;\"><i>Influential leaders jointly call for conscience and the power of hope to change the world<\/i><\/p>\n<div class=\"pr_quote\" style=\"clear:left;float:left;margin:20px 10px 20px 0px;max-width:300px;padding: 25px 10px 10px 25px; font-size: 1.1em; background: transparent url('\/\/www.einpresswire.com\/images\/quote_136.png') no-repeat left top;\"><b>We hope that with our efforts, conscience will become the collective consciousness of all global citizens.”<\/b><\/p>\n<p>— Dr. Hong, Tao-Tze, president of FOWPAL<\/p>\n<\/div>\n<p>CALIFORNIA, UNITED STATES, April 12, 2024 \/<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/\" dir=\"auto\" data-wpel-link=\"external\">EINPresswire.com<\/a>\/ &#8212; To celebrate the 5th United Nations-designated International Day of Conscience, the Federation of World Peace and Love (FOWPAL) organized the World Leader Summit of Love and Peace with the theme &#8220;Crafting a safe and sustainable tomorrow with conscience and the power of hope” on the evening of April 5th at the Le Méridien Pasadena\/Arcadia, California, USA. The summit brought together nearly a hundred participants, including Deputy Prime Minister of Kosovo Emilija Redžepi, former President of Ecuador Rosalía Arteaga Serrano, former Prime Minister of Lesotho Pakalitha Bethuel Mosisili, Arcadia City Mayor April Verlato, as well as scholars and NGO leaders in the fields of education, faith, and human rights. They joined the summit to exchange ideas on the promotion of peace with conscience and the power of hope.<\/p>\n<p>Dr. Hong, Tao-Tze, president of FOWPAL, delivered welcome remarks, emphasizing, “A single good thought can benefit all beings, while a single harmful thought can lead to suffering. What we do today determines the world of tomorrow. We hope that with our efforts, conscience will become the collective consciousness of all global citizens, encouraging everyone to harbor good thoughts, speak kind words, and perform good deeds at all times and in their respective positions. We hope that those in power govern for the people’s welfare and professionals in all fields adhere to their conscience and fulfill their responsibilities. We hope that all nations and ethnic groups will seek mutual benefits and shared prosperity through cultural exchange and inclusion, rather than engaging in power struggles. We hope that, to achieve harmony between humans and the environment, people will choose conservation over exploitation, ultimately resolving the crisis facing humanity today.”<\/p>\n<p>He urged everyone on this 5th International Day of Conscience to make a commitment to humanity’s bright and hopeful future by pledging, “I am willing to make efforts for this.” He stated, “Thoughts guided by conscience will show us the correct direction of action. The blueprint for our future depends on our efforts today, requiring active collaboration and practical implementation to achieve our goals.” <\/p>\n<p>Deputy Prime Minister of Kosovo Emilija Redžepi played a crucial role in promoting inclusivity, advocating for women&#8217;s rights, and fostering the integration and rights of minority groups. She demonstrated firm commitment to creating a society that respects equality and human dignity. Dr. Hong presented her with the FOWPAL Peace Bell Award for her positive influence and contributions to world peace and her promotion of human rights.<\/p>\n<p>Former President of Ecuador Rosalía Arteaga Serrano was the country&#8217;s first female President and Vice President, and her outstanding achievements in governance, education, environmental protection, and human rights have positively influenced global peace and prosperity. Therefore, she was presented with the FOWPAL Peace Bell Award.<\/p>\n<p>Former Prime Minister of Lesotho Pakalitha Bethuel Mosisili stated that conscience is a moral compass, but having conscience alone is not enough. It must be accompanied by hope, believing in the possibility of a better future and determined to turn it into reality. Hope is the driving force behind every act of courage, every resilient moment, and every triumph over despair, he emphasized.<\/p>\n<p>Arcadia City Mayor April Verlato expressed in her speech that as a leader in the city of Arcadia, some of her most powerful tools are her compassion and kindness towards others and treating everybody equitably and keeping up that hope and that conscience. She presented a certificate of recognition to FOWPAL and Madam Yu, Mei-Jung, vice president of FOWPAL and wife of the leader of Tai Ji Men, for her contribution to world peace. Dr. Hong presented a certificate of recognition to Mayor Verlato for her efforts in promoting cultural exchanges and her support of FOWPAL and the Summit.<\/p>\n<p>Other influential leaders from various countries also shared their experiences in promoting love and peace. They  expressed their support and admiration for Dr. Hong and FOWPAL’s long-standing efforts in advancing the International Day of Conscience, as well as their ongoing efforts in promoting the World Day of the Power of Hope to carry out more comprehensive actions to save the planet.<\/p>\n<p>Elizabeth Lucinschi, representing former Moldovan President Petru Lucinschi, delivered President Petru’s message that humanity&#8217;s major challenges are stopping global warming and achieving peace. She emphasized that addressing these issues effectively demands collective efforts and international cooperation.<\/p>\n<p>Ambassador Roxanna De los Santos de Piantini, former Alternate Permanent Representative of the Dominican Republic to the United Nations (Vienna), called on everyone to take responsibility for a safer and more sustainable future. She emphasized the significance of each individual&#8217;s actions, regardless of their role in society. People must embrace decisions driven by conscience, guided by moral compass, and commit to doing the right thing, using the power of hope to inspire others, she said, adding that only through collective efforts can the world overcome future challenges.<\/p>\n<p>Prof. Ankica Marinović, a religious sociologist from Croatia, attended the event on behalf of former President of Croatia Ivo Josipović. She expressed greetings to everyone and stated that each person has equal rights and possesses the universal capacity to elevate the soul, live in truth, act justly, create beauty, and fight for peace and love.<\/p>\n<p>Johnny Ford, founder and president of the World Conference of Mayors, expressed gratitude to Dr. Hong, Tao-Tze and stated that they will continue to fulfill the unfinished aspirations of Dr. Hong&#8217;s wife, Madam Yu, Mei-Jung, together with Dr. Hong. They will fight together for love and peace, which is the shared commitment of everyone at the summit.<\/p>\n<p>Prof. Ada Okika, UN coordinator of the Africana Women Working Group, stated that education is a fundamental human right, the source of individual dignity and capability, and a driving force for social, economic, political, and cultural development. She believes that igniting the conscience of teachers is important to the cultivation of the conscience of children.<\/p>\n<p>The COJEP International, represented by its UN Special Envoy for International Relations, Hugues Sanon, pays tribute to Dr. Hong. He noted that many world leaders have abandoned their faith and lost hope due to frequent wars. However, in 2019, he was deeply inspired by Dr. Hong, who urged people to strive for religious freedom, love, peace, and conscience.<\/p>\n<p>Dr. Monica Sanchez, founder of Miss Caricom International Foundation, stated that in order to build a safe and sustainable tomorrow, people need to act with conscience, stand up against discrimination, injustice, and violence, and advocate for love and compassion, just like Dr. Hong and his late wife did.<\/p>\n<p>Dr. Datu Jorge &#8220;Jerry&#8221; Perez de Tagle expresses gratitude to Dr. Hong for conveying an inspiring message of hope. He said he felt the human aspirations for global peace at the summit and was honored to walk alongside everyone at the event.<\/p>\n<p>During the summit, distinguished guests were invited onto the stage to light up the “Power of HOPE” and “Balloons of Conscience” together. This lighting ceremony symbolized the illumination of hope and the awakening of conscience in global citizens. It aimed to inspire everyone to take conscientious actions to achieve a world of love and peace. A video showcasing Dr. Hong’s achievements in promoting the International Day of Conscience and the efforts of FOWPAL in visiting various places was played. Through their practical actions, the abstract concept of &#8220;conscience&#8221; was turned into tangible actions, deeply integrating conscience into everyone’s daily life. The 5th International Day of  Conscience is worthy of celebration as it reached another milestone in the promotion of conscience.<\/p>\n<p>At the summit, FOWPAL also invited distinguished attendees to participate in the signing of &#8220;The Declaration of World Day of the Power of Hope.&#8221; The endorsement aims to motivate everyone to change human destiny through conscience, kind wishes, and the power of hope. For the safety and peace of the world, this united action gathers positive energy needed to lead the planet towards sustainable development.<\/p>\n<p>Contacts of FOWPAL C\/O <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/youtube.com\/@taijimen1966?si=8cNsi6snoEtddOFH\" data-wpel-link=\"external\">Tai Ji Men Qigong Academy<\/a><br \/>&#13;<br \/>\nJennifer Hong (408) 896-8985<br \/>&#13;<br \/>\nLily Chen (626)202-5268<br \/>&#13;<br \/>\nEvents@taijimen.org<br \/>&#13;<br \/>\n2023pressrelease@gmail.com<\/p>\n<p class=\"contact\" dir=\"auto\" style=\"margin: 1em 0;\">JENNY HSIUNG<br \/>Tai Ji Men Qigong Academy <br \/>chsiung@pausd.org<br \/>Visit us on social media:<br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.youtube.com\/watch?v=4NYVre5XuMY\" data-wpel-link=\"external\">YouTube<\/a><\/p>\n<p class=\"pr_video_title\">Introduction to FOWPAL (Federation of World Peace and Love)<\/p>\n<p class=\"pr_video\" style=\"margin: 20px 0 10px 0;\">\n<div class=\"youtube-embed\" data-video_id=\"4NYVre5XuMY\"><iframe loading=\"lazy\" title=\"Introduction to FOWPAL (Federation of World Peace and Love) | 11-05-2023\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/4NYVre5XuMY?feature=oembed&#038;enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen><\/iframe><\/div>\n<\/p>\n<p>    <img decoding=\"async\" alt=\"\" class=\"prtr\" src=\"https:\/\/www.einpresswire.com\/tracking\/article.gif?t=2&amp;a=WPSfk_SZEXMRNVJF&amp;i=akWTtSZOi21hyjZX\"\/><\/p>\n<div class=\"article-footer\">\n<p class=\"text-center\">You just read:<\/p>\n<div class=\"share-vertical-bottom\">\n<div class=\"fleft pull-left\">\n<p>News Provided By<\/p>\n<p>\n      <span>Tai Ji Men Qigong Academy<\/span>\n    <\/p>\n<p>\n      April 12, 2024, 07:41 GMT\n    <\/p>\n<\/p><\/div>\n<\/div>\n<p>      <input readonly=\"readonly\" type=\"text\" value=\"https:\/\/www.einpresswire.com\/article\/703060022\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\"\/><\/p>\n<p>\n        <br \/>EIN Presswire&#8217;s priority is source transparency. We do not allow opaque clients, and our editors try to be careful about weeding out false and misleading content.<br \/>\nAs a user, if you see something we have missed, please do bring it to our attention. Your help is welcome. EIN Presswire, Everyone&#8217;s Internet News Presswire,<br \/>\ntries to define some of the boundaries that are reasonable in today&#8217;s world. Please see our<br \/>\n<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/editorial-guidelines\" data-wpel-link=\"external\">Editorial Guidelines<\/a><br \/>\nfor more information.\n      <\/p>\n<\/p><\/div>\n<\/p><\/div>\n<p>Originally published at <a href=\"https:\/\/www.einpresswire.com\/article\/703060022\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">https:\/\/www.einpresswire.com\/article\/703060022\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>On April 5th, the Federation of World Peace and Love (FOWPAL) hosts the World Leader Summit of Love and Peace to celebrate the 5th International Day of Conscience. Deputy Prime Minister of Kosovo Emilija Redzepi, left, receives the FOWPAL Peace Bell Award from Dr. Hong, Tao-Tze, president of FOWPAL. Former Prime Minister of Lesotho Pakalitha [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":148525,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[553],"tags":[],"class_list":["post-148524","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-books"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"On April 5th, the Federation of World Peace and Love (FOWPAL) hosts the World Leader Summit of Love and Peace to celebrate the 5th International Day of Conscience. Deputy Prime Minister of Kosovo Emilija Redzepi, left, receives the FOWPAL Peace Bell Award from Dr. Hong, Tao-Tze, president of FOWPAL. Former Prime Minister of Lesotho Pakalitha\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"On April 5th, the Federation of World Peace and Love (FOWPAL) hosts the World Leader Summit of Love and Peace to celebrate the 5th International Day of Conscience. Deputy Prime Minister of Kosovo Emilija Redzepi, left, receives the FOWPAL Peace Bell Award from Dr. Hong, Tao-Tze, president of FOWPAL. Former Prime Minister of Lesotho Pakalitha\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/img.einpresswire.com\/medium\/651796\/20240405-hao-6998.jpeg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/img.einpresswire.com\/medium\/651796\/20240405-hao-6998.jpeg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2024-04-13T21:12:38+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2024-04-13T21:12:38+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"On April 5th, the Federation of World Peace and Love (FOWPAL) hosts the World Leader Summit of Love and Peace to celebrate the 5th International Day of Conscience. Deputy Prime Minister of Kosovo Emilija Redzepi, left, receives the FOWPAL Peace Bell Award from Dr. Hong, Tao-Tze, president of FOWPAL. Former Prime Minister of Lesotho Pakalitha\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/img.einpresswire.com\/medium\/651796\/20240405-hao-6998.jpeg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/#blogposting\",\"name\":\"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience - Beauty Ring Magazine\",\"headline\":\"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/651796\\\/20240405-hao-6998.jpeg\",\"caption\":\"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience\"},\"datePublished\":\"2024-04-13T17:12:38-04:00\",\"dateModified\":\"2024-04-13T17:12:38-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/#webpage\"},\"articleSection\":\"Books\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/#listItem\",\"position\":2,\"name\":\"Books\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/#listItem\",\"position\":3,\"name\":\"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/\",\"name\":\"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience - Beauty Ring Magazine\",\"description\":\"On April 5th, the Federation of World Peace and Love (FOWPAL) hosts the World Leader Summit of Love and Peace to celebrate the 5th International Day of Conscience. Deputy Prime Minister of Kosovo Emilija Redzepi, left, receives the FOWPAL Peace Bell Award from Dr. Hong, Tao-Tze, president of FOWPAL. Former Prime Minister of Lesotho Pakalitha\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/651796\\\/20240405-hao-6998.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/#mainImage\",\"caption\":\"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\\\/#mainImage\"},\"datePublished\":\"2024-04-13T17:12:38-04:00\",\"dateModified\":\"2024-04-13T17:12:38-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>FOWPAL Hosts Celebration of UN-Designated International Day of Conscience - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience - Beauty Ring Magazine","description":"On April 5th, the Federation of World Peace and Love (FOWPAL) hosts the World Leader Summit of Love and Peace to celebrate the 5th International Day of Conscience. Deputy Prime Minister of Kosovo Emilija Redzepi, left, receives the FOWPAL Peace Bell Award from Dr. Hong, Tao-Tze, president of FOWPAL. Former Prime Minister of Lesotho Pakalitha","canonical_url":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience - Beauty Ring Magazine","og:description":"On April 5th, the Federation of World Peace and Love (FOWPAL) hosts the World Leader Summit of Love and Peace to celebrate the 5th International Day of Conscience. Deputy Prime Minister of Kosovo Emilija Redzepi, left, receives the FOWPAL Peace Bell Award from Dr. Hong, Tao-Tze, president of FOWPAL. Former Prime Minister of Lesotho Pakalitha","og:url":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/","og:image":"https:\/\/img.einpresswire.com\/medium\/651796\/20240405-hao-6998.jpeg","og:image:secure_url":"https:\/\/img.einpresswire.com\/medium\/651796\/20240405-hao-6998.jpeg","article:published_time":"2024-04-13T21:12:38+00:00","article:modified_time":"2024-04-13T21:12:38+00:00","twitter:card":"summary_large_image","twitter:title":"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience - Beauty Ring Magazine","twitter:description":"On April 5th, the Federation of World Peace and Love (FOWPAL) hosts the World Leader Summit of Love and Peace to celebrate the 5th International Day of Conscience. Deputy Prime Minister of Kosovo Emilija Redzepi, left, receives the FOWPAL Peace Bell Award from Dr. Hong, Tao-Tze, president of FOWPAL. Former Prime Minister of Lesotho Pakalitha","twitter:image":"https:\/\/img.einpresswire.com\/medium\/651796\/20240405-hao-6998.jpeg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/#blogposting","name":"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience - Beauty Ring Magazine","headline":"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/651796\/20240405-hao-6998.jpeg","caption":"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience"},"datePublished":"2024-04-13T17:12:38-04:00","dateModified":"2024-04-13T17:12:38-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/#webpage"},"articleSection":"Books"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/books\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/books\/#listItem","position":2,"name":"Books","item":"https:\/\/beautyring.info\/category\/books\/","nextItem":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/#listItem","position":3,"name":"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience","previousItem":"https:\/\/beautyring.info\/category\/books\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/#webpage","url":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/","name":"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience - Beauty Ring Magazine","description":"On April 5th, the Federation of World Peace and Love (FOWPAL) hosts the World Leader Summit of Love and Peace to celebrate the 5th International Day of Conscience. Deputy Prime Minister of Kosovo Emilija Redzepi, left, receives the FOWPAL Peace Bell Award from Dr. Hong, Tao-Tze, president of FOWPAL. Former Prime Minister of Lesotho Pakalitha","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/651796\/20240405-hao-6998.jpeg","@id":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/#mainImage","caption":"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/#mainImage"},"datePublished":"2024-04-13T17:12:38-04:00","dateModified":"2024-04-13T17:12:38-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"148524","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2024-04-13 21:12:40","updated":"2024-04-13 21:27:15"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/books\/\" title=\"Books\">Books<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tFOWPAL Hosts Celebration of UN-Designated International Day of Conscience\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Books","link":"https:\/\/beautyring.info\/category\/books\/"},{"label":"FOWPAL Hosts Celebration of UN-Designated International Day of Conscience","link":"https:\/\/beautyring.info\/books\/fowpal-hosts-celebration-of-un-designated-international-day-of-conscience\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/148524"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=148524"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/148524\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/148525"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=148524"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=148524"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=148524"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}