{"id":148973,"date":"2024-04-19T00:33:32","date_gmt":"2024-04-19T04:33:32","guid":{"rendered":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/"},"modified":"2024-04-19T00:33:32","modified_gmt":"2024-04-19T04:33:32","slug":"the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood","status":"publish","type":"post","link":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/","title":{"rendered":"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &#038; Gala on October 4 in Hollywood"},"content":{"rendered":"<p><\/p>\n<div>\n<div class=\"pr_images_column\">\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/655488\/living-legends-foundation-group.jpeg#960x960\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/655488\/living-legends-foundation-group.jpeg\" width=\"300\" height=\"300\" style=\"display:none\"\/><\/a><\/p>\n<p>L-R, Top Row: Donnie Simpson, Joi Brown, L. Londell McMillan; L-R, Bottom Row: Chris Chambers, Gwen Franklin, Mike Kelly<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/655490\/honoree-donnie-simpson.jpeg#3300x2944\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/655490\/honoree-donnie-simpson.jpeg\" width=\"300\" height=\"267\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Living Legends Foundation Honoree Donnie Simpson<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/655492\/l-londell-mcmillan.jpeg#600x510\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/655492\/l-londell-mcmillan.jpeg\" width=\"300\" height=\"255\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Living Legends Foundation Honoree L. Londell McMillan<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/655494\/joi-brown.jpeg#1184x1280\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/655494\/joi-brown.jpeg\" width=\"277\" height=\"300\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Living Legends Foundation Honoree Joi Brown<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/655498\/chris-chambers.jpeg#1716x2573\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/655498\/chris-chambers.jpeg\" width=\"200\" height=\"300\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Living Legends Foundation Honoree Chris Chambers<\/p>\n<\/div>\n<\/div>\n<div class=\"pr_quote\" style=\"clear:left;float:left;margin:20px 10px 20px 0px;max-width:300px;padding: 25px 10px 10px 25px; font-size: 1.1em; background: transparent url('\/\/www.einpresswire.com\/images\/quote_136.png') no-repeat left top;\"><b>We are pleased that the Living Legends Foundation remains the longest-standing Black Music organization to date, which was founded in 1991 by Black Music executives.”<\/b><\/p>\n<p>— David C. Linton, Chairman of the Living Legends Foundation<\/p>\n<\/div>\n<p>LOS ANGELES, CALIFORNIA, UNITED STATES, April 18, 2024 \/<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/\" dir=\"auto\" data-wpel-link=\"external\">EINPresswire.com<\/a>\/ &#8212; <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.livinglegendsfoundation.com\" data-wpel-link=\"external\">The Living Legends Foundation<\/a>, Inc. (LLF) today announces its 2024 Annual Awards Dinner and Gala. This year’s event will be held on Friday, October 4, 2024, at Taglyan Cultural Complex, 1201 N. Vine Street, Hollywood, CA. The red carpet and cocktail reception begin at 6:30 p.m. with the awards dinner at 7:30 p.m. <\/p>\n<p>The esteemed group of six honorees include Donnie Simpson, the legendary radio and television broadcaster, who recently signed off the airwaves earlier this year after a trailblazing 55-year career in music, entertainment, and sports that started at WJLB-FM Detroit, Michigan, and later moved to Washington, DC, where he continued his historic career in broadcasting with media outlets such as WKYS-FM, WPGC-FM, NBC’s WRC-TV, where he covered sports, and the newly formed Black Entertainment Television, and years later at WMMJ-FM’s  Majic 102.3. Simpson was inducted into the R&amp;B Music Hall of Fame (2015), and he was the only non-musician ever inducted into the organization. He was also inducted into the Radio Hall of Fame (2020), and the National Association of Broadcasters Hall of Fame (2024). The broadcast icon will be presented with the Living Legends Foundation’s Jerry Boulding Radio Award. <\/p>\n<p>L. Londell McMillan is a longtime entertainment attorney, an entrepreneur, an advocate for music and entertainment creators and executives, and the chairperson of the NorthStar Group. With a career spanning more than three decades, McMillan has represented the Mount Rushmore of entertainers including Michael Jackson, Prince, Aretha Franklin, Stevie Wonder, Spike Lee, Notorious B.I.G., Kanye West, Roberta Flack, Doug E. Fresh, LL Cool J, Nas, DMX, and countless other recording artists, celebrities, corporate and non-profit entities, and civil rights leaders. Under the NorthStar Group, he serves as executive publisher of the Source magazine and other media platforms. McMillan will be the recipient of the Kendall A. Minter Entertainment Advocate Award, renamed after his recent passing. <\/p>\n<p>Joi Brown is the founder and CEO of Culture Creators. She has successfully positioned the organization as a vital link between global cultural leaders and a new generation of diverse creators. The Culture Creators Foundation, a 501(c)(3) organization, underscores this commitment by developing training programs for students of color in various industries. These programs enhance traditional curricula with real-time training, focusing on soft and hard skill development. Over the past two years, the foundation has awarded more than $300,000 in scholarships, demonstrating a substantial investment in the future of diverse talent. Brown’s widely successful Innovators and Leaders Awards brunch, held annually in June in Los Angeles has honored cultural and entertainment leaders such as Byron Allen, Nicole Lyn, Robin Thede, Charles K. King, D-Nice, Swizz Beatz, H.E.R., Sylvia Rhone, and many others. She is the recipient of the Adcolor Music Award (2023) and was included in Essence magazine’s Power 40 list. The former senior-level record label executive will be the recipient of the first-ever Impact Player Award. <\/p>\n<p>Chris Chambers is the founder and CEO of The Chamber Group, the New York-based boutique public relations firm, founded in 2006. From Chambers’ record label days to his successful journey as an entrepreneur, past and present, he has represented some of the biggest and brightest celebrities in music, entertainment, fashion, and sports, including Usher, Mariah Carey, OutKast, Erykah Badu, Jamie Foxx, Drake, Ne-Yo, Jill Scott, Naomi Campbell, Chaka Khan, Kelly Rowland, Solange, as well as corporate and lifestyle clients and projects such as Versace, Gucci, HBO, Starz, Netflix, the National Hockey League, the Essence Music Festival, just to name a few.  Before The Chamber Group was formed, he had a groundbreaking career at several major record labels including Mercury Records (1994) as publicity director (Donna Summer, Tony! Toni! Toné, Vanessa Williams, and Lionel Richie); EMI Records (1995) as the national publicity director (Prince, D’Angelo, and Joi); Interscope Records (1997) as senior director of publicity (Eminem, Black Eyed Peas, Eve, and Mya); Arista Records, under the leadership of L.A. Reid as vice president of publicity (Whitney Houston and Run DMC); LaFace Records (TLC, Usher, Toni Braxton, and OutKast); and Sean Combs’ Bad Boy Entertainment (P. Diddy, Faith Evans and the late Notorious B.I.G.). Chambers will be presented with the Media Executive Award. <\/p>\n<p>Mike Kelly is a veteran record label executive and a radio broadcaster with more than 40 years in music and entertainment. Kelly started his nearly ten-year radio broadcast career in 1979, as an on-air talent at KADO-FM (Texarkana, AR) and WAWA-AM (Milwaukee, WI). He added the title of program director to his resume, where he programmed radio stations KAPE-AM (San Antonio, TX) and the legendary KATZ-FM (St Louis, MO). After Kelly’s successful career in broadcasting, he started a 30-plus year career working as a radio promotions executive at six record labels including Arista Records (Kenny G, Billy Ocean, Kashif, and Whitney Houston); Motown Records (The Temptations, Smokey Robinson, Stevie Wonder, Shanice, Johnny Gill, and Boyz II Men); Mercury Records (Vanessa Williams, Brian McKnight, and Black Sheep); Elektra Records (Keith Sweat, Tamia, Missy Elliott, En Vogue, Busta Rhymes, Ray J, Yolanda Adams, and Gerald Levert); Warner Music Group (Eric Benét, Ginuwine, and Jaheim); and Atlantic Records (Wale, Meek Mill, and Rick Ross’s Maybach Music Group, as well as Omarion, Jill Scott, Tank, Bruno Mars, Silk Sonic, Wiz Khalifa, and Jack Harlow). Kelly continues to work as a radio consultant with his company, Real One 24\/7 Promotion and Marketing. He will be the recipient of the Music Executive Award.<\/p>\n<p>Gwen Franklin is the founder and CEO of B. Lifted Up! Inc., whose mission is to empower through insight, education, and training. Franklin began her career in radio broadcasting at Howard University’s WHUR-FM while earning her Bachelor of Arts degree in Communications. From radio to records, Franklin’s more than thirty-plus-year career has included various senior-level positions including radio promotions, marketing, sales, and artist development during her tenures at Casablanca (Donna Summer, Parliament, and Cameo); A&amp;M (Quincy Jones, Sting, Jeffrey Osborne, Janet Jackson, and Atlantic Starr); Capitol (BeBe &amp; CeCe Winans, Freddie Jackson, and MC Hammer); Mercury (Vanessa Williams, Brian McKnight, and Oleta Adams); and RCA Records (SWV). While working at A&amp;M Records, she returned to college and earned a Master of Business Administration from Baruch College, The City University of New York. She recently received her Master of Arts in Transformational Leadership Administration (MATLA) from New York Theological Seminary. Though she left the recording industry in the nineties, her passion for education, music, and marketing has never stopped. As an educator, she served as an adjunct professor of Marketing &amp; Merchandising at the recently named New York University Steinhardt School of Culture, Education and Human Development; and Ramapo College of New Jersey’s School of Communication Arts, where she taught Marketing &amp; Entrepreneurial Business Environment. Returning to her roots, Franklin’s latest venture is B. Lifted Up! Radio’s &#8220;Your Guide To Living An Abundant Life,&#8221; is a weekly radio program in collaboration with the Mocha Podcasts Network that blends faith and finance with contextual contemporary conversation. The program airs on SiriusXM’s HUR Voices (Channel 141). Franklin will be presented with the Mike Bernardo Female Executive Award for her expansive and concurrent work in multiple industries. <\/p>\n<p>This year marks the 33rd anniversary of the Living Legends Foundation. “As we reflect on the brilliance and excellence of today’s global music and entertainment leaders, we are pleased that the organization remains the longest-standing Black Music organization to date, which was founded in 1991 by Black Music executives,” says David C. Linton, the chairperson of the Living Legends Foundation. <\/p>\n<p>“As we approach another milestone year, we would like to further cement the organization as the key stakeholder in Black Music by reclaiming our mission of ‘protecting and preserving the legacy of those who create, market and elevate Black music’ which includes R&amp;B, hip-hop, jazz, blues, country, reggae, and world music.”<\/p>\n<p>“Additionally, as we develop 21st-century ideas to help advance and support Black Music executives who are still part of the establishment, serve as independent consultants, or others who have advanced to entrepreneurship in other key areas of music and entertainment, we as an organization, along with our board of directors hope to continue to be a resource to help provide leadership with practical and sustainable approaches and platforms to the Black Music community in the areas of marketing, radio, publishing, music management, traditional and digital retail, publicity, and A&amp;R.”<\/p>\n<p>Linton concludes, “We will also build the organization’s membership nationally, continue to develop our scholarship program to assist Black students at both Historically Black Colleges and Universities and Predominantly White Institutions, develop mentorship programs that aid today’s young executives, and continue to serve and support our current and former Black executives who may need financial assistance.”<\/p>\n<p class=\"contact\" dir=\"auto\" style=\"margin: 1em 0;\">Gwendolyn Quinn<br \/>Living Legends Foundation Inc<br \/>+1 917-769-7808<br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.einpresswire.com\/contact_author\/704651782\" data-src=\"akWTtSZOi21hyjZX\" data-wpel-link=\"external\">email us here<\/a><\/p>\n<p>    <img decoding=\"async\" alt=\"\" class=\"prtr\" src=\"https:\/\/www.einpresswire.com\/tracking\/article.gif?t=2&amp;a=cG9vYDW_qpXVO4j_&amp;i=akWTtSZOi21hyjZX\"\/><\/p>\n<div class=\"article-footer\">\n<p class=\"text-center\">You just read:<\/p>\n<div class=\"share-vertical-bottom\">\n<div class=\"fleft pull-left\">\n<p>News Provided By<\/p>\n<p>\n      April 18, 2024, 13:00 GMT\n    <\/p>\n<\/p><\/div>\n<\/div>\n<p>      <input readonly=\"readonly\" type=\"text\" value=\"https:\/\/www.einpresswire.com\/article\/704651782\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\"\/><\/p>\n<p>\n        <br \/>EIN Presswire&#8217;s priority is source transparency. We do not allow opaque clients, and our editors try to be careful about weeding out false and misleading content.<br \/>\nAs a user, if you see something we have missed, please do bring it to our attention. Your help is welcome. EIN Presswire, Everyone&#8217;s Internet News Presswire,<br \/>\ntries to define some of the boundaries that are reasonable in today&#8217;s world. Please see our<br \/>\n<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/editorial-guidelines\" data-wpel-link=\"external\">Editorial Guidelines<\/a><br \/>\nfor more information.\n      <\/p>\n<\/p><\/div>\n<\/p><\/div>\n<p>Originally published at <a href=\"https:\/\/www.einpresswire.com\/article\/704651782\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">https:\/\/www.einpresswire.com\/article\/704651782\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>L-R, Top Row: Donnie Simpson, Joi Brown, L. Londell McMillan; L-R, Bottom Row: Chris Chambers, Gwen Franklin, Mike Kelly Living Legends Foundation Honoree Donnie Simpson Living Legends Foundation Honoree L. Londell McMillan Living Legends Foundation Honoree Joi Brown Living Legends Foundation Honoree Chris Chambers We are pleased that the Living Legends Foundation remains the longest-standing [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":148974,"comment_status":"","ping_status":"","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[563],"tags":[],"class_list":["post-148973","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-movies"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"L-R, Top Row: Donnie Simpson, Joi Brown, L. Londell McMillan; L-R, Bottom Row: Chris Chambers, Gwen Franklin, Mike Kelly Living Legends Foundation Honoree Donnie Simpson Living Legends Foundation Honoree L. Londell McMillan Living Legends Foundation Honoree Joi Brown Living Legends Foundation Honoree Chris Chambers We are pleased that the Living Legends Foundation remains the longest-standing\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &amp; Gala on October 4 in Hollywood - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"L-R, Top Row: Donnie Simpson, Joi Brown, L. Londell McMillan; L-R, Bottom Row: Chris Chambers, Gwen Franklin, Mike Kelly Living Legends Foundation Honoree Donnie Simpson Living Legends Foundation Honoree L. Londell McMillan Living Legends Foundation Honoree Joi Brown Living Legends Foundation Honoree Chris Chambers We are pleased that the Living Legends Foundation remains the longest-standing\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/img.einpresswire.com\/medium\/655488\/living-legends-foundation-group.jpeg\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/img.einpresswire.com\/medium\/655488\/living-legends-foundation-group.jpeg\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2024-04-19T04:33:32+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2024-04-19T04:33:32+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &amp; Gala on October 4 in Hollywood - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"L-R, Top Row: Donnie Simpson, Joi Brown, L. Londell McMillan; L-R, Bottom Row: Chris Chambers, Gwen Franklin, Mike Kelly Living Legends Foundation Honoree Donnie Simpson Living Legends Foundation Honoree L. Londell McMillan Living Legends Foundation Honoree Joi Brown Living Legends Foundation Honoree Chris Chambers We are pleased that the Living Legends Foundation remains the longest-standing\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/img.einpresswire.com\/medium\/655488\/living-legends-foundation-group.jpeg\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/#blogposting\",\"name\":\"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner & Gala on October 4 in Hollywood - Beauty Ring Magazine\",\"headline\":\"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &#038; Gala on October 4 in Hollywood\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/655488\\\/living-legends-foundation-group.jpeg\",\"caption\":\"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &#038; Gala on October 4 in Hollywood\"},\"datePublished\":\"2024-04-19T00:33:32-04:00\",\"dateModified\":\"2024-04-19T00:33:32-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/#webpage\"},\"articleSection\":\"Movies and TV\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/movies\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/movies\\\/#listItem\",\"position\":2,\"name\":\"Movies and TV\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/movies\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/#listItem\",\"position\":3,\"name\":\"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner & Gala on October 4 in Hollywood\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/movies\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/\",\"name\":\"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner & Gala on October 4 in Hollywood - Beauty Ring Magazine\",\"description\":\"L-R, Top Row: Donnie Simpson, Joi Brown, L. Londell McMillan; L-R, Bottom Row: Chris Chambers, Gwen Franklin, Mike Kelly Living Legends Foundation Honoree Donnie Simpson Living Legends Foundation Honoree L. Londell McMillan Living Legends Foundation Honoree Joi Brown Living Legends Foundation Honoree Chris Chambers We are pleased that the Living Legends Foundation remains the longest-standing\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/655488\\\/living-legends-foundation-group.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/#mainImage\",\"caption\":\"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &#038; Gala on October 4 in Hollywood\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/movies\\\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\\\/#mainImage\"},\"datePublished\":\"2024-04-19T00:33:32-04:00\",\"dateModified\":\"2024-04-19T00:33:32-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &amp; Gala on October 4 in Hollywood - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner & Gala on October 4 in Hollywood - Beauty Ring Magazine","description":"L-R, Top Row: Donnie Simpson, Joi Brown, L. Londell McMillan; L-R, Bottom Row: Chris Chambers, Gwen Franklin, Mike Kelly Living Legends Foundation Honoree Donnie Simpson Living Legends Foundation Honoree L. Londell McMillan Living Legends Foundation Honoree Joi Brown Living Legends Foundation Honoree Chris Chambers We are pleased that the Living Legends Foundation remains the longest-standing","canonical_url":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &amp; Gala on October 4 in Hollywood - Beauty Ring Magazine","og:description":"L-R, Top Row: Donnie Simpson, Joi Brown, L. Londell McMillan; L-R, Bottom Row: Chris Chambers, Gwen Franklin, Mike Kelly Living Legends Foundation Honoree Donnie Simpson Living Legends Foundation Honoree L. Londell McMillan Living Legends Foundation Honoree Joi Brown Living Legends Foundation Honoree Chris Chambers We are pleased that the Living Legends Foundation remains the longest-standing","og:url":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/","og:image":"https:\/\/img.einpresswire.com\/medium\/655488\/living-legends-foundation-group.jpeg","og:image:secure_url":"https:\/\/img.einpresswire.com\/medium\/655488\/living-legends-foundation-group.jpeg","article:published_time":"2024-04-19T04:33:32+00:00","article:modified_time":"2024-04-19T04:33:32+00:00","twitter:card":"summary_large_image","twitter:title":"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &amp; Gala on October 4 in Hollywood - Beauty Ring Magazine","twitter:description":"L-R, Top Row: Donnie Simpson, Joi Brown, L. Londell McMillan; L-R, Bottom Row: Chris Chambers, Gwen Franklin, Mike Kelly Living Legends Foundation Honoree Donnie Simpson Living Legends Foundation Honoree L. Londell McMillan Living Legends Foundation Honoree Joi Brown Living Legends Foundation Honoree Chris Chambers We are pleased that the Living Legends Foundation remains the longest-standing","twitter:image":"https:\/\/img.einpresswire.com\/medium\/655488\/living-legends-foundation-group.jpeg","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/#blogposting","name":"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner & Gala on October 4 in Hollywood - Beauty Ring Magazine","headline":"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &#038; Gala on October 4 in Hollywood","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/655488\/living-legends-foundation-group.jpeg","caption":"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &#038; Gala on October 4 in Hollywood"},"datePublished":"2024-04-19T00:33:32-04:00","dateModified":"2024-04-19T00:33:32-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/#webpage"},"articleSection":"Movies and TV"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/movies\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/movies\/#listItem","position":2,"name":"Movies and TV","item":"https:\/\/beautyring.info\/category\/movies\/","nextItem":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/#listItem","position":3,"name":"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner & Gala on October 4 in Hollywood","previousItem":"https:\/\/beautyring.info\/category\/movies\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/#webpage","url":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/","name":"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner & Gala on October 4 in Hollywood - Beauty Ring Magazine","description":"L-R, Top Row: Donnie Simpson, Joi Brown, L. Londell McMillan; L-R, Bottom Row: Chris Chambers, Gwen Franklin, Mike Kelly Living Legends Foundation Honoree Donnie Simpson Living Legends Foundation Honoree L. Londell McMillan Living Legends Foundation Honoree Joi Brown Living Legends Foundation Honoree Chris Chambers We are pleased that the Living Legends Foundation remains the longest-standing","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/655488\/living-legends-foundation-group.jpeg","@id":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/#mainImage","caption":"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &#038; Gala on October 4 in Hollywood"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/#mainImage"},"datePublished":"2024-04-19T00:33:32-04:00","dateModified":"2024-04-19T00:33:32-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"148973","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2024-04-19 04:33:32","updated":"2024-04-19 04:42:16"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/movies\/\" title=\"Movies and TV\">Movies and TV<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tThe Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &amp; Gala on October 4 in Hollywood\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Movies and TV","link":"https:\/\/beautyring.info\/category\/movies\/"},{"label":"The Living Legends Foundation Announces its 2024 Honorees for its Annual Awards Dinner &#038; Gala on October 4 in Hollywood","link":"https:\/\/beautyring.info\/movies\/the-living-legends-foundation-announces-its-2024-honorees-for-its-annual-awards-dinner-gala-on-october-4-in-hollywood\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/148973"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=148973"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/148973\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/148974"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=148973"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=148973"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=148973"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}