{"id":156586,"date":"2024-07-27T07:44:14","date_gmt":"2024-07-27T07:44:14","guid":{"rendered":"https:\/\/beautyring.info\/five-books-chronicle-journeys-of-resilience-and-redemption\/"},"modified":"2024-07-27T07:44:14","modified_gmt":"2024-07-27T07:44:14","slug":"five-books-chronicle-journeys-of-resilience-and-redemption","status":"publish","type":"post","link":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/","title":{"rendered":"Five Books Chronicle Journeys of Resilience and Redemption"},"content":{"rendered":"<p><\/p>\n<div>\n<div class=\"pr_images_column\">\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/711967\/out-of-season.png#1500x1174\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/711967\/out-of-season.png\" width=\"300\" height=\"234\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Out of Season by Tom Gilroy<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/711982\/jungle-courage-by-w-blake-gibb.png#1500x1174\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/711982\/jungle-courage-by-w-blake-gibb.png\" width=\"300\" height=\"234\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Jungle Courage by W. Blake Gibbs<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/711988\/seven-years-of-tribulation.png#1500x1174\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/711988\/seven-years-of-tribulation.png\" width=\"300\" height=\"234\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Seven Years of Tribulation by John D. Cadore<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/711992\/finding-home.png#1500x1174\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/711992\/finding-home.png\" width=\"300\" height=\"234\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Finding Home by Boontak Ko Chitta<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/711996\/i-ll-suffer-first.png#1500x1174\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/711996\/i-ll-suffer-first.png\" width=\"300\" height=\"234\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>I&#8217;ll Suffer First by Derek Chandler<\/p>\n<\/div>\n<\/div>\n<p style=\"margin-bottom:1em;font-size:115%;\"><i>Authors pen tales of triumph and transformation that offer insight into human experience in latest releases.<\/i><\/p>\n<p>ETOBICOKE, ONTARIO, CANADA, July 24, 2024 \/<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/\" dir=\"auto\" data-wpel-link=\"external\">EINPresswire.com<\/a>\/ &#8212; In the vast landscape of literature, a collection of five remarkable books invites readers on a journey through the multifaceted tapestry of the human experience. Despite their diverse genres and narrative styles, these works converge on a common theme of resilience, introspection, and the relentless pursuit of meaning.<\/p>\n<p>Tom Gilroy kickstarts this exploration with “Out of Season”, an intricate blend of historical facts and fiction, delving into the complex geopolitical landscape of the early 1980s, where Libyan forces crossed into Chad, sparking a civil war that drew the attention of global powers. This fictional account weaves together intelligence intrigue and real historical events, offering readers an engaging political thriller enriched with profound themes.<\/p>\n<p>In “Out of Season”, Gilroy draws on his firsthand experience as a reporter based in Douala, Cameroon, during the period of conflict. The novel examines the intricate interplay between the intelligence services of Libya, France, and the United States, each maneuvering for influence in the strategically significant region. As a former colonial power, France&#8217;s intervention contrasts sharply with the U.S. efforts to counter Soviet influence through Libya.<\/p>\n<p>Beyond the immediate political machinations, the novel also delves into the enduring impact of colonialism, exploring how past injustices continue to shape the present. Gilroy&#8217;s narrative addresses the corrosive effects on native populations, the power of belief systems, and the profound consequences of seemingly minor decisions made in anger. The result is a rich tapestry that not only entertains but also provokes thoughtful reflection on broader societal issues.<\/p>\n<p>Tom Gilroy&#8217;s background as a journalist and Peace Corps volunteer enriches the authenticity and depth of his storytelling. His previous work, “In Bikole”, a collection of short stories, showcased his ability to capture the nuanced experiences of life in Africa. With a BA from the University of Virginia and an MBA from the Columbia School of Journalism, Gilroy brings a well-rounded perspective to his writing, informed by diverse experiences across continents.<\/p>\n<p>Building upon this exploration, W. Blake Gibbs’ “Jungle Courage” paints a vivid portrait of the remarkable missionary journey undertaken by Harold and Ella Landrus as they ventured into the remote jungles of Liberia, West Africa, in the 1930s. This captivating narrative chronicles the trials, triumphs, and unforgettable adventures of a family committed to serving others with unwavering faith and courage.<\/p>\n<p>Harold and Ella Landrus embarked on their mission with hearts filled with hope and a deep sense of purpose. Little did they know the extraordinary challenges that awaited them: encounters with deadly snakes, marauding leopards, rampaging elephants, and terrifying airplane crashes. Yet, in the face of adversity, they remained steadfast in their commitment to their calling, drawing strength from their faith and determination.<\/p>\n<p>Written by a retired missionary who spent time with the Landrus family during their time in Liberia, W. Blake Gibbs, the Pasadena-born author, offers readers a glimpse into the extraordinary lives of individuals who dedicated themselves to making a difference in the lives of native tribespeople in the African interior. With a career spanning over forty years in various business fields and extensive travels with his wife, Esther, in Africa, Asia, and Europe, Gibbs infuses the story with rich detail and profound insight.<\/p>\n<p>Emerging from the jungles of courage, John D Cadore&#8217;s “Seven Years of Tribulation” offers an intimate glimpse into a life marked by resilience, determination, and ultimate triumph. Through the author&#8217;s own experiences, this compelling narrative illustrates the enduring power of consistency, perseverance, and appreciation in overcoming life&#8217;s challenges.<\/p>\n<p>Born on the island of Grenada in the West Indies, John D Cadore embarked on a remarkable journey that led him to serve both as a commissioned and non-commissioned officer in the United States Military. His tenure in the U.S. Army, the U.S. Army Reserve, and the Army National Guard laid the foundation for a life characterized by service and dedication.<\/p>\n<p>Following his initial tour of duty in the U.S. Army, Cadore pursued higher education with unwavering determination. He earned an impressive array of degrees, including an Associates degree, a Bachelor&#8217;s degree, a Master&#8217;s degree, and a Law degree. Despite facing numerous obstacles along the way, including the completion of all requirements for a Ph.D. except his dissertation, Cadore&#8217;s commitment to learning never wavered.<\/p>\n<p>“Seven Years of Tribulation” marks Cadore&#8217;s first published book, with plans for additional works in the near future. As a licensed attorney practicing in multiple states, Cadore brings a wealth of life experience and insight to his writing, aiming to enlighten and inspire readers with each new publication.<\/p>\n<p>Transitioning from the trials of professional life to the quest for personal identity, Boontak Ko Chitta&#8217;s “Finding Home” explores themes of survival, resilience, and redemption set against the backdrop of the Vietnam War. <\/p>\n<p>“Finding Home” unfolds as American Air Force pilot John Stevenson&#8217;s fateful crash in Laos in 1972 sparks a chain of events that forever alters the course of his life. Then, as he grapples with a near-fatal snakebite, he finds himself at the mercy of a local fisherman whose compassion becomes his lifeline. With each step on his arduous trek back to safety, John encounters unexpected kindness and discovers the true meaning of home. Through trials and triumphs, the story paints a captivating tale of human connection, belief in humanity, and the universal quest for belonging.<\/p>\n<p>Author Boontak Ko Chitta brings a deeply personal perspective to the story, drawing from his own experiences growing up in Laos during the turbulent era of the Vietnam War. With nineteen years spent in Laos and firsthand knowledge of the region&#8217;s landscapes and cultures, Boontak infuses the narrative with authenticity and depth, making it a heartfelt reflection of identity, resilience, and the universal longing for a place to call home.<\/p>\n<p>Finally, the journey culminates in the poetic and introspective prose of Derek Chandler&#8217;s “I&#8217;ll Suffer First”. This work of fiction dives deep into the courageous journey of Opal May Kane, a Southern girl who rises above the overwhelming adversity of her upbringing on a small pig farm in Mississippi. <\/p>\n<p>“I&#8217;ll Suffer First” is a girl’s journey of courage and resilience. From her early childhood, Opal May&#8217;s life is marked by disarray and hardship, with experiences of physical, emotional, and sexual abuse, coupled with substance abuse, shaping her path. Despite the darkness that surrounds her, Opal May&#8217;s resilience, determination, and steadfast faith propel her forward as she navigates through destructive social relationships, seeking a path to break free from the shadows of her past.<\/p>\n<p>Derek Chandler, born and raised in Canada, is known for his vivid storytelling and deep insights. With a Bachelor&#8217;s degree in psychology from Dalhousie University, Chandler&#8217;s global travels have enriched his perspective, enabling him to write compellingly about the intersection of culture and society. His debut novel received critical acclaim for its portrayal of African American and African Canadian cultural complexities.<\/p>\n<p>In addition to “I&#8217;ll Suffer First”, Chandler has published poetry collections such as “Weathered The Storm”, “After The Storm”, and “Before The Storm”. His work often addresses social issues, like the impact of the foster care system on relationships and the challenges faced by youth in foster care. Additionally, as an advocate for literature and the arts, Chandler promotes literacy and supports emerging writers through literary festivals, workshops, and mentorship programs.<\/p>\n<p>As readers embark on this literary odyssey of five insightful books, they are reminded that literature serves as a window into the soul of humanity. Through humor, courage, tribulation, and introspection, these authors have illuminated the path to understanding, inviting readers to embrace the richness and complexity of the human experience.<\/p>\n<p>As readers embark on this literary odyssey, they are reminded that literature serves as a window into the soul of humanity. Through humor, courage, tribulation, and introspection, these authors have illuminated the path to understanding, inviting readers to embrace the richness and complexity of the human experience.<\/p>\n<p>This captivating collection is now available at <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/themaplestaple.com\/\" data-wpel-link=\"external\">The Maple Staple<\/a> bookstore, both in-store and on their Digital Spotlight Shelf, embodying the bookstore&#8217;s commitment to showcasing literature that sparks empathy and intellectual engagement, fostering reflection and dialogue.<\/p>\n<p>For further details about the collection and to acquire these compelling novels, visit <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.themaplestaple.com\" data-wpel-link=\"external\">https:\/\/www.themaplestaple.com<\/a> or explore online retail platforms such as Amazon.<\/p>\n<p>About <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.booksidepress.com\/\" data-wpel-link=\"external\">Bookside Press<\/a>:<\/p>\n<p>Bringing stories and ideas to life, one tap at a time.<\/p>\n<p>Bookside Press is all about creating buzz in the digital world. Buzz that&#8217;ll have each vital message be heard loud and clear. Headquartered in Canada, this hybrid publishing and advertising company aims to share the magic of its authors&#8217; books with the world. With a dedicated team of creatives and marketing professionals, Bookside Press collaborates with clients in building better brands that stand out and reach greater heights.<br \/>&#13;\n<\/p>\n<p class=\"contact\" dir=\"auto\" style=\"margin: 1em 0;\">Emmanuel Laguardia<br \/>The MapleStaple<br \/>+1 647-330-9992<br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.einpresswire.com\/contact_author\/730212211\" data-src=\"ZK5qAQ9tNNrKUoEK\" data-wpel-link=\"external\">email us here<\/a><br \/>Visit us on social media:<br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.facebook.com\/TheMapleStapleBookstore\/\" data-wpel-link=\"external\">Facebook<\/a><br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/twitter.com\/The_MapleStaple\" data-wpel-link=\"external\">X<\/a><br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.instagram.com\/themaplestaplebookstore\/\" data-wpel-link=\"external\">Instagram<\/a><br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/youtube.com\/@themaplestaple\" data-wpel-link=\"external\">YouTube<\/a><br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.instagram.com\/booksidepress\/\" data-wpel-link=\"external\">Other<\/a><\/p>\n<p>    <img decoding=\"async\" alt=\"\" class=\"prtr\" src=\"https:\/\/www.einpresswire.com\/tracking\/article.gif?t=2&amp;a=8uhcTFBUIK3zrfUm&amp;i=ZK5qAQ9tNNrKUoEK\"\/><\/p>\n<div class=\"article-footer\">\n<p class=\"text-center\">You just read:<\/p>\n<div class=\"share-vertical-bottom\">\n<div class=\"fleft pull-left\">\n<p>News Provided By<\/p>\n<p>\n      July 24, 2024, 21:32 GMT\n    <\/p>\n<\/p><\/div>\n<\/div>\n<p>      <input readonly=\"readonly\" type=\"text\" value=\"https:\/\/www.einpresswire.com\/article\/730212211\/five-books-chronicle-journeys-of-resilience-and-redemption\"\/><\/p>\n<p>\n        <br \/>EIN Presswire&#8217;s priority is source transparency. We do not allow opaque clients, and our editors try to be careful about weeding out false and misleading content.<br \/>\nAs a user, if you see something we have missed, please do bring it to our attention. Your help is welcome. EIN Presswire, Everyone&#8217;s Internet News Presswire,<br \/>\ntries to define some of the boundaries that are reasonable in today&#8217;s world. Please see our<br \/>\n<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/editorial-guidelines\" data-wpel-link=\"external\">Editorial Guidelines<\/a><br \/>\nfor more information.\n      <\/p>\n<\/p><\/div>\n<\/p><\/div>\n<p><script async src=\"\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><script async src=\"\/\/www.instagram.com\/embed.js\"><\/script><br \/>\n<br \/>Originally published at <a href=\"https:\/\/www.einpresswire.com\/article\/730212211\/five-books-chronicle-journeys-of-resilience-and-redemption\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">https:\/\/www.einpresswire.com\/article\/730212211\/five-books-chronicle-journeys-of-resilience-and-redemption<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Out of Season by Tom Gilroy Jungle Courage by W. Blake Gibbs Seven Years of Tribulation by John D. Cadore Finding Home by Boontak Ko Chitta I&#8217;ll Suffer First by Derek Chandler Authors pen tales of triumph and transformation that offer insight into human experience in latest releases. ETOBICOKE, ONTARIO, CANADA, July 24, 2024 \/EINPresswire.com\/ [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":156587,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[553],"tags":[],"class_list":["post-156586","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-books"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"Out of Season by Tom Gilroy Jungle Courage by W. Blake Gibbs Seven Years of Tribulation by John D. Cadore Finding Home by Boontak Ko Chitta I&#039;ll Suffer First by Derek Chandler Authors pen tales of triumph and transformation that offer insight into human experience in latest releases. ETOBICOKE, ONTARIO, CANADA, July 24, 2024 \/EINPresswire.com\/\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"Five Books Chronicle Journeys of Resilience and Redemption - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"Out of Season by Tom Gilroy Jungle Courage by W. Blake Gibbs Seven Years of Tribulation by John D. Cadore Finding Home by Boontak Ko Chitta I&#039;ll Suffer First by Derek Chandler Authors pen tales of triumph and transformation that offer insight into human experience in latest releases. ETOBICOKE, ONTARIO, CANADA, July 24, 2024 \/EINPresswire.com\/\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/img.einpresswire.com\/medium\/711967\/out-of-season.png\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/img.einpresswire.com\/medium\/711967\/out-of-season.png\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2024-07-27T07:44:14+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2024-07-27T07:44:14+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"Five Books Chronicle Journeys of Resilience and Redemption - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"Out of Season by Tom Gilroy Jungle Courage by W. Blake Gibbs Seven Years of Tribulation by John D. Cadore Finding Home by Boontak Ko Chitta I&#039;ll Suffer First by Derek Chandler Authors pen tales of triumph and transformation that offer insight into human experience in latest releases. ETOBICOKE, ONTARIO, CANADA, July 24, 2024 \/EINPresswire.com\/\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/img.einpresswire.com\/medium\/711967\/out-of-season.png\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/#blogposting\",\"name\":\"Five Books Chronicle Journeys of Resilience and Redemption - Beauty Ring Magazine\",\"headline\":\"Five Books Chronicle Journeys of Resilience and Redemption\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/711967\\\/out-of-season.png\"},\"datePublished\":\"2024-07-27T07:44:14-04:00\",\"dateModified\":\"2024-07-27T07:44:14-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/#webpage\"},\"articleSection\":\"Books\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/#listItem\",\"position\":2,\"name\":\"Books\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/#listItem\",\"position\":3,\"name\":\"Five Books Chronicle Journeys of Resilience and Redemption\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/\",\"name\":\"Five Books Chronicle Journeys of Resilience and Redemption - Beauty Ring Magazine\",\"description\":\"Out of Season by Tom Gilroy Jungle Courage by W. Blake Gibbs Seven Years of Tribulation by John D. Cadore Finding Home by Boontak Ko Chitta I'll Suffer First by Derek Chandler Authors pen tales of triumph and transformation that offer insight into human experience in latest releases. ETOBICOKE, ONTARIO, CANADA, July 24, 2024 \\\/EINPresswire.com\\\/\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/711967\\\/out-of-season.png\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/#mainImage\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-books-chronicle-journeys-of-resilience-and-redemption\\\/#mainImage\"},\"datePublished\":\"2024-07-27T07:44:14-04:00\",\"dateModified\":\"2024-07-27T07:44:14-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>Five Books Chronicle Journeys of Resilience and Redemption - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"Five Books Chronicle Journeys of Resilience and Redemption - Beauty Ring Magazine","description":"Out of Season by Tom Gilroy Jungle Courage by W. Blake Gibbs Seven Years of Tribulation by John D. Cadore Finding Home by Boontak Ko Chitta I'll Suffer First by Derek Chandler Authors pen tales of triumph and transformation that offer insight into human experience in latest releases. ETOBICOKE, ONTARIO, CANADA, July 24, 2024 \/EINPresswire.com\/","canonical_url":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"Five Books Chronicle Journeys of Resilience and Redemption - Beauty Ring Magazine","og:description":"Out of Season by Tom Gilroy Jungle Courage by W. Blake Gibbs Seven Years of Tribulation by John D. Cadore Finding Home by Boontak Ko Chitta I'll Suffer First by Derek Chandler Authors pen tales of triumph and transformation that offer insight into human experience in latest releases. ETOBICOKE, ONTARIO, CANADA, July 24, 2024 \/EINPresswire.com\/","og:url":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/","og:image":"https:\/\/img.einpresswire.com\/medium\/711967\/out-of-season.png","og:image:secure_url":"https:\/\/img.einpresswire.com\/medium\/711967\/out-of-season.png","article:published_time":"2024-07-27T07:44:14+00:00","article:modified_time":"2024-07-27T07:44:14+00:00","twitter:card":"summary_large_image","twitter:title":"Five Books Chronicle Journeys of Resilience and Redemption - Beauty Ring Magazine","twitter:description":"Out of Season by Tom Gilroy Jungle Courage by W. Blake Gibbs Seven Years of Tribulation by John D. Cadore Finding Home by Boontak Ko Chitta I'll Suffer First by Derek Chandler Authors pen tales of triumph and transformation that offer insight into human experience in latest releases. ETOBICOKE, ONTARIO, CANADA, July 24, 2024 \/EINPresswire.com\/","twitter:image":"https:\/\/img.einpresswire.com\/medium\/711967\/out-of-season.png","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/#blogposting","name":"Five Books Chronicle Journeys of Resilience and Redemption - Beauty Ring Magazine","headline":"Five Books Chronicle Journeys of Resilience and Redemption","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/711967\/out-of-season.png"},"datePublished":"2024-07-27T07:44:14-04:00","dateModified":"2024-07-27T07:44:14-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/#webpage"},"articleSection":"Books"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/books\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/books\/#listItem","position":2,"name":"Books","item":"https:\/\/beautyring.info\/category\/books\/","nextItem":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/#listItem","position":3,"name":"Five Books Chronicle Journeys of Resilience and Redemption","previousItem":"https:\/\/beautyring.info\/category\/books\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/#webpage","url":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/","name":"Five Books Chronicle Journeys of Resilience and Redemption - Beauty Ring Magazine","description":"Out of Season by Tom Gilroy Jungle Courage by W. Blake Gibbs Seven Years of Tribulation by John D. Cadore Finding Home by Boontak Ko Chitta I'll Suffer First by Derek Chandler Authors pen tales of triumph and transformation that offer insight into human experience in latest releases. ETOBICOKE, ONTARIO, CANADA, July 24, 2024 \/EINPresswire.com\/","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/711967\/out-of-season.png","@id":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/#mainImage"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/#mainImage"},"datePublished":"2024-07-27T07:44:14-04:00","dateModified":"2024-07-27T07:44:14-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"156586","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2024-07-27 07:44:17","updated":"2024-07-27 07:45:14"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/books\/\" title=\"Books\">Books<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tFive Books Chronicle Journeys of Resilience and Redemption\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Books","link":"https:\/\/beautyring.info\/category\/books\/"},{"label":"Five Books Chronicle Journeys of Resilience and Redemption","link":"https:\/\/beautyring.info\/books\/five-books-chronicle-journeys-of-resilience-and-redemption\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/156586"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=156586"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/156586\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/156587"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=156586"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=156586"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=156586"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}