{"id":156808,"date":"2024-07-30T12:24:59","date_gmt":"2024-07-30T12:24:59","guid":{"rendered":"https:\/\/beautyring.info\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/"},"modified":"2024-07-30T12:24:59","modified_gmt":"2024-07-30T12:24:59","slug":"five-authors-explore-various-worlds-of-wonder-at-the-maple-staple","status":"publish","type":"post","link":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/","title":{"rendered":"Five Authors Explore Various Worlds of Wonder at The Maple Staple"},"content":{"rendered":"<p><\/p>\n<div>\n<div class=\"pr_images_column\">\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/714135\/a-drill-instructor-s-journey.png#1500x1174\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/714135\/a-drill-instructor-s-journey.png\" width=\"300\" height=\"234\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>A Drill Instructor’s Journey by Larry Allen Mcnair, Sr.<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/714138\/pues-llamame-padre-just-call-m.png#1500x1174\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/714138\/pues-llamame-padre-just-call-m.png\" width=\"300\" height=\"234\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Pues Llamame Padre (Just Call Me Father) by John Jake Lopez<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/714141\/unknown-paris-exploring-off-th.png#1500x1174\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/714141\/unknown-paris-exploring-off-th.png\" width=\"300\" height=\"234\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Unknown Paris: Exploring Off The Beaten Path In The World&#8217;s Most Beloved City by Steve Boggs<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/631210\/my-cemetery-friends-a-garden-o.png#1500x1174\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/631210\/my-cemetery-friends-a-garden-o.png\" width=\"300\" height=\"234\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>My Cemetery Friends: A Garden of Encounters at Mount Saint Mary in Queens, New York<\/p>\n<\/div>\n<div class=\"pr_image\"><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/img.einpresswire.com\/large\/714081\/dueling-sisters.png#1500x1174\" data-wpel-link=\"external\"><img decoding=\"async\" src=\"https:\/\/img.einpresswire.com\/medium\/714081\/dueling-sisters.png\" width=\"300\" height=\"234\" style=\"max-width: 100%; height: auto;\"\/><\/a><\/p>\n<p>Dueling Sisters by Katie Moak and Louise Jetton<\/p>\n<\/div>\n<\/div>\n<p style=\"margin-bottom:1em;font-size:115%;\"><i>From military memoirs, to hidden Paris gems, to reflections on life, these captivating tales await discovery at the Toronto-based bookstore.<\/i><\/p>\n<p>ETOBICOKE, ONTARIO, CANADA, July 29, 2024 \/<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/\" dir=\"auto\" data-wpel-link=\"external\">EINPresswire.com<\/a>\/ &#8212; Diverse journeys and experience presented in five compelling books await readers of all types. Each title offers a unique perspective, from the disciplined world of a drill instructor to the hidden gems of Paris, intimate family stories, reflective cemetery encounters, and fantastical sibling adventures. These books, penned by talented authors, invite readers to step into different worlds and uncover the richness of life&#8217;s varied paths.<\/p>\n<p>Starting with a journey of discipline and leadership, Larry Allen McNair Sr., a retired Master Sergeant of the United States Marine Corps, shares the dynamic world of military life through his eyes in his new book, “A Drill Instructor’s Journey”. This engrossing memoir offers an insightful look into the experiences of those who have served, are currently serving, and those who appreciate creative and evocative narratives.<\/p>\n<p>In “A Drill Instructor’s Journey”, readers will find a collection of stories that blend fictional and real-life experiences, reflecting the depth and complexity of military service. McNair&#8217;s storytelling captures the essence of the military experience, making it an engaging read for veterans, active-duty personnel, and anyone with an interest in military life.<\/p>\n<p>Larry Allen McNair Sr. shares his journey from his time in the Marine Corps to his life after retirement. Through his vivid and honest storytelling, he aims to offer a unique perspective on the challenges and triumphs faced by those in the armed forces. McNair’s narratives provide a window into the discipline, camaraderie, and resilience that define military life.<\/p>\n<p>Shifting from leadership to personal identity, author John Lopez presents “Pues Llámame Padre (Just Call Me Father)”, a historical novel that delves into the life of Dominic Martinez, a Mexican-American teenager with aspirations of becoming a priest. Set in the 1960s, this captivating story explores the challenges and triumphs Dominic faces as he navigates the complexities of seminary life and the broader social changes of the era.<\/p>\n<p>Dominic Martinez enters the minor seminary as a high school freshman, supported by his family, parish priest, and community. His journey is marked by the struggle to adapt to a changing world and the demands of living in an all-male community away from his tight-knit family. Throughout the novel, Dominic must decide whether to stay in the seminary and pursue his dream of becoming a priest or to forge a different path in life.<\/p>\n<p>John Lopez’s narrative skillfully weaves together themes of faith, identity, and societal change, offering readers a moving exploration of one young man’s quest for self-discovery and purpose. Through Dominic’s experiences, Lopez invites readers to reflect on the universal themes of sacrifice, determination, and the pursuit of dreams.<\/p>\n<p>Moving from personal identity to exploring hidden places, Steve Boggs presents “Unknown Paris: Exploring Off The Beaten Path In The World&#8217;s Most Beloved City”, a captivating guidebook that reveals the lesser-known wonders of Paris. Ideal for both first-time visitors and seasoned travelers, this book offers a unique perspective on the city beyond its famous landmarks.<\/p>\n<p>“Unknown Paris” is meticulously organized by arrondissement, allowing readers to efficiently navigate each district and immerse themselves in its distinct charm. Each section features a concise historical overview, stunning photographs to evoke the atmosphere, intriguing biographical insights, and practical maps for easy orientation.<\/p>\n<p>Steve Boggs brings a deep-rooted love for France to his writing, cultivated through extensive travels across the country with his wife. Paris holds a special place in their hearts, serving as a constant source of discovery and inspiration. With personal connections to France through family and education, Boggs captures the allure of Paris’ hidden corners and invites readers to experience its magic firsthand, and encourages exploration of hidden cafés, boutique shops, and cultural gems that define the essence of Parisian life.<\/p>\n<p>Transitioning from hidden places to reflective encounters, Vincent J. Tomeo invites readers to stroll through the lush landscape of “My Cemetery Friends: A Garden of Encounters at Mount Saint Mary in Queens, New York”. This collection of poetry and prose transcends time and place, celebrating the interconnectedness of humanity amidst the serene backdrop of Mount Saint Mary Cemetery.<\/p>\n<p>“My Cemetery Friends” is more than a book; it is a tribute to life itself. Tomeo, a renowned poet and author, guides readers along garden pathways where each encounter with a gravestone becomes a profound reflection on love, loss, and the enduring spirit of those who came before us. Through lyrical verses and heartfelt prose, Tomeo honors not only lost loved ones but also the unsung heroes and forgotten souls laid to rest.<\/p>\n<p>Born and raised in Corona, Queens, NYC, Vincent J. Tomeo brings a deep-rooted passion for storytelling and poetic expression to his work. His poetry has resonated across continents, from local recitals in Queens to international acclaim in countries like Italy, Australia, and South Korea. Tomeo&#8217;s literary achievements include winning Honorable Mention in the Rainer Maria Rilke International Poetry Competition and having his poem “A View from a Tower in Calabria, Italy” immortalized in marble—an honor that reflects the philosophical impact of his words.<\/p>\n<p>Concluding with a leap into the fantastical, Katie Moak and Louise Jetton’s “Dueling Sisters” promises a unique literary journey where sibling rivalry meets creative collaboration. Born out of the spirited exchanges between two sisters who have traversed the globe as military wives, this book challenges the notion that the pen is mightier than the sword—by proving it with every tale they weave.<\/p>\n<p>Set against the backdrop of Southeast Texas, Katie and Louise Jetton bring their rich life experiences to the pages of “Dueling Sisters”. Each short story, penned from both ends of the book, showcases their distinct voices and storytelling prowess. From the mundane to the extraordinary, their narratives capture the essence of family bonds, resilience, and the joy of friendly competition.<\/p>\n<p>Katie Moak, hailing from a large, creative family in rural Southeast Texas, discovered the power of words at a young age. Her journey from sketching sunsets with a pencil to painting vivid landscapes with prose embodies her lifelong passion for storytelling. Her extensive travels across Europe with her family further enriched her writing, fueling a diverse tapestry of characters and settings in her work.<\/p>\n<p>Louise Jetton, Katie&#8217;s sister and co-author, brings a unique perspective shaped by her upbringing during the Great Depression and her career as an educator. With a deep love for storytelling instilled from childhood, Louise&#8217;s tales resonate with authenticity and warmth, drawing from a lifetime of experiences spanning teaching, military life, and cherished family moments.<\/p>\n<p>Together, Katie and Louise&#8217;s collaboration in “Dueling Sisters” celebrates the art of storytelling as an avenue to showcase their shared love for literature and family heritage. Their writing transcends mere words, inviting readers to embark on a heartfelt journey through laughter, nostalgia, and the enduring power of sisterhood.<\/p>\n<p>Each with its unique journey and perspective, these five books offer readers a chance to explore different facets of life. From the rigorous world of a drill instructor to the imaginative realms of fantasy, these stories highlight the diverse paths that enrich our understanding of the world.<\/p>\n<p>These captivating narratives now grace the Spotlight Shelves of <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/themaplestaple.com\/\" data-wpel-link=\"external\">The Maple Staple<\/a> bookstore, both in-store and online. To experience the magic of these diverse worlds, visit <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.themaplestaple.com\" data-wpel-link=\"external\">https:\/\/www.themaplestaple.com<\/a>. Interested minds can further explore this rich collection of tales that resonate with the heart and stir the imagination as these are now available for purchase at major online book retailers such as Amazon and Barnes &amp; Noble.<\/p>\n<p>About The Maple Staple:<\/p>\n<p>For bookworms, by passionate writers.<\/p>\n<p>At The Maple Staple, books come alive beyond mere pages. It&#8217;s more than a bookstore—it&#8217;s a community hub for book enthusiasts and budding authors. Celebrating diversity, they curate books from up-and-coming independent writers, and offer a platform to underrepresented voices. With captivating events and book clubs in the heart of Toronto, they foster a vibrant literary community, igniting inspiration and transformation through the enchanting power of words.<\/p>\n<p>About <a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.booksidepress.com\/\" data-wpel-link=\"external\">Bookside Press<\/a>:<\/p>\n<p>Bringing stories and ideas to life, one tap at a time.<\/p>\n<p>Bookside Press is all about creating buzz in the digital world. Buzz that&#8217;ll have each vital message be heard loud and clear. Headquartered in Canada, this hybrid publishing and advertising company aims to share the magic of its authors&#8217; books with the world. With a dedicated team of creatives and marketing professionals, Bookside Press collaborates with clients in building better brands that stand out and reach greater heights.<br \/>&#13;\n<\/p>\n<p class=\"contact\" dir=\"auto\" style=\"margin: 1em 0;\">Emmanuel Laguardia<br \/>The MapleStaple<br \/>+1 647-330-9992<br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"http:\/\/www.einpresswire.com\/contact_author\/731359404\" data-src=\"ZK5qAQ9tNNrKUoEK\" data-wpel-link=\"external\">email us here<\/a><br \/>Visit us on social media:<br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.facebook.com\/TheMapleStapleBookstore\/\" data-wpel-link=\"external\">Facebook<\/a><br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/twitter.com\/The_MapleStaple\" data-wpel-link=\"external\">X<\/a><br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.instagram.com\/themaplestaplebookstore\/\" data-wpel-link=\"external\">Instagram<\/a><br \/><a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/youtube.com\/@themaplestaple\" data-wpel-link=\"external\">YouTube<\/a><\/p>\n<p>    <img decoding=\"async\" alt=\"\" class=\"prtr\" src=\"https:\/\/www.einpresswire.com\/tracking\/article.gif?t=2&amp;a=r65XFolgMWv79vSN&amp;i=ZK5qAQ9tNNrKUoEK\"\/><\/p>\n<div class=\"article-footer\">\n<p class=\"text-center\">You just read:<\/p>\n<div class=\"share-vertical-bottom\">\n<div class=\"fleft pull-left\">\n<p>News Provided By<\/p>\n<p>\n      July 29, 2024, 18:41 GMT\n    <\/p>\n<\/p><\/div>\n<\/div>\n<p>      <input readonly=\"readonly\" type=\"text\" value=\"https:\/\/www.einpresswire.com\/article\/731359404\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\"\/><\/p>\n<p>\n        <br \/>EIN Presswire&#8217;s priority is source transparency. We do not allow opaque clients, and our editors try to be careful about weeding out false and misleading content.<br \/>\nAs a user, if you see something we have missed, please do bring it to our attention. Your help is welcome. EIN Presswire, Everyone&#8217;s Internet News Presswire,<br \/>\ntries to define some of the boundaries that are reasonable in today&#8217;s world. Please see our<br \/>\n<a rel=\"noopener nofollow external noreferrer sponsored\" target=\"_blank\" href=\"https:\/\/www.einpresswire.com\/editorial-guidelines\" data-wpel-link=\"external\">Editorial Guidelines<\/a><br \/>\nfor more information.\n      <\/p>\n<\/p><\/div>\n<\/p><\/div>\n<p><script async src=\"\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><script async src=\"\/\/www.instagram.com\/embed.js\"><\/script><br \/>\n<br \/>Originally published at <a href=\"https:\/\/www.einpresswire.com\/article\/731359404\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\" data-wpel-link=\"external\" target=\"_blank\" rel=\"nofollow external noopener noreferrer sponsored\">https:\/\/www.einpresswire.com\/article\/731359404\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>A Drill Instructor’s Journey by Larry Allen Mcnair, Sr. Pues Llamame Padre (Just Call Me Father) by John Jake Lopez Unknown Paris: Exploring Off The Beaten Path In The World&#8217;s Most Beloved City by Steve Boggs My Cemetery Friends: A Garden of Encounters at Mount Saint Mary in Queens, New York Dueling Sisters by Katie [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":156809,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[553],"tags":[],"class_list":["post-156808","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-books"],"aioseo_notices":[],"aioseo_head":"\n\t\t<!-- All in One SEO Pro 4.6.8.1 - aioseo.com -->\n\t\t<meta name=\"description\" content=\"A Drill Instructor’s Journey by Larry Allen Mcnair, Sr. Pues Llamame Padre (Just Call Me Father) by John Jake Lopez Unknown Paris: Exploring Off The Beaten Path In The World&#039;s Most Beloved City by Steve Boggs My Cemetery Friends: A Garden of Encounters at Mount Saint Mary in Queens, New York Dueling Sisters by Katie\" \/>\n\t\t<meta name=\"robots\" content=\"max-image-preview:large\" \/>\n\t\t<link rel=\"canonical\" href=\"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/\" \/>\n\t\t<meta name=\"generator\" content=\"All in One SEO Pro (AIOSEO) 4.6.8.1\" \/>\n\t\t<meta property=\"og:locale\" content=\"en_US\" \/>\n\t\t<meta property=\"og:site_name\" content=\"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.\" \/>\n\t\t<meta property=\"og:type\" content=\"article\" \/>\n\t\t<meta property=\"og:title\" content=\"Five Authors Explore Various Worlds of Wonder at The Maple Staple - Beauty Ring Magazine\" \/>\n\t\t<meta property=\"og:description\" content=\"A Drill Instructor’s Journey by Larry Allen Mcnair, Sr. Pues Llamame Padre (Just Call Me Father) by John Jake Lopez Unknown Paris: Exploring Off The Beaten Path In The World&#039;s Most Beloved City by Steve Boggs My Cemetery Friends: A Garden of Encounters at Mount Saint Mary in Queens, New York Dueling Sisters by Katie\" \/>\n\t\t<meta property=\"og:url\" content=\"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/\" \/>\n\t\t<meta property=\"og:image\" content=\"https:\/\/img.einpresswire.com\/medium\/714135\/a-drill-instructor-s-journey.png\" \/>\n\t\t<meta property=\"og:image:secure_url\" content=\"https:\/\/img.einpresswire.com\/medium\/714135\/a-drill-instructor-s-journey.png\" \/>\n\t\t<meta property=\"article:published_time\" content=\"2024-07-30T12:24:59+00:00\" \/>\n\t\t<meta property=\"article:modified_time\" content=\"2024-07-30T12:24:59+00:00\" \/>\n\t\t<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n\t\t<meta name=\"twitter:title\" content=\"Five Authors Explore Various Worlds of Wonder at The Maple Staple - Beauty Ring Magazine\" \/>\n\t\t<meta name=\"twitter:description\" content=\"A Drill Instructor’s Journey by Larry Allen Mcnair, Sr. Pues Llamame Padre (Just Call Me Father) by John Jake Lopez Unknown Paris: Exploring Off The Beaten Path In The World&#039;s Most Beloved City by Steve Boggs My Cemetery Friends: A Garden of Encounters at Mount Saint Mary in Queens, New York Dueling Sisters by Katie\" \/>\n\t\t<meta name=\"twitter:image\" content=\"https:\/\/img.einpresswire.com\/medium\/714135\/a-drill-instructor-s-journey.png\" \/>\n\t\t<script type=\"application\/ld+json\" class=\"aioseo-schema\">\n\t\t\t{\"@context\":\"https:\\\/\\\/schema.org\",\"@graph\":[{\"@type\":\"BlogPosting\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/#blogposting\",\"name\":\"Five Authors Explore Various Worlds of Wonder at The Maple Staple - Beauty Ring Magazine\",\"headline\":\"Five Authors Explore Various Worlds of Wonder at The Maple Staple\",\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/714135\\\/a-drill-instructor-s-journey.png\"},\"datePublished\":\"2024-07-30T12:24:59-04:00\",\"dateModified\":\"2024-07-30T12:24:59-04:00\",\"inLanguage\":\"en-US\",\"mainEntityOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/#webpage\"},\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/#webpage\"},\"articleSection\":\"Books\"},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/#breadcrumblist\",\"itemListElement\":[{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#listItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\\\/\\\/beautyring.info\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/#listItem\",\"position\":2,\"name\":\"Books\",\"item\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/\",\"nextItem\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/#listItem\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/#listItem\"},{\"@type\":\"ListItem\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/#listItem\",\"position\":3,\"name\":\"Five Authors Explore Various Worlds of Wonder at The Maple Staple\",\"previousItem\":\"https:\\\/\\\/beautyring.info\\\/category\\\/books\\\/#listItem\"}]},{\"@type\":\"Organization\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/beautyring.info\\\/wp-content\\\/uploads\\\/2023\\\/04\\\/beautyring.jpeg\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/#organizationLogo\",\"width\":200,\"height\":200,\"caption\":\"Beauty Ring magazine\"},\"image\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/#organizationLogo\"}},{\"@type\":\"Person\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\",\"url\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/\",\"name\":\"Sarah J.M.\"},{\"@type\":\"WebPage\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/#webpage\",\"url\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/\",\"name\":\"Five Authors Explore Various Worlds of Wonder at The Maple Staple - Beauty Ring Magazine\",\"description\":\"A Drill Instructor\\u2019s Journey by Larry Allen Mcnair, Sr. Pues Llamame Padre (Just Call Me Father) by John Jake Lopez Unknown Paris: Exploring Off The Beaten Path In The World's Most Beloved City by Steve Boggs My Cemetery Friends: A Garden of Encounters at Mount Saint Mary in Queens, New York Dueling Sisters by Katie\",\"inLanguage\":\"en-US\",\"isPartOf\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\"},\"breadcrumb\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/#breadcrumblist\"},\"author\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"creator\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/author\\\/theminpurpleldi\\\/#author\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https:\\\/\\\/img.einpresswire.com\\\/medium\\\/714135\\\/a-drill-instructor-s-journey.png\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/#mainImage\"},\"primaryImageOfPage\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/books\\\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\\\/#mainImage\"},\"datePublished\":\"2024-07-30T12:24:59-04:00\",\"dateModified\":\"2024-07-30T12:24:59-04:00\"},{\"@type\":\"WebSite\",\"@id\":\"https:\\\/\\\/beautyring.info\\\/#website\",\"url\":\"https:\\\/\\\/beautyring.info\\\/\",\"name\":\"Beauty Ring Magazine\",\"description\":\"Online magazine about beauty, fashion, hotels and resorts and publishing.\",\"inLanguage\":\"en-US\",\"publisher\":{\"@id\":\"https:\\\/\\\/beautyring.info\\\/#organization\"}}]}\n\t\t<\/script>\n\t\t<!-- All in One SEO Pro -->\r\n\t\t<title>Five Authors Explore Various Worlds of Wonder at The Maple Staple - Beauty Ring Magazine<\/title>\n\n","aioseo_head_json":{"title":"Five Authors Explore Various Worlds of Wonder at The Maple Staple - Beauty Ring Magazine","description":"A Drill Instructor’s Journey by Larry Allen Mcnair, Sr. Pues Llamame Padre (Just Call Me Father) by John Jake Lopez Unknown Paris: Exploring Off The Beaten Path In The World's Most Beloved City by Steve Boggs My Cemetery Friends: A Garden of Encounters at Mount Saint Mary in Queens, New York Dueling Sisters by Katie","canonical_url":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/","robots":"max-image-preview:large","keywords":"","webmasterTools":{"miscellaneous":""},"og:locale":"en_US","og:site_name":"Beauty Ring Magazine - Online magazine about beauty, fashion, hotels and resorts and publishing.","og:type":"article","og:title":"Five Authors Explore Various Worlds of Wonder at The Maple Staple - Beauty Ring Magazine","og:description":"A Drill Instructor’s Journey by Larry Allen Mcnair, Sr. Pues Llamame Padre (Just Call Me Father) by John Jake Lopez Unknown Paris: Exploring Off The Beaten Path In The World's Most Beloved City by Steve Boggs My Cemetery Friends: A Garden of Encounters at Mount Saint Mary in Queens, New York Dueling Sisters by Katie","og:url":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/","og:image":"https:\/\/img.einpresswire.com\/medium\/714135\/a-drill-instructor-s-journey.png","og:image:secure_url":"https:\/\/img.einpresswire.com\/medium\/714135\/a-drill-instructor-s-journey.png","article:published_time":"2024-07-30T12:24:59+00:00","article:modified_time":"2024-07-30T12:24:59+00:00","twitter:card":"summary_large_image","twitter:title":"Five Authors Explore Various Worlds of Wonder at The Maple Staple - Beauty Ring Magazine","twitter:description":"A Drill Instructor’s Journey by Larry Allen Mcnair, Sr. Pues Llamame Padre (Just Call Me Father) by John Jake Lopez Unknown Paris: Exploring Off The Beaten Path In The World's Most Beloved City by Steve Boggs My Cemetery Friends: A Garden of Encounters at Mount Saint Mary in Queens, New York Dueling Sisters by Katie","twitter:image":"https:\/\/img.einpresswire.com\/medium\/714135\/a-drill-instructor-s-journey.png","schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"BlogPosting","@id":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/#blogposting","name":"Five Authors Explore Various Worlds of Wonder at The Maple Staple - Beauty Ring Magazine","headline":"Five Authors Explore Various Worlds of Wonder at The Maple Staple","author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"publisher":{"@id":"https:\/\/beautyring.info\/#organization"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/714135\/a-drill-instructor-s-journey.png"},"datePublished":"2024-07-30T12:24:59-04:00","dateModified":"2024-07-30T12:24:59-04:00","inLanguage":"en-US","mainEntityOfPage":{"@id":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/#webpage"},"isPartOf":{"@id":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/#webpage"},"articleSection":"Books"},{"@type":"BreadcrumbList","@id":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/#breadcrumblist","itemListElement":[{"@type":"ListItem","@id":"https:\/\/beautyring.info\/#listItem","position":1,"name":"Home","item":"https:\/\/beautyring.info\/","nextItem":"https:\/\/beautyring.info\/category\/books\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/category\/books\/#listItem","position":2,"name":"Books","item":"https:\/\/beautyring.info\/category\/books\/","nextItem":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/#listItem","previousItem":"https:\/\/beautyring.info\/#listItem"},{"@type":"ListItem","@id":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/#listItem","position":3,"name":"Five Authors Explore Various Worlds of Wonder at The Maple Staple","previousItem":"https:\/\/beautyring.info\/category\/books\/#listItem"}]},{"@type":"Organization","@id":"https:\/\/beautyring.info\/#organization","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","url":"https:\/\/beautyring.info\/","logo":{"@type":"ImageObject","url":"https:\/\/beautyring.info\/wp-content\/uploads\/2023\/04\/beautyring.jpeg","@id":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/#organizationLogo","width":200,"height":200,"caption":"Beauty Ring magazine"},"image":{"@id":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/#organizationLogo"}},{"@type":"Person","@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author","url":"https:\/\/beautyring.info\/author\/theminpurpleldi\/","name":"Sarah J.M."},{"@type":"WebPage","@id":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/#webpage","url":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/","name":"Five Authors Explore Various Worlds of Wonder at The Maple Staple - Beauty Ring Magazine","description":"A Drill Instructor’s Journey by Larry Allen Mcnair, Sr. Pues Llamame Padre (Just Call Me Father) by John Jake Lopez Unknown Paris: Exploring Off The Beaten Path In The World's Most Beloved City by Steve Boggs My Cemetery Friends: A Garden of Encounters at Mount Saint Mary in Queens, New York Dueling Sisters by Katie","inLanguage":"en-US","isPartOf":{"@id":"https:\/\/beautyring.info\/#website"},"breadcrumb":{"@id":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/#breadcrumblist"},"author":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"creator":{"@id":"https:\/\/beautyring.info\/author\/theminpurpleldi\/#author"},"image":{"@type":"ImageObject","url":"https:\/\/img.einpresswire.com\/medium\/714135\/a-drill-instructor-s-journey.png","@id":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/#mainImage"},"primaryImageOfPage":{"@id":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/#mainImage"},"datePublished":"2024-07-30T12:24:59-04:00","dateModified":"2024-07-30T12:24:59-04:00"},{"@type":"WebSite","@id":"https:\/\/beautyring.info\/#website","url":"https:\/\/beautyring.info\/","name":"Beauty Ring Magazine","description":"Online magazine about beauty, fashion, hotels and resorts and publishing.","inLanguage":"en-US","publisher":{"@id":"https:\/\/beautyring.info\/#organization"}}]}},"aioseo_meta_data":{"post_id":"156808","title":null,"description":null,"keywords":null,"keyphrases":null,"primary_term":null,"canonical_url":null,"og_title":null,"og_description":null,"og_object_type":"default","og_image_type":"default","og_image_url":null,"og_image_width":null,"og_image_height":null,"og_image_custom_url":null,"og_image_custom_fields":null,"og_video":null,"og_custom_url":null,"og_article_section":null,"og_article_tags":null,"twitter_use_og":false,"twitter_card":"default","twitter_image_type":"default","twitter_image_url":null,"twitter_image_custom_url":null,"twitter_image_custom_fields":null,"twitter_title":null,"twitter_description":null,"schema":{"blockGraphs":[],"customGraphs":[],"default":{"data":{"Article":[],"Course":[],"Dataset":[],"FAQPage":[],"Movie":[],"Person":[],"Product":[],"ProductReview":[],"Car":[],"Recipe":[],"Service":[],"SoftwareApplication":[],"WebPage":[]},"graphName":"","isEnabled":true},"graphs":[]},"schema_type":"default","schema_type_options":null,"pillar_content":false,"robots_default":true,"robots_noindex":false,"robots_noarchive":false,"robots_nosnippet":false,"robots_nofollow":false,"robots_noimageindex":false,"robots_noodp":false,"robots_notranslate":false,"robots_max_snippet":null,"robots_max_videopreview":null,"robots_max_imagepreview":"large","priority":null,"frequency":null,"local_seo":null,"limit_modified_date":false,"open_ai":null,"created":"2024-07-30 12:25:02","updated":"2024-07-30 12:27:10"},"aioseo_breadcrumb":"<div class=\"aioseo-breadcrumbs\"><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\" title=\"Home\">Home<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\t<a href=\"https:\/\/beautyring.info\/category\/books\/\" title=\"Books\">Books<\/a>\n<\/span><span class=\"aioseo-breadcrumb-separator\">&raquo;<\/span><span class=\"aioseo-breadcrumb\">\n\tFive Authors Explore Various Worlds of Wonder at The Maple Staple\n<\/span><\/div>","aioseo_breadcrumb_json":[{"label":"Home","link":"https:\/\/beautyring.info"},{"label":"Books","link":"https:\/\/beautyring.info\/category\/books\/"},{"label":"Five Authors Explore Various Worlds of Wonder at The Maple Staple","link":"https:\/\/beautyring.info\/books\/five-authors-explore-various-worlds-of-wonder-at-the-maple-staple\/"}],"_links":{"self":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/156808"}],"collection":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/comments?post=156808"}],"version-history":[{"count":0,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/posts\/156808\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media\/156809"}],"wp:attachment":[{"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/media?parent=156808"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/categories?post=156808"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/beautyring.info\/wp-json\/wp\/v2\/tags?post=156808"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}